RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
/***************************************************************************//**
* \file cyip_usb32dev.h
*
* \brief
* USB32DEV IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_USB32DEV_H_
#define _CYIP_USB32DEV_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                   USB32DEV
*******************************************************************************/

#define USB32DEV_MAIN_SECTION_SIZE 0x00001000UL
#define USB32DEV_EPM_SECTION_SIZE 0x00001000UL
#define USB32DEV_LNK_SECTION_SIZE 0x00001000UL
#define USB32DEV_PROT_SECTION_SIZE 0x00001000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_SECTION_SIZE 0x00000800UL
#define USB32DEV_PHYSS_USB40PHY_RX_SECTION_SIZE 0x00000100UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_SECTION_SIZE 0x00000100UL
#define USB32DEV_PHYSS_USB40PHY_SECTION_SIZE 0x00001000UL
#define USB32DEV_PHYSS_SECTION_SIZE 0x00002000UL
#define USB32DEV_ADAPTER_DMA_SCK_SECTION_SIZE 0x00000080UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_SECTION_SIZE 0x00000100UL
#define USB32DEV_ADAPTER_DMA_SECTION_SIZE 0x00010000UL
#define USB32DEV_SECTION_SIZE          0x00030000UL

/**
  * \brief USB32 Main Register (USB32DEV_MAIN)
  */
typedef struct {
  __IOM uint32_t CTRL;                          /*!< 0x00000000 Main Control Register */
  __IOM uint32_t INTR;                          /*!< 0x00000004 Main Active Interrupt Register */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000008 Main Active Interrupt Set Register */
  __IOM uint32_t INTR_MASK;                     /*!< 0x0000000C Main Active Interrupt Mask Register */
   __IM uint32_t INTR_MASKED;                   /*!< 0x00000010 Main Active Interrupt Masked Register */
  __IOM uint32_t DDFT_MUX;                      /*!< 0x00000014 DDFT0/1 mux selection Register */
  __IOM uint32_t GPIO_DDFT_MUX;                 /*!< 0x00000018 GPIO DDFT0/1 mux selection Register */
  __IOM uint32_t DEBUG_CONFIG;                  /*!< 0x0000001C Debug Configuration Register */
  __IOM uint32_t DEBUG_MUX_SEL;                 /*!< 0x00000020 Debug MUX selection Configuration Register */
  __IOM uint32_t LOOPBACK;                      /*!< 0x00000024 LOOPBACK Configuration Register */
   __IM uint32_t RESERVED;
  __IOM uint32_t BUG_FIX;                       /*!< 0x0000002C BUG Fix Configuration Register */
   __IM uint32_t RESERVED1[1012];
} USB32DEV_MAIN_V1_Type;      /*!< Size = 4096 (0x1000) */

/**
  * \brief USB32 Controller End Point Manager Registers (USB32DEV_EPM)
  */
typedef struct {
  __IOM uint32_t EEPM_CS;                       /*!< 0x00000000 Egress EPM Retry Buffer Status */
  __IOM uint32_t IEPM_CS;                       /*!< 0x00000004 Ingress EPM Control and Status */
  __IOM uint32_t IEPM_MULT;                     /*!< 0x00000008 Ingress EPM MULT function Control */
   __IM uint32_t RESERVED[13];
  __IOM uint32_t EEPM_ENDPOINT[16];             /*!< 0x00000040 Egress EPM per Endpoint Control and Status */
  __IOM uint32_t IEPM_ENDPOINT[16];             /*!< 0x00000080 Ingress EPM Per Endpoint Control and Status */
   __IM uint32_t IEPM_FIFO;                     /*!< 0x000000C0 Ingress EPM FIFO Entry */
  __IOM uint32_t EEPM_VALID;                    /*!< 0x000000C4 Egress EPM Retry Buffer Valid packet */
   __IM uint32_t RESERVED1[15];
  __IOM uint32_t EEPM_RETRY_OFFSET[16];         /*!< 0x00000104 Egress EPM Retry Buffer EndPoint offset */
  __IOM uint32_t EEPM_INJECT_CRC32_ERROR[16];   /*!< 0x00000144 Egress EPM CRC32 Error injection control */
   __IM uint32_t RESERVED2[927];
} USB32DEV_EPM_V1_Type;       /*!< Size = 4096 (0x1000) */

/**
  * \brief USB32 SuperSpeedPlus Device Controller Link Layer Registers (USB32DEV_LNK)
  */
typedef struct {
  __IOM uint32_t LNK_CONF;                      /*!< 0x00000000 Link Configuration Register */
  __IOM uint32_t LNK_INTR;                      /*!< 0x00000004 Link Interrupts */
  __IOM uint32_t LNK_INTR_SET;                  /*!< 0x00000008 Link Interrupts Set */
  __IOM uint32_t LNK_INTR_MASK;                 /*!< 0x0000000C Link Interrupts Mask */
   __IM uint32_t LNK_INTR_MASKED;               /*!< 0x00000010 Link Interrupts Masked */
  __IOM uint32_t LNK_ERROR_CONF;                /*!< 0x00000014 Link Error Counter Configuration */
  __IOM uint32_t LNK_ERROR_STATUS;              /*!< 0x00000018 Link Error Status Register */
   __IM uint32_t LNK_ERROR_COUNT;               /*!< 0x0000001C Error Counter Register */
  __IOM uint32_t LNK_ERROR_COUNT_THRESHOLD;     /*!< 0x00000020 Error Count Thresholds */
  __IOM uint32_t LNK_PHY_CONF;                  /*!< 0x00000024 USB 3.0 PHY Configuration */
   __IM uint32_t LNK_PHY_STATUS;                /*!< 0x00000028 USB 3.0 PHY Status */
   __IM uint32_t RESERVED[7];
  __IOM uint32_t LNK_PHY_ERROR_CONF;            /*!< 0x00000048 PHY Error Counter Configuration */
  __IOM uint32_t LNK_PHY_ERROR_STATUS;          /*!< 0x0000004C PHY Error Status Register */
  __IOM uint32_t LNK_PHY_TRAINING_HOLDOFF;      /*!< 0x00000050 PHY Training Hold Off */
   __IM uint32_t LNK_COMMAND_WORD;              /*!< 0x00000054 Link Command Word (received) */
  __IOM uint32_t LNK_DEVICE_POWER_CONTROL;      /*!< 0x00000058 USB 3.0 Device Power State Control */
  __IOM uint32_t LNK_LTSSM_STATE;               /*!< 0x0000005C Link Training Status State Machine (LTSSM) State */
  __IOM uint32_t LNK_LOOPBACK_INIT;             /*!< 0x00000060 Loopback LFSR Initial Value */
  __IOM uint32_t LNK_LOOPBACK_GENERATOR;        /*!< 0x00000064 Loopback LFSR Transmitter Generator Polynomial */
  __IOM uint32_t LNK_LTSSM_OBSERVE;             /*!< 0x00000068 Link Training Status State Machine (LTSSM) Observation */
  __IOM uint32_t LNK_LFPS_OBSERVE;              /*!< 0x0000006C LFPS Receiver Observability */
  __IOM uint32_t LNK_LFPS_TX_POLLING_BURST;     /*!< 0x00000070 LFPS Polling Transmit Configuration */
  __IOM uint32_t LNK_LFPS_TX_POLLING_REPEAT;    /*!< 0x00000074 LFPS Polling Transmit Configuration */
  __IOM uint32_t LNK_LFPS_TX_PING_BURST;        /*!< 0x00000078 LFPS Ping Transmit Configuration */
  __IOM uint32_t LNK_LFPS_TX_PING_REPEAT;       /*!< 0x0000007C LFPS Ping Transmit Configuration */
  __IOM uint32_t LNK_LFPS_TX_U1_EXIT;           /*!< 0x00000080 LFPS U1_EXIT Transmit Configuration */
  __IOM uint32_t LNK_LFPS_TX_U2_EXIT;           /*!< 0x00000084 LFPS U2_EXIT Transmit Configuration */
  __IOM uint32_t LNK_LFPS_TX_U3_EXIT;           /*!< 0x00000088 LFPS U3 Exit Transmit Configuration */
  __IOM uint32_t LNK_LFPS_RX_POLLING_BURST;     /*!< 0x0000008C LFPS Polling Detect Configuration */
  __IOM uint32_t LNK_LFPS_RX_POLLING_REPEAT;    /*!< 0x00000090 LFPS Polling Detect Configuration */
  __IOM uint32_t LNK_LFPS_RX_PING;              /*!< 0x00000094 LFPS Ping Detect Configuration */
  __IOM uint32_t LNK_LFPS_RX_RESET;             /*!< 0x00000098 LFPS Reset Detect Configuration */
  __IOM uint32_t LNK_LFPS_RX_U1_EXIT;           /*!< 0x0000009C LFPS U1 Exit Detect Configuration */
  __IOM uint32_t LNK_LFPS_RX_U2_EXIT;           /*!< 0x000000A0 LFPS U2 Exit Detect Configuration */
  __IOM uint32_t LNK_LFPS_RX_U3_EXIT;           /*!< 0x000000A4 LFPS U3 Exit Detect Configuration */
  __IOM uint32_t LNK_LFPS_RX_U1_HANDSHAKE;      /*!< 0x000000A8 LFPS U1 Exit Handshake Configuration */
  __IOM uint32_t LNK_LFPS_RX_U2_HANDSHAKE;      /*!< 0x000000AC LFPS U2 Exit Handshake Configuration */
  __IOM uint32_t LNK_LFPS_RX_U3_HANDSHAKE;      /*!< 0x000000B0 LFPS U3 Exit Handshake Configuration */
  __IOM uint32_t LNK_LFPS_RX_LOOPBACK_EXIT;     /*!< 0x000000B4 LFPS Loopback Exit Detect Configuration */
  __IOM uint32_t LNK_LFPS_RX_LOOPBACK_HANDSHAKE; /*!< 0x000000B8 LFPS Loopback Exit Handshake Configuration */
   __IM uint32_t LNK_LFPS_RX_IDLE;              /*!< 0x000000BC LFPS Idle Time */
   __IM uint32_t LNK_LFPS_RX_BURST;             /*!< 0x000000C0 LFPS Burst Length */
   __IM uint32_t LNK_LFPS_RX_TIME;              /*!< 0x000000C4 LFPS Idle Counter */
   __IM uint32_t LNK_PENDING_HP_TIMER;          /*!< 0x000000C8 Header Packet LGOOD/LBAD Timer */
  __IOM uint32_t LNK_PENDING_HP_TIMEOUT;        /*!< 0x000000CC Header Packet LGOOD/LBAD Timeout */
   __IM uint32_t LNK_CREDIT_HP_TIMER;           /*!< 0x000000D0 Header Packet LCRDx Timer */
  __IOM uint32_t LNK_CREDIT_HP_TIMEOUT;         /*!< 0x000000D4 Header Packet LCRDx Timeout */
   __IM uint32_t LNK_PM_TIMER;                  /*!< 0x000000D8 Power Mode Timer */
  __IOM uint32_t LNK_PM_LC_TIMEOUT;             /*!< 0x000000DC Power Mode PM_LC_TIMER Timeout */
  __IOM uint32_t LNK_PM_ENTRY_TIMEOUT;          /*!< 0x000000E0 Power Mode PM_ENTRY_TIMER Timeout */
  __IOM uint32_t LNK_PM_UX_EXIT_TIMEOUT;        /*!< 0x000000E4 Power Mode Ux_EXIT_TIMER Timeout */
   __IM uint32_t LNK_LTSSM_TIMER;               /*!< 0x000000E8 LTSSM Timer Register */
  __IOM uint32_t LNK_LTSSM_TIMEOUT;             /*!< 0x000000EC LTSSM Timeout Observability Register */
   __IM uint32_t RESERVED1[2];
  __IOM uint32_t LNK_LTSSM_RX_DETECT_PERIOD;    /*!< 0x000000F8 LTSSM RxDetect Period */
  __IOM uint32_t LNK_LTSSM_LUP_PERIOD;          /*!< 0x000000FC LTSSM LUP Period */
  __IOM uint32_t LNK_LTSSM_SS_INACTIVE_PERIOD;  /*!< 0x00000100 LTSSM SS.Inactive Timeout */
  __IOM uint32_t LNK_LTSSM_POLLING_LFPS_TIMEOUT; /*!< 0x00000104 LTSSM Polling LFPS Timeout */
  __IOM uint32_t LNK_LTSSM_POLLING_ACTIVE_TIMEOUT; /*!< 0x00000108 LTSSM Polling Active Timeout */
  __IOM uint32_t LNK_LTSSM_POLLING_CONFIG_TIMEOUT; /*!< 0x0000010C LTSSM Polling Configuration Timeout */
  __IOM uint32_t LNK_LTSSM_POLLING_IDLE_TIMEOUT; /*!< 0x00000110 LTSSM Polling Idle Timeout */
  __IOM uint32_t LNK_LTSSM_U1_EXIT_TIMEOUT;     /*!< 0x00000114 LTSSM U1 Exit Timeout */
  __IOM uint32_t LNK_LTSSM_U2_EXIT_TIMEOUT;     /*!< 0x00000118 LTSSM U2 Exit Timeout */
  __IOM uint32_t LNK_LTSSM_U3_EXIT_TIMEOUT;     /*!< 0x0000011C LTSSM U3 Exit Timeout */
  __IOM uint32_t LNK_LTSSM_HOT_RESET_ACTIVE_TIMEOUT; /*!< 0x00000120 LTSSM Hot Reset Active Timeout */
  __IOM uint32_t LNK_LTSSM_HOT_RESET_EXIT_TIMEOUT; /*!< 0x00000124 LTSSM Hot Reset Exit Timeout */
  __IOM uint32_t LNK_LTSSM_LOOPBACK_EXIT_TIMEOUT; /*!< 0x00000128 LTSSM Loopback Exit Timeout */
  __IOM uint32_t LNK_LTSSM_RECOVERY_IDLE_TIMEOUT; /*!< 0x0000012C LTSSM Recovery Idle Timeout */
  __IOM uint32_t LNK_LTSSM_RECOVERY_ACTIVE_TIMEOUT; /*!< 0x00000130 LTSSM Recovery Active Timeout */
  __IOM uint32_t LNK_LTSSM_RECOVERY_CONFIG_TIMEOUT; /*!< 0x00000134 LTSSM Recovery.Configuration Timeout */
  __IOM uint32_t LNK_LTSSM_LDN_TIMEOUT;         /*!< 0x00000138 LTSSM LDN Received Timeout */
   __IM uint32_t LNK_LTSSM_LDN_TIMER;           /*!< 0x0000013C LTSSM LDN Received Timer */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_0;      /*!< 0x00000140 Compliance Pattern CP0 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_1;      /*!< 0x00000144 Compliance Pattern CP1 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_2;      /*!< 0x00000148 Compliance Pattern CP2 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_3;      /*!< 0x0000014C Compliance Pattern CP3 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_4;      /*!< 0x00000150 Compliance Pattern CP4 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_5;      /*!< 0x00000154 Compliance Pattern CP5 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_6;      /*!< 0x00000158 Compliance Pattern CP6 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_7;      /*!< 0x0000015C Compliance Pattern CP7 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_8;      /*!< 0x00000160 Compliance Pattern CP8 */
  __IOM uint32_t LNK_DEBUG_BUFFER_CTRL;         /*!< 0x00000164 Buffer direct access control */
   __IM uint32_t LNK_DATARATE_CHG_OBSERVE;      /*!< 0x00000168 Dtat Rate Observability */
  __IOM uint32_t LNK_LFPS_TX_POLLING_BURST_GEN2; /*!< 0x0000016C LFPS Polling Transmit Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_POLLING_REPEAT_GEN2; /*!< 0x00000170 LFPS Polling Transmit Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_PING_BURST_GEN2;   /*!< 0x00000174 LFPS Ping Transmit Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_PING_REPEAT_GEN2;  /*!< 0x00000178 LFPS Ping Transmit Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_U1_EXIT_GEN2;      /*!< 0x0000017C LFPS U1_EXIT Transmit Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_U2_EXIT_GEN2;      /*!< 0x00000180 LFPS U2_EXIT Transmit Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_U3_EXIT_GEN2;      /*!< 0x00000184 LFPS U3 Exit Transmit Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_POLLING_BURST_GEN2; /*!< 0x00000188 LFPS Polling Detect Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_POLLING_REPEAT_GEN2; /*!< 0x0000018C LFPS Polling Detect Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_PING_GEN2;         /*!< 0x00000190 LFPS Ping Detect Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_RESET_GEN2;        /*!< 0x00000194 LFPS Reset Detect Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_U1_EXIT_GEN2;      /*!< 0x00000198 LFPS U1 Exit Detect Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_U2_EXIT_GEN2;      /*!< 0x0000019C LFPS U2 Exit Detect Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_U1_HANDSHAKE_GEN2; /*!< 0x000001A0 LFPS U1 Exit Handshake Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_U2_HANDSHAKE_GEN2; /*!< 0x000001A4 LFPS U2 Exit Handshake Gen 2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_U3_HANDSHAKE_GEN2; /*!< 0x000001A8 LFPS U3 Exit Handshake Gen 2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_LOOPBACK_EXIT_GEN2; /*!< 0x000001AC LFPS Loopback Exit Detect Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_LOOPBACK_HANDSHAKE_GEN2; /*!< 0x000001B0 LFPS Loopback Exit Handshake Gen2 Configuration */
  __IOM uint32_t LNK_PENDING_HP_TIMEOUT_GEN2;   /*!< 0x000001B4 Header Packet LGOOD/LBAD Gen2 Timeout */
   __IM uint32_t RESERVED2[3];
  __IOM uint32_t LNK_CREDIT_HP_TIMEOUT_GEN2;    /*!< 0x000001C4 Header Packet LCRD_x Gen2 Timeout */
  __IOM uint32_t LNK_PM_LC_X2_TIMEOUT_GEN1;     /*!< 0x000001C8 Power Mode PM_LC_X2_TIMER Gen1 Timeout */
  __IOM uint32_t LNK_PM_LC_X1_TIMEOUT_GEN2;     /*!< 0x000001CC Power Mode PM_LC_X1_TIMER Gen2 Timeout */
  __IOM uint32_t LNK_PM_LC_X2_TIMEOUT_GEN2;     /*!< 0x000001D0 Power Mode PM_LC_X2_TIMER Gen2 Timeout */
  __IOM uint32_t LNK_PM_ENTRY_X2_TIMEOUT_GEN1;  /*!< 0x000001D4 Power Mode PM_ENTRY_X2_TIMER Gen1 Timeout */
  __IOM uint32_t LNK_PM_ENTRY_X1_TIMEOUT_GEN2;  /*!< 0x000001D8 Power Mode PM_ENTRY_X1_TIMER Gen2 Timeout */
  __IOM uint32_t LNK_PM_ENTRY_X2_TIMEOUT_GEN2;  /*!< 0x000001DC Power Mode PM_ENTRY_X2_TIMER Gen2 Timeout */
  __IOM uint32_t LNK_PM_UX_EXIT_TIMEOUT_GEN2;   /*!< 0x000001E0 Power Mode Ux_EXIT_TIMER Gen2 Timeout */
  __IOM uint32_t LNK_U1_MIN_RESIDENCY_TIMEOUT_GEN1; /*!< 0x000001E4 Power Mode U1_MIN_RESIDENCY_TIMER Gen1 Timeout */
  __IOM uint32_t LNK_U1_MIN_RESIDENCY_TIMEOUT_GEN2; /*!< 0x000001E8 Power Mode U1_MIN_RESIDENCY_TIMER Gen2 Timeout */
  __IOM uint32_t LNK_LFPS_TX_SCD_LOGIC0_REPEAT_GEN1; /*!< 0x000001EC LFPS SCD Transmit Logic 0 Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_TX_SCD_LOGIC1_REPEAT_GEN1; /*!< 0x000001F0 LFPS SCD Transmit Logic 1 Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_TX_SCD_END_REPEAT_GEN1; /*!< 0x000001F4 LFPS SCD Transmit End Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN1; /*!< 0x000001F8 LFPS SCD Receive Logic 0 Gen1 Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN1; /*!< 0x000001FC LFPS SCD Receive Logic 1 Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_RX_SCD_END_REPEAT_GEN1; /*!< 0x00000200 LFPS SCD Receive End Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_TX_SCD_LOGIC0_REPEAT_GEN2; /*!< 0x00000204 LFPS SCD Transmit Logic 0 Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_SCD_LOGIC1_REPEAT_GEN2; /*!< 0x00000208 LFPS SCD Transmit Logic 1 Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_SCD_END_REPEAT_GEN2; /*!< 0x0000020C LFPS SCD Transmit End Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN2; /*!< 0x00000210 LFPS SCD Receive Logic 0 Gen2 Configuration */
   __IM uint32_t RESERVED3[3];
  __IOM uint32_t LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN2; /*!< 0x00000220 LFPS SCD Receive Logic 1 Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_SCD_END_REPEAT_GEN2; /*!< 0x00000224 LFPS SCD Receive End Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_LBPS_TPWM_GEN1;    /*!< 0x00000228 LFPS LBPS Transmit tPWM Gen1 Configuration */
   __IM uint32_t RESERVED4[3];
  __IOM uint32_t LNK_LFPS_TX_LBPS_TLFPS0_GEN1;  /*!< 0x00000238 LFPS LBPS Transmit tLFPS-0 Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_TX_LBPS_TLFPS1_GEN1;  /*!< 0x0000023C LFPS LBPS Transmit tLFPS-1 Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_RX_LBPS_TPWM_GEN1;    /*!< 0x00000240 LFPS LBPS Receive tPWM Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_RX_LBPS_TLFPS0_GEN1;  /*!< 0x00000244 LFPS LBPS Receive tLFPS-0 Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_RX_LBPS_TLFPS1_GEN1;  /*!< 0x00000248 LFPS LBPS Receive tLFPS-1 Gen1 Configuration */
  __IOM uint32_t LNK_LFPS_TX_LBPS_TPWM_GEN2;    /*!< 0x0000024C LFPS LBPS Transmit tPWM Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_LBPS_TLFPS0_GEN2;  /*!< 0x00000250 LFPS LBPS Transmit tLFPS-0 Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_TX_LBPS_TLFPS1_GEN2;  /*!< 0x00000254 LFPS LBPS Transmit tLFPS-1 Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_LBPS_TPWM_GEN2;    /*!< 0x00000258 LFPS LBPS Receive tPWM Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_LBPS_TLFPS0_GEN2;  /*!< 0x0000025C LFPS LBPS Receive tLFPS-0 Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_RX_LBPS_TLFPS1_GEN2;  /*!< 0x00000260 LFPS LBPS Receive tLFPS-1 Gen2 Configuration */
  __IOM uint32_t LNK_LFPS_SCD_PATTERN;          /*!< 0x00000264 LFPS SCD Pattern Configuration */
  __IOM uint32_t LNK_TSEQ_COUNT_GEN1;           /*!< 0x00000268 TSEQ Count Gen1 Configuration */
  __IOM uint32_t LNK_TSEQ_COUNT_GEN2;           /*!< 0x0000026C TSEQ Count Gen2 Configuration */
  __IOM uint32_t LNK_SCD1_GEN2_HSK;             /*!< 0x00000270 SCD1 Handshake Gen2 Configuration */
  __IOM uint32_t LNK_SCD1_GEN2_TO_GEN1_HSK;     /*!< 0x00000274 SCD1 Handshake Gen2_to_Gen1 Configuration */
  __IOM uint32_t LNK_SCD1_OBSERVE;              /*!< 0x00000278 Polling.LFPS SCD1 Observability */
  __IOM uint32_t LNK_SCD2_GEN2_HSK;             /*!< 0x0000027C SCD2 Handshake Gen2 Configuration */
  __IOM uint32_t LNK_SCD2_GEN2_TO_GEN1_HSK;     /*!< 0x00000280 SCD2 Handshake Gen2_to_Gen1 Configuration */
  __IOM uint32_t LNK_SCD2_OBSERVE;              /*!< 0x00000284 Polling.LFPSPlus SCD2 Observability */
  __IOM uint32_t LNK_CAP_LBPM_HSK;              /*!< 0x00000288 Polling.PortMatch LBPM Handshake Configuration */
  __IOM uint32_t LNK_CAP_LBPM_OBSERVE;          /*!< 0x0000028C Polling.PortMatch LBPM Observability */
  __IOM uint32_t LNK_READY_LBPM_HSK;            /*!< 0x00000290 Polling.PortConfig LBPM Handshake Configuration */
  __IOM uint32_t LNK_READY_LBPM_OBSERVE;        /*!< 0x00000294 Polling.PortConfig LBPM Observability */
   __IM uint32_t LNK_RCVD_LBPM_OBSERVE;         /*!< 0x00000298 Received LBPM Observability */
  __IOM uint32_t LNK_LTSSM_SCD_LFPS_TIMEOUT;    /*!< 0x0000029C LTSSM SCD LFPS Timeout (SuperSpeedPlus Only) */
  __IOM uint32_t LNK_LTSSM_LBPM_LFPS_TIMEOUT;   /*!< 0x000002A0 LTSSM LBPM LFPS Timeout (SuperSpeedPlus Only) */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_9_TO_12; /*!< 0x000002A4 Compliance Pattern CP9 to CP12 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_13;     /*!< 0x000002A8 Compliance Pattern CP13 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_14;     /*!< 0x000002AC Compliance Pattern CP14 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_15;     /*!< 0x000002B0 Compliance Pattern CP15 */
  __IOM uint32_t LNK_COMPLIANCE_PATTERN_16;     /*!< 0x000002B4 Compliance Pattern CP16 */
   __IM uint32_t LNK_COMPLIANCE_PATTERN_OBSERVE; /*!< 0x000002B8 Compliance Pattern Observability */
  __IOM uint32_t LNK_SOFT_ERR_CNT_CONF;         /*!< 0x000002BC Soft Error Counter Configuration */
   __IM uint32_t LNK_SOFT_ERR_CNT_OBSERVE;      /*!< 0x000002C0 Soft Error Counter Observability */
  __IOM uint32_t LNK_LTSSM_STATE_CHG_INTR_CONF; /*!< 0x000002C4 LTSSM State Change Interrupt Configuration */
  __IOM uint32_t LNK_DEBUG_RSVD;                /*!< 0x000002C8 Debugging and Reserved (Internal Use Only) */
  __IOM uint32_t LNK_TX_TS1_HOLDOFF_TIMEOUT;    /*!< 0x000002CC Transmitting TS1 Holdoff */
  __IOM uint32_t LNK_MISC_CONF;                 /*!< 0x000002D0 Miscellaneous Configuration */
   __IM uint32_t LNK_MISC_OBSERVE;              /*!< 0x000002D4 Miscellaneous Observability */
   __IM uint32_t LNK_LTSSM_SUBSTATE_OBSERVE;    /*!< 0x000002D8 LTSSM Substate Observability */
   __IM uint32_t RESERVED5[9];
   __IM uint32_t LNK_RX_TYPE1_HEADER_BUFFER[21]; /*!< 0x00000300 Receive Type1 Packet Header Buffer */
   __IM uint32_t RESERVED6[11];
   __IM uint32_t LNK_RX_TYPE1_HEADER_BUFFER_STATE_0; /*!< 0x00000380 Receive Type1 Packet Header Buffer Status 0 */
   __IM uint32_t LNK_RX_TYPE1_HEADER_BUFFER_STATE_1; /*!< 0x00000384 Receive Type1 Packet Header Buffer Status 1 */
   __IM uint32_t RESERVED7[30];
   __IM uint32_t LNK_RX_TYPE2_HEADER_BUFFER[21]; /*!< 0x00000400 Receive Type2 Packet Header Buffer */
   __IM uint32_t RESERVED8[11];
   __IM uint32_t LNK_RX_TYPE2_HEADER_BUFFER_STATE_0; /*!< 0x00000480 Receive Type2 Packet Header Buffer Status 0 */
   __IM uint32_t LNK_RX_TYPE2_HEADER_BUFFER_STATE_1; /*!< 0x00000484 Receive Type2 Packet Header Buffer Status 1 */
   __IM uint32_t RESERVED9[30];
   __IM uint32_t LNK_TX_TYPE1_HEADER_BUFFER[21]; /*!< 0x00000500 Transmit Type1 Packet Header Buffer */
   __IM uint32_t RESERVED10[11];
   __IM uint32_t LNK_TX_TYPE1_HEADER_BUFFER_STATE_0; /*!< 0x00000580 Transmit Type1 Packet Header Buffer Status 0 */
   __IM uint32_t LNK_TX_TYPE1_HEADER_BUFFER_STATE_1; /*!< 0x00000584 Transmit Type1 Packet Header Buffer Status 1 */
   __IM uint32_t RESERVED11[30];
   __IM uint32_t LNK_TX_TYPE2_HEADER_BUFFER[21]; /*!< 0x00000600 Transmit Type2 Packet Header Buffer */
   __IM uint32_t RESERVED12[11];
   __IM uint32_t LNK_TX_TYPE2_HEADER_BUFFER_STATE_0; /*!< 0x00000680 Transmit Type2 Packet Header Buffer Status 0 */
   __IM uint32_t LNK_TX_TYPE2_HEADER_BUFFER_STATE_1; /*!< 0x00000684 Transmit Type2 Packet Header Buffer Status 1 */
   __IM uint32_t RESERVED13[606];
} USB32DEV_LNK_V1_Type;       /*!< Size = 4096 (0x1000) */

