RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
/**
  * \brief USB32 SuperSpeedPlus Device Controller Protocol Layer Registers (USB32DEV_PROT)
  */
typedef struct {
  __IOM uint32_t PROT_CS;                       /*!< 0x00000000 Protocol Control and Status */
  __IOM uint32_t PROT_INTR;                     /*!< 0x00000004 Protocol Interrupts */
  __IOM uint32_t PROT_INTR_SET;                 /*!< 0x00000008 Protocol Interrupts Set */
  __IOM uint32_t PROT_INTR_MASK;                /*!< 0x0000000C Protocol Interrupts Mask */
   __IM uint32_t PROT_INTR_MASKED;              /*!< 0x00000010 Protocol Interrupts Masked */
   __IM uint32_t PROT_EP_INTR;                  /*!< 0x00000014 Endpoint Interrupts */
  __IOM uint32_t PROT_EP_INTR_SET;              /*!< 0x00000018 Endpoint Interrupts set */
  __IOM uint32_t PROT_EP_INTR_MASK;             /*!< 0x0000001C Endpoint Interrupts Mask */
   __IM uint32_t PROT_EP_INTR_MASKED;           /*!< 0x00000020 Endpoint Interrupts Masked */
  __IOM uint32_t PROT_DEVICE_NOTIF_FUNC_WAKE;   /*!< 0x00000024 Device Notification Remote Wake up TP */
  __IOM uint32_t PROT_DEVICE_NOTIF_LTM;         /*!< 0x00000028 Device Notification Latency Tolerance Message TP */
  __IOM uint32_t PROT_DEVICE_NOTIF_BIAM;        /*!< 0x0000002C Device Notification Bus Interval Adjustment TP */
  __IOM uint32_t PROT_LMP_PORT_CAPABILITY_TIMER; /*!< 0x00000030 Port Capabilites LMP Timeout Configuration */
  __IOM uint32_t PROT_LMP_PORT_CONFIGURATION_TIMER; /*!< 0x00000034 Port Configuration LMP Timeout Configuration */
  __IOM uint32_t PROT_PING_TIMEOUT;             /*!< 0x00000038 Ping Timeout Configuration */
   __IM uint32_t RESERVED[2];
   __IM uint32_t PROT_FRAMECNT;                 /*!< 0x00000044 Frame Counter Register */
   __IM uint32_t PROT_ITP_CORRECTION;           /*!< 0x00000048 Correction field of ITP. */
   __IM uint32_t RESERVED1[2];
   __IM uint32_t PROT_SETUPDAT0;                /*!< 0x00000054 Received SETUP Packet Data */
   __IM uint32_t PROT_SETUPDAT1;                /*!< 0x00000058 Received SETUP Packet Data */
  __IOM uint32_t PROT_SEQ_NUM;                  /*!< 0x0000005C Sequence Number */
   __IM uint32_t RESERVED2[8];
   __IM uint32_t PROT_LMP_RECEIVED;             /*!< 0x00000080 Link Management Packet Received Value */
  __IOM uint32_t PROT_LMP_OVERRIDE;             /*!< 0x00000084 Link Management Packet Override Values */
   __IM uint32_t PROT_LMP_PORT_CAPABILITIES_RX; /*!< 0x00000088 Port Capabilities LMP Received */
  __IOM uint32_t PROT_LMP_PORT_CAPABILITIES_TX; /*!< 0x0000008C Port Capabilities LMP Transmitted */
   __IM uint32_t PROT_LMP_PORT_CONFIGURATION_RX; /*!< 0x00000090 Port Configuration LMP Received */
  __IOM uint32_t PROT_LMP_PORT_CONFIGURATION_TX; /*!< 0x00000094 Port Configuration Response LMP */
  __IOM uint32_t PROT_STREAM_ERROR_DISABLE;     /*!< 0x00000098 Streams Error Disable Type Registers */
  __IOM uint32_t PROT_STREAM_ERROR_STATUS;      /*!< 0x0000009C Streams Error STATUS Registers */
   __IM uint32_t RESERVED3[24];
   __IM uint32_t PROT_LMP_PACKET_RX[3];         /*!< 0x00000100 Link Management Packet Received */
   __IM uint32_t RESERVED4;
  __IOM uint32_t PROT_LMP_PACKET_TX[3];         /*!< 0x00000110 Link Management Packet to be sent */
   __IM uint32_t RESERVED5[9];
  __IOM uint32_t PROT_EPI_INTR[16];             /*!< 0x00000140 Per IN-Endpoint Interrupt */
  __IOM uint32_t PROT_EPI_INTR_SET[16];         /*!< 0x00000180 Per IN-Endpoint Interrupt set */
  __IOM uint32_t PROT_EPI_INTR_MASK[16];        /*!< 0x000001C0 Per IN-Endpoint Interrupt Mask */
   __IM uint32_t PROT_EPI_INTR_MASKED[16];      /*!< 0x00000200 Per IN-Endpoint Interrupt Masked */
  __IOM uint32_t PROT_EPI_CS1[16];              /*!< 0x00000240 SuperSpeed IN Endpoint Control and Status */
  __IOM uint32_t PROT_EPI_CS2[16];              /*!< 0x00000280 SuperSpeed IN Endpoint Control and Status */
  __IOM uint32_t PROT_EPI_UNMAPPED_STREAM[16];  /*!< 0x000002C0 Unmapped Stream Request */
  __IOM uint32_t PROT_EPI_MAPPED_STREAM[16];    /*!< 0x00000300 Mapped Streams Registers */
  __IOM uint32_t PROT_EPO_INTR[16];             /*!< 0x00000340 Per OUT-Endpoint Interrupt */
  __IOM uint32_t PROT_EPO_INTR_SET[16];         /*!< 0x00000380 Per OUT-Endpoint Interrupt set */
  __IOM uint32_t PROT_EPO_INTR_MASK[16];        /*!< 0x000003C0 Per OUT-Endpoint Interrupt Mask */
   __IM uint32_t PROT_EPO_INTR_MASKED[16];      /*!< 0x00000400 Per OUT-Endpoint Interrupt Masked */
  __IOM uint32_t PROT_EPO_CS1[16];              /*!< 0x00000440 SuperSpeed OUT Endpoint Control and Status */
  __IOM uint32_t PROT_EPO_CS2[16];              /*!< 0x00000480 SuperSpeed IN Endpoint Control and Status */
  __IOM uint32_t PROT_EPO_UNMAPPED_STREAM[16];  /*!< 0x000004C0 Unmapped Stream Request */
  __IOM uint32_t PROT_EPO_MAPPED_STREAM[16];    /*!< 0x00000500 Mapped Streams Registers */
   __IM uint32_t RESERVED6[16];
  __IOM uint32_t PROT_SUBLINK_DEV_NNOTIFICATION; /*!< 0x00000580 Sublink Speed Device Notification Settings */
  __IOM uint32_t PROT_SUBLINK_LSM;              /*!< 0x00000584 Sublink Speed Device Notification Lane Speed Mantissa */
  __IOM uint32_t PROT_PTM_CONFIG;               /*!< 0x00000588 PTM configuration register */
  __IOM uint32_t PROT_FW_PTM_COUNTER;           /*!< 0x0000058C FW Load PTM counter register */
  __IOM uint32_t PROT_HW_PTM_COUNTER;           /*!< 0x00000590 HW Internal PTM counter */
   __IM uint32_t PROT_PTM_STATUS;               /*!< 0x00000594 PTM status register */
   __IM uint32_t PROT_PTM_T1;                   /*!< 0x00000598 PTM T1 value */
   __IM uint32_t PROT_PTM_T4;                   /*!< 0x0000059C PTM T4 value */
   __IM uint32_t PROT_LMP_LDM_RESPONSE;         /*!< 0x000005A0 Protocol LMP LDM received */
   __IM uint32_t RESERVED7[311];
  __IOM uint32_t PROT_EPI_ENHANCE[16];          /*!< 0x00000A80 Enhancements for IN-Endpoint transactions */
  __IOM uint32_t PROT_ENHANCE;                  /*!< 0x00000AC0 Protocol Enhancements Configuration register */
   __IM uint32_t RESERVED8[335];
} USB32DEV_PROT_V1_Type;      /*!< Size = 4096 (0x1000) */

/**
  * \brief PHY TOP, PCS, Tx registers (USB32DEV_PHYSS_USB40PHY_TOP)
  */
typedef struct {
   __IM uint32_t RESERVED;
  __IOM uint32_t TOP_CTRL_0;                    /*!< 0x00000004 TOP control register */
   __IM uint32_t RESERVED1[2];
  __IOM uint32_t PCS_CTRL_0;                    /*!< 0x00000010 PCS control register */
   __IM uint32_t RESERVED2;
   __IM uint32_t PCS_STATUS;                    /*!< 0x00000018 PCS status register */
  __IOM uint32_t PCS_SPARE;                     /*!< 0x0000001C PCS spare */
   __IM uint32_t ERR_STATUS;                    /*!< 0x00000020 Error status register */
   __IM uint32_t RESERVED3[3];
  __IOM uint32_t PIPE_OVERRIDE_0;               /*!< 0x00000030 PIPE interface control signals override register #0 */
   __IM uint32_t RESERVED4;
   __IM uint32_t PIPE_STATUS;                   /*!< 0x00000038 PIPE interface status read register */
   __IM uint32_t RESERVED5;
  __IOM uint32_t INTR0;                         /*!< 0x00000040 INTR0 Cause. These are the wakeup interrupts get reflected on
                                                                interrupt_wakeup pin. */
  __IOM uint32_t INTR0_SET;                     /*!< 0x00000044 INTR0 Set */
  __IOM uint32_t INTR0_MASK;                    /*!< 0x00000048 INTR0 Mask */
   __IM uint32_t INTR0_MASKED;                  /*!< 0x0000004C INTR0 Masked */
  __IOM uint32_t INTR1;                         /*!< 0x00000050 INTR1 Cause. These are the wakeup interrupts get reflected on
                                                                interrupt_wakeup pin. */
  __IOM uint32_t INTR1_SET;                     /*!< 0x00000054 INTR1 Set */
  __IOM uint32_t INTR1_MASK;                    /*!< 0x00000058 INTR1 Mask */
   __IM uint32_t INTR1_MASKED;                  /*!< 0x0000005C INTR1 Masked */
  __IOM uint32_t TX_AFE_CTRL_0;                 /*!< 0x00000060 Tx AFE control register #0 */
  __IOM uint32_t TX_AFE_CTRL_1;                 /*!< 0x00000064 Tx AFE control register #1 */
   __IM uint32_t RESERVED6;
  __IOM uint32_t TX_AFE_RXDETECT_CNT;           /*!< 0x0000006C Tx AFE TxDetectRx wait counter */
  __IOM uint32_t TX_AFE_OVERRIDE_0;             /*!< 0x00000070 Tx AFE override 0 register */
   __IM uint32_t RESERVED7;
   __IM uint32_t TX_AFE_DEBUG;                  /*!< 0x00000078 Tx AFE debug register */
   __IM uint32_t TX_AFE_STATUS;                 /*!< 0x0000007C Tx AFE status register */
   __IM uint32_t RESERVED8;
  __IOM uint32_t TX_AFE_ZTRIM;                  /*!< 0x00000084 Tx AFE impedance calibration register */
   __IM uint32_t RESERVED9[2];
  __IOM uint32_t TX_AFE_CFG;                    /*!< 0x00000090 Tx AFE configuration control register */
  __IOM uint32_t TX_AFE_CFG_SFT_W_0;            /*!< 0x00000094 Tx AFE configuration control shift write register #0 */
  __IOM uint32_t TX_AFE_CFG_SFT_W_1;            /*!< 0x00000098 Tx AFE configuration control shift write register #1 */
  __IOM uint32_t TX_AFE_CFG_SFT_W_2;            /*!< 0x0000009C Tx AFE configuration control shift write register #2 */
  __IOM uint32_t TX_AFE_CFG_SFT_W_3;            /*!< 0x000000A0 Tx AFE configuration control shift write register #3 */
  __IOM uint32_t TX_AFE_CFG_SFT_W_4;            /*!< 0x000000A4 Tx AFE configuration control shift write register #4 */
  __IOM uint32_t TX_AFE_CFG_SFT_W_5;            /*!< 0x000000A8 Tx AFE configuration control shift write register #5 */
  __IOM uint32_t TX_AFE_CFG_SFT_W_6;            /*!< 0x000000AC Tx AFE configuration control shift write register #6 */
  __IOM uint32_t TX_AFE_CFG_SFT_W_7;            /*!< 0x000000B0 Tx AFE configuration control shift write register #7 */
   __IM uint32_t TX_AFE_CFG_SFT_R;              /*!< 0x000000B4 Tx AFE configuration control shift read register for debug */
   __IM uint32_t RESERVED10[2];
  __IOM uint32_t ADC;                           /*!< 0x000000C0 Analog to Digital Converter register #0 */
   __IM uint32_t ADC_STATUS;                    /*!< 0x000000C4 Analog to Digital Converter status register */
   __IM uint32_t RESERVED11[3];
  __IOM uint32_t PHYSS_LOOPBACK_CTRL_0;         /*!< 0x000000D4 PHY Loopback control register #0 */
   __IM uint32_t PHYSS_LOOPBACK_DEBUG_0;        /*!< 0x000000D8 PHY Loopback debug register #0 */
   __IM uint32_t PHYSS_LOOPBACK_DEBUG_1;        /*!< 0x000000DC PHY Loopback debug register #1 */
   __IM uint32_t PHYSS_LOOPBACK_STATUS_1;       /*!< 0x000000E0 PHY Loopback status register #1 */
  __IOM uint32_t PHYSS_LOOPBACK_USER_0;         /*!< 0x000000E4 PHY Loopback user pattern register #0 */
  __IOM uint32_t PHYSS_LOOPBACK_USER_1;         /*!< 0x000000E8 PHY Loopback user pattern register #1 */
   __IM uint32_t RESERVED12;
  __IOM uint32_t PHYSS_DDFT_MUX_SEL;            /*!< 0x000000F0 PHY DDFT selection */
  __IOM uint32_t PIPE_RX_CTRL;                  /*!< 0x000000F4 Configuration for PIPE RX */
  __IOM uint32_t LOW_POWER_CTRL;                /*!< 0x000000F8 Low Power configuration */
  __IOM uint32_t CDR_SW_CTRL;                   /*!< 0x000000FC Configuration for CDR mode switching */
   __IM uint32_t RESERVED13[448];
} USB32DEV_PHYSS_USB40PHY_TOP_V1_Type; /*!< Size = 2048 (0x800) */

/**
  * \brief PHY Rx registers (USB32DEV_PHYSS_USB40PHY_RX)
  */
typedef struct {
  __IOM uint32_t RX_SDM_CFG0;                   /*!< 0x00000000 Sigma-Delta Modulator (SDM) Configuration */
  __IOM uint32_t RX_SDM_CFG1;                   /*!< 0x00000004 Sigma-Delta Modulator (SDM) Configuration */
  __IOM uint32_t RX_SDM_CFG2;                   /*!< 0x00000008 Sigma-Delta Modulator (SDM) Configuration */
  __IOM uint32_t RX_SDM_CFG3;                   /*!< 0x0000000C Sigma-Delta Modulator (SDM) Configuration */
  __IOM uint32_t RX_DFE_CFG0;                   /*!< 0x00000010 DFE FSM (DFE) Configuration */
  __IOM uint32_t RX_DFE_CFG1;                   /*!< 0x00000014 DFE FSM (DFE) Configuration */
  __IOM uint32_t RX_DFE_CFG2;                   /*!< 0x00000018 DFE FSM (DFE) Configuration */
  __IOM uint32_t RX_DFE_CFG3;                   /*!< 0x0000001C DFE FSM (DFE) Configuration */
   __IM uint32_t RX_DFE_STAT0;                  /*!< 0x00000020 DFE FSM (DFE) status */
   __IM uint32_t RX_DFE_STAT1;                  /*!< 0x00000024 DFE FSM (DFE) status */
   __IM uint32_t RX_DFE_STAT2;                  /*!< 0x00000028 DFE FSM (DFE) status */
  __IOM uint32_t RX_OSA_CFG0;                   /*!< 0x0000002C Offset Calibration FSM (OSA) Configuration */
  __IOM uint32_t RX_OSA_CFG1;                   /*!< 0x00000030 Offset Calibration FSM (OSA) Configuration */
  __IOM uint32_t RX_OSA_CFG2;                   /*!< 0x00000034 Offset Calibration FSM (OSA) Configuration */
  __IOM uint32_t RX_OSA_CFG3;                   /*!< 0x00000038 Offset Calibration FSM (OSA) Configuration */
  __IOM uint32_t RX_OSA_CFG4;                   /*!< 0x0000003C Offset Calibration FSM (OSA) Configuration */
  __IOM uint32_t RX_OSA_CFG5;                   /*!< 0x00000040 Offset Calibration FSM (OSA) Configuration */
   __IM uint32_t RX_OSA_STAT0;                  /*!< 0x00000044 Offset Calibration FSM (OSA) status */
   __IM uint32_t RX_OSA_STAT1;                  /*!< 0x00000048 Offset Calibration FSM (OSA) status */
   __IM uint32_t RX_OSA_STAT2;                  /*!< 0x0000004C Offset Calibration FSM (OSA) status */
   __IM uint32_t RX_OSA_STAT3;                  /*!< 0x00000050 Offset Calibration FSM (OSA) status */
   __IM uint32_t RX_OSA_STAT4;                  /*!< 0x00000054 Offset Calibration FSM (OSA) status */
   __IM uint32_t RX_OSA_STAT5;                  /*!< 0x00000058 Offset Calibration FSM (OSA) status */
   __IM uint32_t RX_OSA_STAT6;                  /*!< 0x0000005C Offset Calibration FSM (OSA) status */
   __IM uint32_t RX_OSA_STAT7;                  /*!< 0x00000060 Offset Calibration FSM (OSA) status */
   __IM uint32_t RX_OSA_STAT8;                  /*!< 0x00000064 Offset Calibration FSM (OSA) status */
  __IOM uint32_t RX_CTLE_CFG0;                  /*!< 0x00000068 CTLE controls Configuration */
  __IOM uint32_t RX_CTLE_CFG1;                  /*!< 0x0000006C CTLE controls Configuration */
   __IM uint32_t RX_CTLE_STAT0;                 /*!< 0x00000070 CTLE controls status */
   __IM uint32_t RX_CTLE_STAT1;                 /*!< 0x00000074 CTLE controls status */
  __IOM uint32_t RX_EM_CFG0;                    /*!< 0x00000078 Eye monitor FSM (EM) Configuration */
  __IOM uint32_t RX_EM_CFG1;                    /*!< 0x0000007C Eye monitor FSM (EM) Configuration */
   __IM uint32_t RX_EM_STAT0;                   /*!< 0x00000080 Eye monitor FSM (EM) status */
   __IM uint32_t RX_EM_STAT1;                   /*!< 0x00000084 Eye monitor FSM (EM) status */
  __IOM uint32_t RX_DFEA_CFG0;                  /*!< 0x00000088 DFE Analog Configuration */
  __IOM uint32_t RX_OSAA_CFG0;                  /*!< 0x0000008C Offset Calibration Analog Configuration */
  __IOM uint32_t RX_OSAA_CFG1;                  /*!< 0x00000090 Offset Calibration Analog Configuration */
  __IOM uint32_t RX_AFE_CFG;                    /*!< 0x00000094 Analog Front End (AFE) Configuration */
  __IOM uint32_t RX_EMA_CFG;                    /*!< 0x00000098 Eye Monitor Analog Configuration */
  __IOM uint32_t RX_REFCKSEL_CFG;               /*!< 0x0000009C Reference Clock Select (REFCLKSEL) Configuration */
  __IOM uint32_t RX_DIVH_CFG;                   /*!< 0x000000A0 HS Divider (DIVH) Configuration */
  __IOM uint32_t RX_PFD_CFG;                    /*!< 0x000000A4 Phase/Frequency Detector (PFD) Configuration */
  __IOM uint32_t RX_CP_CFG;                     /*!< 0x000000A8 Charge Pump (CP) Configuration */
  __IOM uint32_t RX_LF_CFG;                     /*!< 0x000000AC Loop Filter (LF) Configuration */
  __IOM uint32_t RX_BIASGEN_CFG0;               /*!< 0x000000B0 Bias Generator (BIASGEN) Configuration */
  __IOM uint32_t RX_BIASGEN_CFG1;               /*!< 0x000000B4 Bias Generator (BIASGEN) Configuration */
  __IOM uint32_t RX_GNRL_CFG;                   /*!< 0x000000B8 General Controls Configuration */
  __IOM uint32_t RX_VREG_CFG0;                  /*!< 0x000000BC Regulators Configuration */
  __IOM uint32_t RX_VREG_CFG1;                  /*!< 0x000000C0 Regulators Configuration */
   __IM uint32_t RX_VREG_STAT;                  /*!< 0x000000C4 Regulators Status */
  __IOM uint32_t RX_SD_CFG;                     /*!< 0x000000C8 Signal detect/LFPS Configuration */
   __IM uint32_t RX_SD_STAT;                    /*!< 0x000000CC Signal detect/LFPS Status */
  __IOM uint32_t RX_LD_CFG;                     /*!< 0x000000D0 Lock Detect Configuration */
   __IM uint32_t RX_LD_STAT;                    /*!< 0x000000D4 Lock Detect Status */
  __IOM uint32_t RX_DFE_CFG4;                   /*!< 0x000000D8 DFE FSM (DFE) Configuration */
  __IOM uint32_t RX_HDWR_ENABLE;                /*!< 0x000000DC Configuration for hardware enable */
  __IOM uint32_t RX_ATEST_CFG;                  /*!< 0x000000E0 Analog Test Mux (ATEST) Configuration */
  __IOM uint32_t RX_DTEST_CFG;                  /*!< 0x000000E4 Digital Test Mux (DTEST) Configuration */
  __IOM uint32_t SPARE_CFG;                     /*!< 0x000000E8 Spare Configuration */
   __IM uint32_t SPARE_STAT;                    /*!< 0x000000EC Spare Status */
  __IOM uint32_t SPARE_HV_CFG;                  /*!< 0x000000F0 Spare Configuration for HV signlas */
   __IM uint32_t RESERVED[3];
} USB32DEV_PHYSS_USB40PHY_RX_V1_Type; /*!< Size = 256 (0x100) */

/**
  * \brief PHY PLL SYS registers (USB32DEV_PHYSS_USB40PHY_PLL_SYS)
  */
typedef struct {
  __IOM uint32_t PLL_SDM_CFG;                   /*!< 0x00000000 Sigma-Delta Modulator (SDM) Configuration */
  __IOM uint32_t PLL_SSM_CFG0;                  /*!< 0x00000004 Spread Spectrun Modulator (SSM) Configuration */
  __IOM uint32_t PLL_SSM_CFG1;                  /*!< 0x00000008 Spread Spectrun Modulator (SSM) Configuration */
  __IOM uint32_t PLL_SSM_CFG2;                  /*!< 0x0000000C Spread Spectrun Modulator (SSM) Configuration */
  __IOM uint32_t PLL_AFC_CFG0;                  /*!< 0x00000010 Automatic Frequency Control (AFC) Configuration */
  __IOM uint32_t PLL_AFC_CFG1;                  /*!< 0x00000014 Automatic Frequency Control (AFC) Configuration */
  __IOM uint32_t PLL_AFC_CFG2;                  /*!< 0x00000018 Automatic Frequency Control (AFC) Configuration */
   __IM uint32_t PLL_AFC_STAT;                  /*!< 0x0000001C Automatic Frequency Control (AFC) Status */
  __IOM uint32_t PLL_AAC_CFG0;                  /*!< 0x00000020 Automatic Amplitude Control (AAC) Configuration */
  __IOM uint32_t PLL_AAC_CFG1;                  /*!< 0x00000024 Automatic Amplitude Control (AAC) Configuration */
   __IM uint32_t PLL_AAC_STAT;                  /*!< 0x00000028 Automatic Amplitude Control (AAC) Status */
  __IOM uint32_t PLL_REFCKSEL_CFG;              /*!< 0x0000002C Reference Clock Select (REFCLKSEL) Configuration */
  __IOM uint32_t PLL_DIVR_CFG;                  /*!< 0x00000030 Reference Clock Divider (DIVR) Configuration */
  __IOM uint32_t PLL_DIVP_CFG;                  /*!< 0x00000034 Post Divider (DIVP) Configuration */
  __IOM uint32_t PLL_DIVH_CFG;                  /*!< 0x00000038 HS Divider (DIVH) Configuration */
  __IOM uint32_t PLL_PFD_CFG;                   /*!< 0x0000003C Phase/Frequency Detector (PFD) Configuration */
  __IOM uint32_t PLL_CP_CFG;                    /*!< 0x00000040 Charge Pump (CP) Configuration */
  __IOM uint32_t PLL_LF_CFG;                    /*!< 0x00000044 Loop Filter (LF) Configuration */
  __IOM uint32_t PLL_VCO_CFG;                   /*!< 0x00000048 Voltage-Controlled Oscillator (VCO) Configuration */
  __IOM uint32_t PLL_BIASGEN_CFG;               /*!< 0x0000004C Bias Generator (BIASGEN) Configuration */
  __IOM uint32_t PLL_GNRL_CFG;                  /*!< 0x00000050 General Controls Configuration */
  __IOM uint32_t PLL_VREG_CFG1;                 /*!< 0x00000054 Regulators Configuration */
  __IOM uint32_t PLL_VREG_CFG2;                 /*!< 0x00000058 Regulators Configuration */
   __IM uint32_t PLL_VREG_STAT;                 /*!< 0x0000005C Regulators Status */
  __IOM uint32_t PLL_LD_CFG;                    /*!< 0x00000060 Lock Detect Configuration */
   __IM uint32_t PLL_LD_STAT;                   /*!< 0x00000064 Lock Detect Status */
  __IOM uint32_t PLL_ATEST;                     /*!< 0x00000068 Analog Test Mux (ATEST) Configuration */
  __IOM uint32_t PLL_DTEST;                     /*!< 0x0000006C Digital Test Mux (DTEST) Configuration */
  __IOM uint32_t SPARE_CFG;                     /*!< 0x00000070 Spare Configuration */
   __IM uint32_t SPARE_STAT;                    /*!< 0x00000074 Spare Status */
   __IM uint32_t RESERVED[34];
} USB32DEV_PHYSS_USB40PHY_PLL_SYS_V1_Type; /*!< Size = 256 (0x100) */

/**
  * \brief PHY Registers (USB32DEV_PHYSS_USB40PHY)
  */
typedef struct {
        USB32DEV_PHYSS_USB40PHY_TOP_V1_Type USB40PHY_TOP; /*!< 0x00000000 PHY TOP, PCS, Tx registers */
        USB32DEV_PHYSS_USB40PHY_RX_V1_Type USB40PHY_RX; /*!< 0x00000800 PHY Rx registers */
        USB32DEV_PHYSS_USB40PHY_PLL_SYS_V1_Type USB40PHY_PLL_SYS; /*!< 0x00000900 PHY PLL SYS registers */
   __IM uint32_t RESERVED[384];
} USB32DEV_PHYSS_USB40PHY_V1_Type; /*!< Size = 4096 (0x1000) */

/**
  * \brief USB32 SuperSpeedPlus Physical Layer Registers (USB32DEV_PHYSS)
  */
typedef struct {
        USB32DEV_PHYSS_USB40PHY_V1_Type USB40PHY[2]; /*!< 0x00000000 PHY Registers */
} USB32DEV_PHYSS_V1_Type;     /*!< Size = 8192 (0x2000) */

/**
  * \brief Socket Registers (USB32DEV_ADAPTER_DMA_SCK)
  */
typedef struct {
  __IOM uint32_t SCK_DSCR;                      /*!< 0x00000000 Descriptor Chain Pointer */
  __IOM uint32_t SCK_SIZE;                      /*!< 0x00000004 Transfer Size Register */
  __IOM uint32_t SCK_COUNT;                     /*!< 0x00000008 Transfer Count Register */
  __IOM uint32_t SCK_STATUS;                    /*!< 0x0000000C Socket Status Register */
  __IOM uint32_t SCK_INTR;                      /*!< 0x00000010 Socket Interrupt Request Register */
  __IOM uint32_t SCK_INTR_MASK;                 /*!< 0x00000014 Socket Interrupt Mask Register */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t DSCR_BUFFER;                   /*!< 0x00000020 Descriptor buffer base address register */
  __IOM uint32_t DSCR_SYNC;                     /*!< 0x00000024 Descriptor synchronization pointers register */
  __IOM uint32_t DSCR_CHAIN;                    /*!< 0x00000028 Descriptor Chain Pointers Register */
  __IOM uint32_t DSCR_SIZE;                     /*!< 0x0000002C Descriptor Size Register */
   __IM uint32_t RESERVED1[19];
   __OM uint32_t EVENT;                         /*!< 0x0000007C Event Communication Register */
} USB32DEV_ADAPTER_DMA_SCK_V1_Type; /*!< Size = 128 (0x80) */

/**
  * \brief General DMA Registers (USB32DEV_ADAPTER_DMA_SCK_GBL)
  */
typedef struct {
   __IM uint32_t SCK_INTR;                      /*!< 0x00000000 Socket Interrupt Request Register */
   __IM uint32_t RESERVED[59];
  __IOM uint32_t ADAPTER_CTRL;                  /*!< 0x000000F0 Adapter Control Register */
   __IM uint32_t ADAPTER_DEBUG;                 /*!< 0x000000F4 Adapter Debug Observation Register */
  __IOM uint32_t ADAPTER_CONF;                  /*!< 0x000000F8 Adapter Configuration Register */
   __IM uint32_t ADAPTER_STATUS;                /*!< 0x000000FC Adapter Global Status Fields */
} USB32DEV_ADAPTER_DMA_SCK_GBL_V1_Type; /*!< Size = 256 (0x100) */

/**
  * \brief USB32 DMA Adapter registers. 
0x10000 is for Ingress and 0x20000 for egress Adapter (USB32DEV_ADAPTER_DMA)
  */
typedef struct {
   __IM uint32_t RESERVED[8192];
        USB32DEV_ADAPTER_DMA_SCK_V1_Type SCK[16]; /*!< 0x00008000 Socket Registers */
   __IM uint32_t RESERVED1[7616];
        USB32DEV_ADAPTER_DMA_SCK_GBL_V1_Type SCK_GBL; /*!< 0x0000FF00 General DMA Registers */
} USB32DEV_ADAPTER_DMA_V1_Type; /*!< Size = 65536 (0x10000) */

