RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
/**
  * \brief USB32DEV Registers (USB32DEV_USB32DEV)
  */
typedef struct {
        USB32DEV_MAIN_V1_Type USB32DEV_MAIN; /*!< 0x00000000 USB32 Main Register */
        USB32DEV_EPM_V1_Type USB32DEV_EPM; /*!< 0x00001000 USB32 Controller End Point Manager Registers */
        USB32DEV_LNK_V1_Type USB32DEV_LNK; /*!< 0x00002000 USB32 SuperSpeedPlus Device Controller Link Layer Registers */
        USB32DEV_PROT_V1_Type USB32DEV_PROT; /*!< 0x00003000 USB32 SuperSpeedPlus Device Controller Protocol Layer Registers */
        USB32DEV_PHYSS_V1_Type USB32DEV_PHYSS; /*!< 0x00004000 USB32 SuperSpeedPlus Physical Layer Registers */
   __IM uint32_t RESERVED[10240];
        USB32DEV_ADAPTER_DMA_V1_Type USB32DEV_ADAPTER[2]; /*!< 0x00010000 USB32 DMA Adapter registers. 0x10000 is for Ingress and 0x20000
                                                                for egress Adapter */
} USB32DEV_V1_Type;                    /*!< Size = 196608 (0x30000) */


/* USB32DEV_MAIN.CTRL */
#define USB32DEV_MAIN_CTRL_SSDEV_ENABLE_Pos 0UL
#define USB32DEV_MAIN_CTRL_SSDEV_ENABLE_Msk 0x1UL
#define USB32DEV_MAIN_CTRL_DISABLE_SRAM_Pos 2UL
#define USB32DEV_MAIN_CTRL_DISABLE_SRAM_Msk 0x4UL
#define USB32DEV_MAIN_CTRL_USB2_BUS_RESET_Pos 3UL
#define USB32DEV_MAIN_CTRL_USB2_BUS_RESET_Msk 0x8UL
#define USB32DEV_MAIN_CTRL_CLK_EN_Pos 4UL
#define USB32DEV_MAIN_CTRL_CLK_EN_Msk 0x10UL
#define USB32DEV_MAIN_CTRL_PCLK_SRC_Pos 5UL
#define USB32DEV_MAIN_CTRL_PCLK_SRC_Msk 0x60UL
#define USB32DEV_MAIN_CTRL_EN_RST_CLOCK_MUX_Pos 7UL
#define USB32DEV_MAIN_CTRL_EN_RST_CLOCK_MUX_Msk 0x80UL
#define USB32DEV_MAIN_CTRL_EN_EGRS_RQ_HALF_DATA_RATE_Pos 8UL
#define USB32DEV_MAIN_CTRL_EN_EGRS_RQ_HALF_DATA_RATE_Msk 0x100UL
#define USB32DEV_MAIN_CTRL_CONFIG_LANE_Pos 30UL
#define USB32DEV_MAIN_CTRL_CONFIG_LANE_Msk 0x40000000UL
#define USB32DEV_MAIN_CTRL_IP_ENABLED_Pos 31UL
#define USB32DEV_MAIN_CTRL_IP_ENABLED_Msk 0x80000000UL
/* USB32DEV_MAIN.INTR */
#define USB32DEV_MAIN_INTR_LINK_Pos 0UL
#define USB32DEV_MAIN_INTR_LINK_Msk 0x1UL
#define USB32DEV_MAIN_INTR_PROT_Pos 1UL
#define USB32DEV_MAIN_INTR_PROT_Msk 0x2UL
#define USB32DEV_MAIN_INTR_PROT_EP_Pos 2UL
#define USB32DEV_MAIN_INTR_PROT_EP_Msk 0x4UL
#define USB32DEV_MAIN_INTR_EPM_URUN_Pos 3UL
#define USB32DEV_MAIN_INTR_EPM_URUN_Msk 0x8UL
#define USB32DEV_MAIN_INTR_P3P0_Pos 5UL
#define USB32DEV_MAIN_INTR_P3P0_Msk 0x20UL
#define USB32DEV_MAIN_INTR_P3P1_Pos 6UL
#define USB32DEV_MAIN_INTR_P3P1_Msk 0x40UL
#define USB32DEV_MAIN_INTR_P3P2_Pos 7UL
#define USB32DEV_MAIN_INTR_P3P2_Msk 0x80UL
#define USB32DEV_MAIN_INTR_PHY0_Pos 8UL
#define USB32DEV_MAIN_INTR_PHY0_Msk 0x100UL
#define USB32DEV_MAIN_INTR_PHY1_Pos 9UL
#define USB32DEV_MAIN_INTR_PHY1_Msk 0x200UL
/* USB32DEV_MAIN.INTR_SET */
#define USB32DEV_MAIN_INTR_SET_LINK_Pos 0UL
#define USB32DEV_MAIN_INTR_SET_LINK_Msk 0x1UL
#define USB32DEV_MAIN_INTR_SET_PROT_Pos 1UL
#define USB32DEV_MAIN_INTR_SET_PROT_Msk 0x2UL
#define USB32DEV_MAIN_INTR_SET_PROT_EP_Pos 2UL
#define USB32DEV_MAIN_INTR_SET_PROT_EP_Msk 0x4UL
#define USB32DEV_MAIN_INTR_SET_EPM_URUN_Pos 3UL
#define USB32DEV_MAIN_INTR_SET_EPM_URUN_Msk 0x8UL
#define USB32DEV_MAIN_INTR_SET_P3P0_Pos 5UL
#define USB32DEV_MAIN_INTR_SET_P3P0_Msk 0x20UL
#define USB32DEV_MAIN_INTR_SET_P3P1_Pos 6UL
#define USB32DEV_MAIN_INTR_SET_P3P1_Msk 0x40UL
#define USB32DEV_MAIN_INTR_SET_P3P2_Pos 7UL
#define USB32DEV_MAIN_INTR_SET_P3P2_Msk 0x80UL
#define USB32DEV_MAIN_INTR_SET_PHY0_Pos 8UL
#define USB32DEV_MAIN_INTR_SET_PHY0_Msk 0x100UL
#define USB32DEV_MAIN_INTR_SET_PHY1_Pos 9UL
#define USB32DEV_MAIN_INTR_SET_PHY1_Msk 0x200UL
/* USB32DEV_MAIN.INTR_MASK */
#define USB32DEV_MAIN_INTR_MASK_LINK_MASK_Pos 0UL
#define USB32DEV_MAIN_INTR_MASK_LINK_MASK_Msk 0x1UL
#define USB32DEV_MAIN_INTR_MASK_PROT_MASK_Pos 1UL
#define USB32DEV_MAIN_INTR_MASK_PROT_MASK_Msk 0x2UL
#define USB32DEV_MAIN_INTR_MASK_PROT_EP_MASK_Pos 2UL
#define USB32DEV_MAIN_INTR_MASK_PROT_EP_MASK_Msk 0x4UL
#define USB32DEV_MAIN_INTR_MASK_EPM_URUN_MASK_Pos 3UL
#define USB32DEV_MAIN_INTR_MASK_EPM_URUN_MASK_Msk 0x8UL
#define USB32DEV_MAIN_INTR_MASK_P3P0_MASK_Pos 5UL
#define USB32DEV_MAIN_INTR_MASK_P3P0_MASK_Msk 0x20UL
#define USB32DEV_MAIN_INTR_MASK_P3P1_MASK_Pos 6UL
#define USB32DEV_MAIN_INTR_MASK_P3P1_MASK_Msk 0x40UL
#define USB32DEV_MAIN_INTR_MASK_P3P2_MASK_Pos 7UL
#define USB32DEV_MAIN_INTR_MASK_P3P2_MASK_Msk 0x80UL
#define USB32DEV_MAIN_INTR_MASK_PHY0_MASK_Pos 8UL
#define USB32DEV_MAIN_INTR_MASK_PHY0_MASK_Msk 0x100UL
#define USB32DEV_MAIN_INTR_MASK_PHY1_MASK_Pos 9UL
#define USB32DEV_MAIN_INTR_MASK_PHY1_MASK_Msk 0x200UL
/* USB32DEV_MAIN.INTR_MASKED */
#define USB32DEV_MAIN_INTR_MASKED_LINK_MASKED_Pos 0UL
#define USB32DEV_MAIN_INTR_MASKED_LINK_MASKED_Msk 0x1UL
#define USB32DEV_MAIN_INTR_MASKED_PROT_MASKED_Pos 1UL
#define USB32DEV_MAIN_INTR_MASKED_PROT_MASKED_Msk 0x2UL
#define USB32DEV_MAIN_INTR_MASKED_PROT_EP_MASKED_Pos 2UL
#define USB32DEV_MAIN_INTR_MASKED_PROT_EP_MASKED_Msk 0x4UL
#define USB32DEV_MAIN_INTR_MASKED_EPM_URUN_MASKED_Pos 3UL
#define USB32DEV_MAIN_INTR_MASKED_EPM_URUN_MASKED_Msk 0x8UL
#define USB32DEV_MAIN_INTR_MASKED_P3P0_MASKED_Pos 5UL
#define USB32DEV_MAIN_INTR_MASKED_P3P0_MASKED_Msk 0x20UL
#define USB32DEV_MAIN_INTR_MASKED_P3P1_MASKED_Pos 6UL
#define USB32DEV_MAIN_INTR_MASKED_P3P1_MASKED_Msk 0x40UL
#define USB32DEV_MAIN_INTR_MASKED_P3P2_MASKED_Pos 7UL
#define USB32DEV_MAIN_INTR_MASKED_P3P2_MASKED_Msk 0x80UL
#define USB32DEV_MAIN_INTR_MASKED_PHY0_MASKED_Pos 8UL
#define USB32DEV_MAIN_INTR_MASKED_PHY0_MASKED_Msk 0x100UL
#define USB32DEV_MAIN_INTR_MASKED_PHY1_MASKED_Pos 9UL
#define USB32DEV_MAIN_INTR_MASKED_PHY1_MASKED_Msk 0x200UL
/* USB32DEV_MAIN.DDFT_MUX */
#define USB32DEV_MAIN_DDFT_MUX_DDFT0_SEL_Pos 0UL
#define USB32DEV_MAIN_DDFT_MUX_DDFT0_SEL_Msk 0xFFUL
#define USB32DEV_MAIN_DDFT_MUX_DDFT1_SEL_Pos 8UL
#define USB32DEV_MAIN_DDFT_MUX_DDFT1_SEL_Msk 0xFF00UL
/* USB32DEV_MAIN.GPIO_DDFT_MUX */
#define USB32DEV_MAIN_GPIO_DDFT_MUX_DDFT0_SEL_Pos 0UL
#define USB32DEV_MAIN_GPIO_DDFT_MUX_DDFT0_SEL_Msk 0xFFUL
#define USB32DEV_MAIN_GPIO_DDFT_MUX_DDFT1_SEL_Pos 8UL
#define USB32DEV_MAIN_GPIO_DDFT_MUX_DDFT1_SEL_Msk 0xFF00UL
/* USB32DEV_MAIN.DEBUG_CONFIG */
#define USB32DEV_MAIN_DEBUG_CONFIG_DEBUG_EN_Pos 0UL
#define USB32DEV_MAIN_DEBUG_CONFIG_DEBUG_EN_Msk 0x1UL
#define USB32DEV_MAIN_DEBUG_CONFIG_STOP_EN_Pos 1UL
#define USB32DEV_MAIN_DEBUG_CONFIG_STOP_EN_Msk 0x2UL
#define USB32DEV_MAIN_DEBUG_CONFIG_FUNC_SEL_Pos 2UL
#define USB32DEV_MAIN_DEBUG_CONFIG_FUNC_SEL_Msk 0x1CUL
#define USB32DEV_MAIN_DEBUG_CONFIG_START_EVENT_SEL_Pos 5UL
#define USB32DEV_MAIN_DEBUG_CONFIG_START_EVENT_SEL_Msk 0x7E0UL
#define USB32DEV_MAIN_DEBUG_CONFIG_END_EVENT_SEL_Pos 11UL
#define USB32DEV_MAIN_DEBUG_CONFIG_END_EVENT_SEL_Msk 0x1F800UL
#define USB32DEV_MAIN_DEBUG_CONFIG_NUM_OF_ACTIVITIES_Pos 17UL
#define USB32DEV_MAIN_DEBUG_CONFIG_NUM_OF_ACTIVITIES_Msk 0x1FE0000UL
#define USB32DEV_MAIN_DEBUG_CONFIG_SKT_NUM_Pos 25UL
#define USB32DEV_MAIN_DEBUG_CONFIG_SKT_NUM_Msk 0x1E000000UL
#define USB32DEV_MAIN_DEBUG_CONFIG_DEBUG_SKT_NUM_Pos 29UL
#define USB32DEV_MAIN_DEBUG_CONFIG_DEBUG_SKT_NUM_Msk 0xE0000000UL
/* USB32DEV_MAIN.DEBUG_MUX_SEL */
#define USB32DEV_MAIN_DEBUG_MUX_SEL_BIT_31_0_SEL_Pos 0UL
#define USB32DEV_MAIN_DEBUG_MUX_SEL_BIT_31_0_SEL_Msk 0xFUL
#define USB32DEV_MAIN_DEBUG_MUX_SEL_BIT_63_32_SEL_Pos 4UL
#define USB32DEV_MAIN_DEBUG_MUX_SEL_BIT_63_32_SEL_Msk 0xF0UL
#define USB32DEV_MAIN_DEBUG_MUX_SEL_BIT_95_64_SEL_Pos 8UL
#define USB32DEV_MAIN_DEBUG_MUX_SEL_BIT_95_64_SEL_Msk 0xF00UL
#define USB32DEV_MAIN_DEBUG_MUX_SEL_BIT_127_96_SEL_Pos 12UL
#define USB32DEV_MAIN_DEBUG_MUX_SEL_BIT_127_96_SEL_Msk 0xF000UL
/* USB32DEV_MAIN.LOOPBACK */
#define USB32DEV_MAIN_LOOPBACK_EP_NUM_Pos 0UL
#define USB32DEV_MAIN_LOOPBACK_EP_NUM_Msk 0xFUL
#define USB32DEV_MAIN_LOOPBACK_NUMP_Pos 4UL
#define USB32DEV_MAIN_LOOPBACK_NUMP_Msk 0x1F0UL
#define USB32DEV_MAIN_LOOPBACK_TT_FIELD_Pos 9UL
#define USB32DEV_MAIN_LOOPBACK_TT_FIELD_Msk 0xE00UL
#define USB32DEV_MAIN_LOOPBACK_SEQ_NUM_Pos 12UL
#define USB32DEV_MAIN_LOOPBACK_SEQ_NUM_Msk 0x1F000UL
#define USB32DEV_MAIN_LOOPBACK_SINGLE_XFER_Pos 29UL
#define USB32DEV_MAIN_LOOPBACK_SINGLE_XFER_Msk 0x20000000UL
#define USB32DEV_MAIN_LOOPBACK_BURN_IN_EN_Pos 30UL
#define USB32DEV_MAIN_LOOPBACK_BURN_IN_EN_Msk 0x40000000UL
#define USB32DEV_MAIN_LOOPBACK_PIPE_LOOPBACK_EN_Pos 31UL
#define USB32DEV_MAIN_LOOPBACK_PIPE_LOOPBACK_EN_Msk 0x80000000UL
/* USB32DEV_MAIN.BUG_FIX */
#define USB32DEV_MAIN_BUG_FIX_EPM_T1_T2_COLLISION_EN_Pos 0UL
#define USB32DEV_MAIN_BUG_FIX_EPM_T1_T2_COLLISION_EN_Msk 0x1UL
#define USB32DEV_MAIN_BUG_FIX_EPM_READ_END_RST_EN_Pos 1UL
#define USB32DEV_MAIN_BUG_FIX_EPM_READ_END_RST_EN_Msk 0x2UL
#define USB32DEV_MAIN_BUG_FIX_PROT_RTY_COLLISION_EN_Pos 8UL
#define USB32DEV_MAIN_BUG_FIX_PROT_RTY_COLLISION_EN_Msk 0x100UL
#define USB32DEV_MAIN_BUG_FIX_PROT_B2B_EN_Pos 9UL
#define USB32DEV_MAIN_BUG_FIX_PROT_B2B_EN_Msk 0x200UL
#define USB32DEV_MAIN_BUG_FIX_PROT_ISO_BRST_0_EN_Pos 10UL
#define USB32DEV_MAIN_BUG_FIX_PROT_ISO_BRST_0_EN_Msk 0x400UL
#define USB32DEV_MAIN_BUG_FIX_PROT_RX_COLLISION_EN_Pos 11UL
#define USB32DEV_MAIN_BUG_FIX_PROT_RX_COLLISION_EN_Msk 0x800UL
#define USB32DEV_MAIN_BUG_FIX_PROT_RX_SKP_NO_WRITE_EN_Pos 12UL
#define USB32DEV_MAIN_BUG_FIX_PROT_RX_SKP_NO_WRITE_EN_Msk 0x1000UL
#define USB32DEV_MAIN_BUG_FIX_RESET_PROT_STATE_Pos 13UL
#define USB32DEV_MAIN_BUG_FIX_RESET_PROT_STATE_Msk 0x2000UL
#define USB32DEV_MAIN_BUG_FIX_RESET_SKT_HAS_EOB_FUNC_Pos 14UL
#define USB32DEV_MAIN_BUG_FIX_RESET_SKT_HAS_EOB_FUNC_Msk 0x4000UL
#define USB32DEV_MAIN_BUG_FIX_DPH_WITH_EOB_CLEARED_Pos 16UL
#define USB32DEV_MAIN_BUG_FIX_DPH_WITH_EOB_CLEARED_Msk 0xFFFF0000UL


/* USB32DEV_EPM.EEPM_CS */
#define USB32DEV_EPM_EEPM_CS_A_RQ_EMPTY_DLY_Pos 0UL
#define USB32DEV_EPM_EEPM_CS_A_RQ_EMPTY_DLY_Msk 0x1FUL
#define USB32DEV_EPM_EEPM_CS_URUN_T1_EP_NUM_Pos 18UL
#define USB32DEV_EPM_EEPM_CS_URUN_T1_EP_NUM_Msk 0x3C0000UL
#define USB32DEV_EPM_EEPM_CS_URUN_T2_EP_NUM_Pos 22UL
#define USB32DEV_EPM_EEPM_CS_URUN_T2_EP_NUM_Msk 0x3C00000UL
#define USB32DEV_EPM_EEPM_CS_EG_EPNUM_Pos 28UL
#define USB32DEV_EPM_EEPM_CS_EG_EPNUM_Msk 0xF0000000UL
/* USB32DEV_EPM.IEPM_CS */
#define USB32DEV_EPM_IEPM_CS_READ_PTR_Pos 0UL
#define USB32DEV_EPM_IEPM_CS_READ_PTR_Msk 0xFFFUL
#define USB32DEV_EPM_IEPM_CS_WRITE_PTR_Pos 16UL
#define USB32DEV_EPM_IEPM_CS_WRITE_PTR_Msk 0xFFF0000UL
#define USB32DEV_EPM_IEPM_CS_EPM_FLUSH_Pos 28UL
#define USB32DEV_EPM_IEPM_CS_EPM_FLUSH_Msk 0x10000000UL
#define USB32DEV_EPM_IEPM_CS_DISABLE_IEPM_CLK_GT_Pos 31UL
#define USB32DEV_EPM_IEPM_CS_DISABLE_IEPM_CLK_GT_Msk 0x80000000UL
/* USB32DEV_EPM.IEPM_MULT */
#define USB32DEV_EPM_IEPM_MULT_MULT_EN_Pos 0UL
#define USB32DEV_EPM_IEPM_MULT_MULT_EN_Msk 0x7FFFUL
#define USB32DEV_EPM_IEPM_MULT_MULT_THRSHOLD_Pos 15UL
#define USB32DEV_EPM_IEPM_MULT_MULT_THRSHOLD_Msk 0x3FF8000UL
/* USB32DEV_EPM.EEPM_ENDPOINT */
#define USB32DEV_EPM_EEPM_ENDPOINT_PACKET_SIZE_Pos 0UL
#define USB32DEV_EPM_EEPM_ENDPOINT_PACKET_SIZE_Msk 0x7FFUL
#define USB32DEV_EPM_EEPM_ENDPOINT_EEPM_BYTE_COUNT_Pos 11UL
#define USB32DEV_EPM_EEPM_ENDPOINT_EEPM_BYTE_COUNT_Msk 0x7FFF800UL
#define USB32DEV_EPM_EEPM_ENDPOINT_ZLP_Pos 27UL
#define USB32DEV_EPM_EEPM_ENDPOINT_ZLP_Msk 0x8000000UL
#define USB32DEV_EPM_EEPM_ENDPOINT_MSB_EEPM_BYTE_COUNT_Pos 28UL
#define USB32DEV_EPM_EEPM_ENDPOINT_MSB_EEPM_BYTE_COUNT_Msk 0x10000000UL
#define USB32DEV_EPM_EEPM_ENDPOINT_EPM_EMPTY_Pos 29UL
#define USB32DEV_EPM_EEPM_ENDPOINT_EPM_EMPTY_Msk 0x20000000UL
#define USB32DEV_EPM_EEPM_ENDPOINT_EEPM_EP_READY_Pos 30UL
#define USB32DEV_EPM_EEPM_ENDPOINT_EEPM_EP_READY_Msk 0x40000000UL
#define USB32DEV_EPM_EEPM_ENDPOINT_SOCKET_FLUSH_Pos 31UL
#define USB32DEV_EPM_EEPM_ENDPOINT_SOCKET_FLUSH_Msk 0x80000000UL
/* USB32DEV_EPM.IEPM_ENDPOINT */
#define USB32DEV_EPM_IEPM_ENDPOINT_PACKET_SIZE_Pos 0UL
#define USB32DEV_EPM_IEPM_ENDPOINT_PACKET_SIZE_Msk 0x7FFUL
#define USB32DEV_EPM_IEPM_ENDPOINT_NUM_IN_PACKETS_Pos 11UL
#define USB32DEV_EPM_IEPM_ENDPOINT_NUM_IN_PACKETS_Msk 0x3FF800UL
#define USB32DEV_EPM_IEPM_ENDPOINT_EP_READY_Pos 22UL
#define USB32DEV_EPM_IEPM_ENDPOINT_EP_READY_Msk 0x400000UL
#define USB32DEV_EPM_IEPM_ENDPOINT_ODD_MAX_NUM_PKTS_Pos 24UL
#define USB32DEV_EPM_IEPM_ENDPOINT_ODD_MAX_NUM_PKTS_Msk 0x1F000000UL
#define USB32DEV_EPM_IEPM_ENDPOINT_ODD_MAX_PKT_SIZE_EN_Pos 29UL
#define USB32DEV_EPM_IEPM_ENDPOINT_ODD_MAX_PKT_SIZE_EN_Msk 0x20000000UL
#define USB32DEV_EPM_IEPM_ENDPOINT_EOT_EOP_Pos 30UL
#define USB32DEV_EPM_IEPM_ENDPOINT_EOT_EOP_Msk 0x40000000UL
#define USB32DEV_EPM_IEPM_ENDPOINT_SOCKET_FLUSH_Pos 31UL
#define USB32DEV_EPM_IEPM_ENDPOINT_SOCKET_FLUSH_Msk 0x80000000UL
/* USB32DEV_EPM.IEPM_FIFO */
#define USB32DEV_EPM_IEPM_FIFO_BYTES_Pos 0UL
#define USB32DEV_EPM_IEPM_FIFO_BYTES_Msk 0x7FFUL
#define USB32DEV_EPM_IEPM_FIFO_EOT_Pos 11UL
#define USB32DEV_EPM_IEPM_FIFO_EOT_Msk 0x800UL
#define USB32DEV_EPM_IEPM_FIFO_IN_EPNUM_Pos 12UL
#define USB32DEV_EPM_IEPM_FIFO_IN_EPNUM_Msk 0xF000UL
#define USB32DEV_EPM_IEPM_FIFO_EP_VALID_Pos 16UL
#define USB32DEV_EPM_IEPM_FIFO_EP_VALID_Msk 0x10000UL
/* USB32DEV_EPM.EEPM_VALID */
#define USB32DEV_EPM_EEPM_VALID_SKT_NUM_Pos 0UL
#define USB32DEV_EPM_EEPM_VALID_SKT_NUM_Msk 0xFUL
#define USB32DEV_EPM_EEPM_VALID_VALID_PACKETS_Pos 16UL
#define USB32DEV_EPM_EEPM_VALID_VALID_PACKETS_Msk 0xFFFF0000UL
/* USB32DEV_EPM.EEPM_RETRY_OFFSET */
#define USB32DEV_EPM_EEPM_RETRY_OFFSET_START_OFFSET_Pos 0UL
#define USB32DEV_EPM_EEPM_RETRY_OFFSET_START_OFFSET_Msk 0x3FFFUL
/* USB32DEV_EPM.EEPM_INJECT_CRC32_ERROR */
#define USB32DEV_EPM_EEPM_INJECT_CRC32_ERROR_EN_CRC32_ERROR_ON_SW_BUF_Pos 0UL
#define USB32DEV_EPM_EEPM_INJECT_CRC32_ERROR_EN_CRC32_ERROR_ON_SW_BUF_Msk 0x1UL
#define USB32DEV_EPM_EEPM_INJECT_CRC32_ERROR_EN_CRC32_ERROR_ON_RETRY_Pos 1UL
#define USB32DEV_EPM_EEPM_INJECT_CRC32_ERROR_EN_CRC32_ERROR_ON_RETRY_Msk 0x2UL
#define USB32DEV_EPM_EEPM_INJECT_CRC32_ERROR_SW_BUF_PKT_NUM_Pos 2UL
#define USB32DEV_EPM_EEPM_INJECT_CRC32_ERROR_SW_BUF_PKT_NUM_Msk 0x3CUL
#define USB32DEV_EPM_EEPM_INJECT_CRC32_ERROR_RETRY_BUF_PKT_NUM_Pos 6UL
#define USB32DEV_EPM_EEPM_INJECT_CRC32_ERROR_RETRY_BUF_PKT_NUM_Msk 0x3C0UL


