RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
/* USB32DEV_LNK.LNK_CONF */
#define USB32DEV_LNK_CONF_TX_ARBITRATION_Pos 0UL
#define USB32DEV_LNK_CONF_TX_ARBITRATION_Msk 0x3UL
#define USB32DEV_LNK_CONF_LCW_IGNORE_RSVD_Pos 6UL
#define USB32DEV_LNK_CONF_LCW_IGNORE_RSVD_Msk 0x40UL
#define USB32DEV_LNK_CONF_DEBUG_FEATURE_ENABLE_Pos 7UL
#define USB32DEV_LNK_CONF_DEBUG_FEATURE_ENABLE_Msk 0x80UL
#define USB32DEV_LNK_CONF_FORCE_POWER_PRESENT_Pos 8UL
#define USB32DEV_LNK_CONF_FORCE_POWER_PRESENT_Msk 0x100UL
#define USB32DEV_LNK_CONF_LDN_DETECTION_Pos 9UL
#define USB32DEV_LNK_CONF_LDN_DETECTION_Msk 0x200UL
#define USB32DEV_LNK_CONF_CREDIT_ADV_HOLDOFF_Pos 10UL
#define USB32DEV_LNK_CONF_CREDIT_ADV_HOLDOFF_Msk 0x400UL
#define USB32DEV_LNK_CONF_GEN1X2_SKP_RULE_SEL_Pos 11UL
#define USB32DEV_LNK_CONF_GEN1X2_SKP_RULE_SEL_Msk 0x800UL
#define USB32DEV_LNK_CONF_EPM_FIRST_DELAY_Pos 12UL
#define USB32DEV_LNK_CONF_EPM_FIRST_DELAY_Msk 0xF000UL
#define USB32DEV_LNK_CONF_GEN1X1_INVALID_OS_DET_EN_Pos 16UL
#define USB32DEV_LNK_CONF_GEN1X1_INVALID_OS_DET_EN_Msk 0x10000UL
#define USB32DEV_LNK_CONF_GEN1X1_CP_TXDETECT_RXLPBK_EN_Pos 17UL
#define USB32DEV_LNK_CONF_GEN1X1_CP_TXDETECT_RXLPBK_EN_Msk 0x20000UL
#define USB32DEV_LNK_CONF_GEN1X1_LOOPBACK_MASTER_SKP_EN_Pos 18UL
#define USB32DEV_LNK_CONF_GEN1X1_LOOPBACK_MASTER_SKP_EN_Msk 0x40000UL
#define USB32DEV_LNK_CONF_DC_BAL_ALL_OS_Pos 19UL
#define USB32DEV_LNK_CONF_DC_BAL_ALL_OS_Msk 0x80000UL
#define USB32DEV_LNK_CONF_DC_BAL_NON_OS_RESET_Pos 20UL
#define USB32DEV_LNK_CONF_DC_BAL_NON_OS_RESET_Msk 0x100000UL
#define USB32DEV_LNK_CONF_SKP_IN_RXEQ_OFF_Pos 21UL
#define USB32DEV_LNK_CONF_SKP_IN_RXEQ_OFF_Msk 0x200000UL
#define USB32DEV_LNK_CONF_DC_BAL_EN_Pos 24UL
#define USB32DEV_LNK_CONF_DC_BAL_EN_Msk 0x1000000UL
#define USB32DEV_LNK_CONF_RX_DPP_ERR_GO_RECOVERY_EN_Pos 25UL
#define USB32DEV_LNK_CONF_RX_DPP_ERR_GO_RECOVERY_EN_Msk 0x2000000UL
#define USB32DEV_LNK_CONF_SKEW_VAL_Pos 26UL
#define USB32DEV_LNK_CONF_SKEW_VAL_Msk 0x7C000000UL
#define USB32DEV_LNK_CONF_DESKEW_CTRL_SEL_Pos 31UL
#define USB32DEV_LNK_CONF_DESKEW_CTRL_SEL_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_INTR */
#define USB32DEV_LNK_INTR_LTSSM_STATE_CHG_Pos 0UL
#define USB32DEV_LNK_INTR_LTSSM_STATE_CHG_Msk 0x1UL
#define USB32DEV_LNK_INTR_LGOOD_Pos 1UL
#define USB32DEV_LNK_INTR_LGOOD_Msk 0x2UL
#define USB32DEV_LNK_INTR_LRTY_Pos 2UL
#define USB32DEV_LNK_INTR_LRTY_Msk 0x4UL
#define USB32DEV_LNK_INTR_LBAD_Pos 3UL
#define USB32DEV_LNK_INTR_LBAD_Msk 0x8UL
#define USB32DEV_LNK_INTR_LCRD_Pos 4UL
#define USB32DEV_LNK_INTR_LCRD_Msk 0x10UL
#define USB32DEV_LNK_INTR_LGO_U1_Pos 5UL
#define USB32DEV_LNK_INTR_LGO_U1_Msk 0x20UL
#define USB32DEV_LNK_INTR_LGO_U2_Pos 6UL
#define USB32DEV_LNK_INTR_LGO_U2_Msk 0x40UL
#define USB32DEV_LNK_INTR_LGO_U3_Pos 7UL
#define USB32DEV_LNK_INTR_LGO_U3_Msk 0x80UL
#define USB32DEV_LNK_INTR_LAU_Pos 8UL
#define USB32DEV_LNK_INTR_LAU_Msk 0x100UL
#define USB32DEV_LNK_INTR_LXU_Pos 9UL
#define USB32DEV_LNK_INTR_LXU_Msk 0x200UL
#define USB32DEV_LNK_INTR_LPMA_Pos 10UL
#define USB32DEV_LNK_INTR_LPMA_Msk 0x400UL
#define USB32DEV_LNK_INTR_BAD_LCW_Pos 11UL
#define USB32DEV_LNK_INTR_BAD_LCW_Msk 0x800UL
#define USB32DEV_LNK_INTR_LINK_ERROR_Pos 12UL
#define USB32DEV_LNK_INTR_LINK_ERROR_Msk 0x1000UL
#define USB32DEV_LNK_INTR_PHY_ERROR_Pos 13UL
#define USB32DEV_LNK_INTR_PHY_ERROR_Msk 0x2000UL
#define USB32DEV_LNK_INTR_U2_INACTIVITY_TIMEOUT_Pos 14UL
#define USB32DEV_LNK_INTR_U2_INACTIVITY_TIMEOUT_Msk 0x4000UL
#define USB32DEV_LNK_INTR_LTSSM_CONNECT_Pos 15UL
#define USB32DEV_LNK_INTR_LTSSM_CONNECT_Msk 0x8000UL
#define USB32DEV_LNK_INTR_LTSSM_DISCONNECT_Pos 16UL
#define USB32DEV_LNK_INTR_LTSSM_DISCONNECT_Msk 0x10000UL
#define USB32DEV_LNK_INTR_LTSSM_RESET_Pos 17UL
#define USB32DEV_LNK_INTR_LTSSM_RESET_Msk 0x20000UL
#define USB32DEV_LNK_INTR_DATA_RATE_CHANGE_Pos 18UL
#define USB32DEV_LNK_INTR_DATA_RATE_CHANGE_Msk 0x40000UL
#define USB32DEV_LNK_INTR_LTSSM_U3_ENTRY_Pos 19UL
#define USB32DEV_LNK_INTR_LTSSM_U3_ENTRY_Msk 0x80000UL
#define USB32DEV_LNK_INTR_RX_PING_LFPS_Pos 20UL
#define USB32DEV_LNK_INTR_RX_PING_LFPS_Msk 0x100000UL
/* USB32DEV_LNK.LNK_INTR_SET */
#define USB32DEV_LNK_INTR_SET_LTSSM_STATE_CHG_Pos 0UL
#define USB32DEV_LNK_INTR_SET_LTSSM_STATE_CHG_Msk 0x1UL
#define USB32DEV_LNK_INTR_SET_LGOOD_Pos 1UL
#define USB32DEV_LNK_INTR_SET_LGOOD_Msk 0x2UL
#define USB32DEV_LNK_INTR_SET_LRTY_Pos 2UL
#define USB32DEV_LNK_INTR_SET_LRTY_Msk 0x4UL
#define USB32DEV_LNK_INTR_SET_LBAD_Pos 3UL
#define USB32DEV_LNK_INTR_SET_LBAD_Msk 0x8UL
#define USB32DEV_LNK_INTR_SET_LCRD_Pos 4UL
#define USB32DEV_LNK_INTR_SET_LCRD_Msk 0x10UL
#define USB32DEV_LNK_INTR_SET_LGO_U1_Pos 5UL
#define USB32DEV_LNK_INTR_SET_LGO_U1_Msk 0x20UL
#define USB32DEV_LNK_INTR_SET_LGO_U2_Pos 6UL
#define USB32DEV_LNK_INTR_SET_LGO_U2_Msk 0x40UL
#define USB32DEV_LNK_INTR_SET_LGO_U3_Pos 7UL
#define USB32DEV_LNK_INTR_SET_LGO_U3_Msk 0x80UL
#define USB32DEV_LNK_INTR_SET_LAU_Pos 8UL
#define USB32DEV_LNK_INTR_SET_LAU_Msk 0x100UL
#define USB32DEV_LNK_INTR_SET_LXU_Pos 9UL
#define USB32DEV_LNK_INTR_SET_LXU_Msk 0x200UL
#define USB32DEV_LNK_INTR_SET_LPMA_Pos 10UL
#define USB32DEV_LNK_INTR_SET_LPMA_Msk 0x400UL
#define USB32DEV_LNK_INTR_SET_BAD_LCW_Pos 11UL
#define USB32DEV_LNK_INTR_SET_BAD_LCW_Msk 0x800UL
#define USB32DEV_LNK_INTR_SET_LINK_ERROR_Pos 12UL
#define USB32DEV_LNK_INTR_SET_LINK_ERROR_Msk 0x1000UL
#define USB32DEV_LNK_INTR_SET_PHY_ERROR_Pos 13UL
#define USB32DEV_LNK_INTR_SET_PHY_ERROR_Msk 0x2000UL
#define USB32DEV_LNK_INTR_SET_U2_INACTIVITY_TIMEOUT_Pos 14UL
#define USB32DEV_LNK_INTR_SET_U2_INACTIVITY_TIMEOUT_Msk 0x4000UL
#define USB32DEV_LNK_INTR_SET_LTSSM_CONNECT_Pos 15UL
#define USB32DEV_LNK_INTR_SET_LTSSM_CONNECT_Msk 0x8000UL
#define USB32DEV_LNK_INTR_SET_LTSSM_DISCONNECT_Pos 16UL
#define USB32DEV_LNK_INTR_SET_LTSSM_DISCONNECT_Msk 0x10000UL
#define USB32DEV_LNK_INTR_SET_LTSSM_RESET_Pos 17UL
#define USB32DEV_LNK_INTR_SET_LTSSM_RESET_Msk 0x20000UL
#define USB32DEV_LNK_INTR_SET_DATA_RATE_CHANGE_Pos 18UL
#define USB32DEV_LNK_INTR_SET_DATA_RATE_CHANGE_Msk 0x40000UL
#define USB32DEV_LNK_INTR_SET_LTSSM_U3_ENTRY_Pos 19UL
#define USB32DEV_LNK_INTR_SET_LTSSM_U3_ENTRY_Msk 0x80000UL
#define USB32DEV_LNK_INTR_SET_RX_PING_LFPS_Pos 20UL
#define USB32DEV_LNK_INTR_SET_RX_PING_LFPS_Msk 0x100000UL
/* USB32DEV_LNK.LNK_INTR_MASK */
#define USB32DEV_LNK_INTR_MASK_LTSSM_STATE_CHG_MASK_Pos 0UL
#define USB32DEV_LNK_INTR_MASK_LTSSM_STATE_CHG_MASK_Msk 0x1UL
#define USB32DEV_LNK_INTR_MASK_LGOOD_MASK_Pos 1UL
#define USB32DEV_LNK_INTR_MASK_LGOOD_MASK_Msk 0x2UL
#define USB32DEV_LNK_INTR_MASK_LRTY_MASK_Pos 2UL
#define USB32DEV_LNK_INTR_MASK_LRTY_MASK_Msk 0x4UL
#define USB32DEV_LNK_INTR_MASK_LBAD_MASK_Pos 3UL
#define USB32DEV_LNK_INTR_MASK_LBAD_MASK_Msk 0x8UL
#define USB32DEV_LNK_INTR_MASK_LCRD_MASK_Pos 4UL
#define USB32DEV_LNK_INTR_MASK_LCRD_MASK_Msk 0x10UL
#define USB32DEV_LNK_INTR_MASK_LGO_U1_MASK_Pos 5UL
#define USB32DEV_LNK_INTR_MASK_LGO_U1_MASK_Msk 0x20UL
#define USB32DEV_LNK_INTR_MASK_LGO_U2_MASK_Pos 6UL
#define USB32DEV_LNK_INTR_MASK_LGO_U2_MASK_Msk 0x40UL
#define USB32DEV_LNK_INTR_MASK_LGO_U3_MASK_Pos 7UL
#define USB32DEV_LNK_INTR_MASK_LGO_U3_MASK_Msk 0x80UL
#define USB32DEV_LNK_INTR_MASK_LAU_MASK_Pos 8UL
#define USB32DEV_LNK_INTR_MASK_LAU_MASK_Msk 0x100UL
#define USB32DEV_LNK_INTR_MASK_LXU_MASK_Pos 9UL
#define USB32DEV_LNK_INTR_MASK_LXU_MASK_Msk 0x200UL
#define USB32DEV_LNK_INTR_MASK_LPMA_MASK_Pos 10UL
#define USB32DEV_LNK_INTR_MASK_LPMA_MASK_Msk 0x400UL
#define USB32DEV_LNK_INTR_MASK_BAD_LCW_MASK_Pos 11UL
#define USB32DEV_LNK_INTR_MASK_BAD_LCW_MASK_Msk 0x800UL
#define USB32DEV_LNK_INTR_MASK_LINK_ERROR_MASK_Pos 12UL
#define USB32DEV_LNK_INTR_MASK_LINK_ERROR_MASK_Msk 0x1000UL
#define USB32DEV_LNK_INTR_MASK_PHY_ERROR_MASK_Pos 13UL
#define USB32DEV_LNK_INTR_MASK_PHY_ERROR_MASK_Msk 0x2000UL
#define USB32DEV_LNK_INTR_MASK_U2_INACTIVITY_TIMEOUT_MASK_Pos 14UL
#define USB32DEV_LNK_INTR_MASK_U2_INACTIVITY_TIMEOUT_MASK_Msk 0x4000UL
#define USB32DEV_LNK_INTR_MASK_LTSSM_CONNECT_MASK_Pos 15UL
#define USB32DEV_LNK_INTR_MASK_LTSSM_CONNECT_MASK_Msk 0x8000UL
#define USB32DEV_LNK_INTR_MASK_LTSSM_DISCONNECT_MASK_Pos 16UL
#define USB32DEV_LNK_INTR_MASK_LTSSM_DISCONNECT_MASK_Msk 0x10000UL
#define USB32DEV_LNK_INTR_MASK_LTSSM_RESET_MASK_Pos 17UL
#define USB32DEV_LNK_INTR_MASK_LTSSM_RESET_MASK_Msk 0x20000UL
#define USB32DEV_LNK_INTR_MASK_DATA_RATE_CHANGE_MASK_Pos 18UL
#define USB32DEV_LNK_INTR_MASK_DATA_RATE_CHANGE_MASK_Msk 0x40000UL
#define USB32DEV_LNK_INTR_MASK_LTSSM_U3_ENTRY_MASK_Pos 19UL
#define USB32DEV_LNK_INTR_MASK_LTSSM_U3_ENTRY_MASK_Msk 0x80000UL
#define USB32DEV_LNK_INTR_MASK_RX_PING_LFPS_Pos 20UL
#define USB32DEV_LNK_INTR_MASK_RX_PING_LFPS_Msk 0x100000UL
/* USB32DEV_LNK.LNK_INTR_MASKED */
#define USB32DEV_LNK_INTR_MASKED_LTSSM_STATE_CHG_MASKED_Pos 0UL
#define USB32DEV_LNK_INTR_MASKED_LTSSM_STATE_CHG_MASKED_Msk 0x1UL
#define USB32DEV_LNK_INTR_MASKED_LGOOD_MASKED_Pos 1UL
#define USB32DEV_LNK_INTR_MASKED_LGOOD_MASKED_Msk 0x2UL
#define USB32DEV_LNK_INTR_MASKED_LRTY_MASKED_Pos 2UL
#define USB32DEV_LNK_INTR_MASKED_LRTY_MASKED_Msk 0x4UL
#define USB32DEV_LNK_INTR_MASKED_LBAD_MASKED_Pos 3UL
#define USB32DEV_LNK_INTR_MASKED_LBAD_MASKED_Msk 0x8UL
#define USB32DEV_LNK_INTR_MASKED_LCRD_MASKED_Pos 4UL
#define USB32DEV_LNK_INTR_MASKED_LCRD_MASKED_Msk 0x10UL
#define USB32DEV_LNK_INTR_MASKED_LGO_U1_MASKED_Pos 5UL
#define USB32DEV_LNK_INTR_MASKED_LGO_U1_MASKED_Msk 0x20UL
#define USB32DEV_LNK_INTR_MASKED_LGO_U2_MASKED_Pos 6UL
#define USB32DEV_LNK_INTR_MASKED_LGO_U2_MASKED_Msk 0x40UL
#define USB32DEV_LNK_INTR_MASKED_LGO_U3_MASKED_Pos 7UL
#define USB32DEV_LNK_INTR_MASKED_LGO_U3_MASKED_Msk 0x80UL
#define USB32DEV_LNK_INTR_MASKED_LAU_MASKED_Pos 8UL
#define USB32DEV_LNK_INTR_MASKED_LAU_MASKED_Msk 0x100UL
#define USB32DEV_LNK_INTR_MASKED_LXU_MASKED_Pos 9UL
#define USB32DEV_LNK_INTR_MASKED_LXU_MASKED_Msk 0x200UL
#define USB32DEV_LNK_INTR_MASKED_LPMA_MASKED_Pos 10UL
#define USB32DEV_LNK_INTR_MASKED_LPMA_MASKED_Msk 0x400UL
#define USB32DEV_LNK_INTR_MASKED_BAD_LCW_MASKED_Pos 11UL
#define USB32DEV_LNK_INTR_MASKED_BAD_LCW_MASKED_Msk 0x800UL
#define USB32DEV_LNK_INTR_MASKED_LINK_ERROR_MASKED_Pos 12UL
#define USB32DEV_LNK_INTR_MASKED_LINK_ERROR_MASKED_Msk 0x1000UL
#define USB32DEV_LNK_INTR_MASKED_PHY_ERROR_MASKED_Pos 13UL
#define USB32DEV_LNK_INTR_MASKED_PHY_ERROR_MASKED_Msk 0x2000UL
#define USB32DEV_LNK_INTR_MASKED_U2_INACTIVITY_TIMEOUT_MASKED_Pos 14UL
#define USB32DEV_LNK_INTR_MASKED_U2_INACTIVITY_TIMEOUT_MASKED_Msk 0x4000UL
#define USB32DEV_LNK_INTR_MASKED_LTSSM_CONNECT_MASKED_Pos 15UL
#define USB32DEV_LNK_INTR_MASKED_LTSSM_CONNECT_MASKED_Msk 0x8000UL
#define USB32DEV_LNK_INTR_MASKED_LTSSM_DISCONNECT_MASKED_Pos 16UL
#define USB32DEV_LNK_INTR_MASKED_LTSSM_DISCONNECT_MASKED_Msk 0x10000UL
#define USB32DEV_LNK_INTR_MASKED_LTSSM_RESET_MASKED_Pos 17UL
#define USB32DEV_LNK_INTR_MASKED_LTSSM_RESET_MASKED_Msk 0x20000UL
#define USB32DEV_LNK_INTR_MASKED_DATA_RATE_CHANGE_MASKED_Pos 18UL
#define USB32DEV_LNK_INTR_MASKED_DATA_RATE_CHANGE_MASKED_Msk 0x40000UL
#define USB32DEV_LNK_INTR_MASKED_LTSSM_U3_ENTRY_MASKED_Pos 19UL
#define USB32DEV_LNK_INTR_MASKED_LTSSM_U3_ENTRY_MASKED_Msk 0x80000UL
#define USB32DEV_LNK_INTR_MASKED_RX_PING_LFPS_Pos 20UL
#define USB32DEV_LNK_INTR_MASKED_RX_PING_LFPS_Msk 0x100000UL
/* USB32DEV_LNK.LNK_ERROR_CONF */
#define USB32DEV_LNK_ERROR_CONF_HP_TIMEOUT_EN_Pos 0UL
#define USB32DEV_LNK_ERROR_CONF_HP_TIMEOUT_EN_Msk 0x1UL
#define USB32DEV_LNK_ERROR_CONF_RX_SEQ_NUM_ERR_EN_Pos 1UL
#define USB32DEV_LNK_ERROR_CONF_RX_SEQ_NUM_ERR_EN_Msk 0x2UL
#define USB32DEV_LNK_ERROR_CONF_RX_HP_FAIL_EN_Pos 2UL
#define USB32DEV_LNK_ERROR_CONF_RX_HP_FAIL_EN_Msk 0x4UL
#define USB32DEV_LNK_ERROR_CONF_MISSING_LGOOD_EN_Pos 3UL
#define USB32DEV_LNK_ERROR_CONF_MISSING_LGOOD_EN_Msk 0x8UL
#define USB32DEV_LNK_ERROR_CONF_MISSING_LCRD_EN_Pos 4UL
#define USB32DEV_LNK_ERROR_CONF_MISSING_LCRD_EN_Msk 0x10UL
#define USB32DEV_LNK_ERROR_CONF_CREDIT_HP_TIMEOUT_EN_Pos 5UL
#define USB32DEV_LNK_ERROR_CONF_CREDIT_HP_TIMEOUT_EN_Msk 0x20UL
#define USB32DEV_LNK_ERROR_CONF_PM_LC_TIMEOUT_EN_Pos 6UL
#define USB32DEV_LNK_ERROR_CONF_PM_LC_TIMEOUT_EN_Msk 0x40UL
#define USB32DEV_LNK_ERROR_CONF_TX_SEQ_NUM_ERR_EN_Pos 7UL
#define USB32DEV_LNK_ERROR_CONF_TX_SEQ_NUM_ERR_EN_Msk 0x80UL
#define USB32DEV_LNK_ERROR_CONF_HDR_ADV_TIMEOUT_EN_Pos 8UL
#define USB32DEV_LNK_ERROR_CONF_HDR_ADV_TIMEOUT_EN_Msk 0x100UL
#define USB32DEV_LNK_ERROR_CONF_HDR_ADV_HP_EN_Pos 9UL
#define USB32DEV_LNK_ERROR_CONF_HDR_ADV_HP_EN_Msk 0x200UL
#define USB32DEV_LNK_ERROR_CONF_HDR_ADV_LCRD_EN_Pos 10UL
#define USB32DEV_LNK_ERROR_CONF_HDR_ADV_LCRD_EN_Msk 0x400UL
#define USB32DEV_LNK_ERROR_CONF_HDR_ADV_LGO_EN_Pos 11UL
#define USB32DEV_LNK_ERROR_CONF_HDR_ADV_LGO_EN_Msk 0x800UL
#define USB32DEV_LNK_ERROR_CONF_CREDIT_ADV_TIMEOUT_EN_Pos 12UL
#define USB32DEV_LNK_ERROR_CONF_CREDIT_ADV_TIMEOUT_EN_Msk 0x1000UL
#define USB32DEV_LNK_ERROR_CONF_CREDIT_ADV_HP_EN_Pos 13UL
#define USB32DEV_LNK_ERROR_CONF_CREDIT_ADV_HP_EN_Msk 0x2000UL
#define USB32DEV_LNK_ERROR_CONF_CREDIT_ADV_LGO_EN_Pos 14UL
#define USB32DEV_LNK_ERROR_CONF_CREDIT_ADV_LGO_EN_Msk 0x4000UL
/* USB32DEV_LNK.LNK_ERROR_STATUS */
#define USB32DEV_LNK_ERROR_STATUS_HP_TIMEOUT_EV_Pos 0UL
#define USB32DEV_LNK_ERROR_STATUS_HP_TIMEOUT_EV_Msk 0x1UL
#define USB32DEV_LNK_ERROR_STATUS_RX_SEQ_NUM_ERR_EV_Pos 1UL
#define USB32DEV_LNK_ERROR_STATUS_RX_SEQ_NUM_ERR_EV_Msk 0x2UL
#define USB32DEV_LNK_ERROR_STATUS_RX_HP_FAIL_EV_Pos 2UL
#define USB32DEV_LNK_ERROR_STATUS_RX_HP_FAIL_EV_Msk 0x4UL
#define USB32DEV_LNK_ERROR_STATUS_MISSING_LGOOD_EV_Pos 3UL
#define USB32DEV_LNK_ERROR_STATUS_MISSING_LGOOD_EV_Msk 0x8UL
#define USB32DEV_LNK_ERROR_STATUS_MISSING_LCRD_EV_Pos 4UL
#define USB32DEV_LNK_ERROR_STATUS_MISSING_LCRD_EV_Msk 0x10UL
#define USB32DEV_LNK_ERROR_STATUS_CREDIT_HP_TIMEOUT_EV_Pos 5UL
#define USB32DEV_LNK_ERROR_STATUS_CREDIT_HP_TIMEOUT_EV_Msk 0x20UL
#define USB32DEV_LNK_ERROR_STATUS_PM_LC_TIMEOUT_EV_Pos 6UL
#define USB32DEV_LNK_ERROR_STATUS_PM_LC_TIMEOUT_EV_Msk 0x40UL
#define USB32DEV_LNK_ERROR_STATUS_TX_SEQ_NUM_ERR_EV_Pos 7UL
#define USB32DEV_LNK_ERROR_STATUS_TX_SEQ_NUM_ERR_EV_Msk 0x80UL
#define USB32DEV_LNK_ERROR_STATUS_HDR_ADV_TIMEOUT_EV_Pos 8UL
#define USB32DEV_LNK_ERROR_STATUS_HDR_ADV_TIMEOUT_EV_Msk 0x100UL
#define USB32DEV_LNK_ERROR_STATUS_HDR_ADV_HP_EV_Pos 9UL
#define USB32DEV_LNK_ERROR_STATUS_HDR_ADV_HP_EV_Msk 0x200UL
#define USB32DEV_LNK_ERROR_STATUS_HDR_ADV_LCRD_EV_Pos 10UL
#define USB32DEV_LNK_ERROR_STATUS_HDR_ADV_LCRD_EV_Msk 0x400UL
#define USB32DEV_LNK_ERROR_STATUS_HDR_ADV_LGO_EV_Pos 11UL
#define USB32DEV_LNK_ERROR_STATUS_HDR_ADV_LGO_EV_Msk 0x800UL
#define USB32DEV_LNK_ERROR_STATUS_CREDIT_ADV_TIMEOUT_EV_Pos 12UL
#define USB32DEV_LNK_ERROR_STATUS_CREDIT_ADV_TIMEOUT_EV_Msk 0x1000UL
#define USB32DEV_LNK_ERROR_STATUS_CREDIT_ADV_HP_EV_Pos 13UL
#define USB32DEV_LNK_ERROR_STATUS_CREDIT_ADV_HP_EV_Msk 0x2000UL
#define USB32DEV_LNK_ERROR_STATUS_CREDIT_ADV_LGO_EV_Pos 14UL
#define USB32DEV_LNK_ERROR_STATUS_CREDIT_ADV_LGO_EV_Msk 0x4000UL
/* USB32DEV_LNK.LNK_ERROR_COUNT */
#define USB32DEV_LNK_ERROR_COUNT_LINK_ERROR_COUNT_Pos 0UL
#define USB32DEV_LNK_ERROR_COUNT_LINK_ERROR_COUNT_Msk 0xFFFFUL
#define USB32DEV_LNK_ERROR_COUNT_PHY_ERROR_COUNT_Pos 16UL
#define USB32DEV_LNK_ERROR_COUNT_PHY_ERROR_COUNT_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_ERROR_COUNT_THRESHOLD */
#define USB32DEV_LNK_ERROR_COUNT_THRESHOLD_LINK_ERROR_THRESHOLD_Pos 0UL
#define USB32DEV_LNK_ERROR_COUNT_THRESHOLD_LINK_ERROR_THRESHOLD_Msk 0xFFFFUL
#define USB32DEV_LNK_ERROR_COUNT_THRESHOLD_PHY_ERROR_THRESHOLD_Pos 16UL
#define USB32DEV_LNK_ERROR_COUNT_THRESHOLD_PHY_ERROR_THRESHOLD_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_PHY_CONF */
#define USB32DEV_LNK_PHY_CONF_PHY_MODE_Pos 0UL
#define USB32DEV_LNK_PHY_CONF_PHY_MODE_Msk 0x3UL
#define USB32DEV_LNK_PHY_CONF_ELASTICIY_BUFFER_MODE_Pos 2UL
#define USB32DEV_LNK_PHY_CONF_ELASTICIY_BUFFER_MODE_Msk 0x4UL
#define USB32DEV_LNK_PHY_CONF_TXDETECTRX_LB_OVR_Pos 3UL
#define USB32DEV_LNK_PHY_CONF_TXDETECTRX_LB_OVR_Msk 0x8UL
#define USB32DEV_LNK_PHY_CONF_TXDETECTRX_LB_OVR_VAL_Pos 4UL
#define USB32DEV_LNK_PHY_CONF_TXDETECTRX_LB_OVR_VAL_Msk 0x10UL
#define USB32DEV_LNK_PHY_CONF_TXELECIDLE_OVR_Pos 5UL
#define USB32DEV_LNK_PHY_CONF_TXELECIDLE_OVR_Msk 0x20UL
#define USB32DEV_LNK_PHY_CONF_TXELECIDLE_OVR_VAL_Pos 6UL
#define USB32DEV_LNK_PHY_CONF_TXELECIDLE_OVR_VAL_Msk 0x40UL
#define USB32DEV_LNK_PHY_CONF_TXCOMPLIANCE_OVR_Pos 7UL
#define USB32DEV_LNK_PHY_CONF_TXCOMPLIANCE_OVR_Msk 0x80UL
#define USB32DEV_LNK_PHY_CONF_TXCOMPLIANCE_OVR_VAL_Pos 8UL
#define USB32DEV_LNK_PHY_CONF_TXCOMPLIANCE_OVR_VAL_Msk 0x100UL
#define USB32DEV_LNK_PHY_CONF_TXONESZEROS_OVR_Pos 9UL
#define USB32DEV_LNK_PHY_CONF_TXONESZEROS_OVR_Msk 0x200UL
#define USB32DEV_LNK_PHY_CONF_TXONESZEROS_OVR_VAL_Pos 10UL
#define USB32DEV_LNK_PHY_CONF_TXONESZEROS_OVR_VAL_Msk 0x400UL
#define USB32DEV_LNK_PHY_CONF_RXPOLARITY_OVR_Pos 11UL
#define USB32DEV_LNK_PHY_CONF_RXPOLARITY_OVR_Msk 0x800UL
#define USB32DEV_LNK_PHY_CONF_RXPOLARITY_OVR_VAL_Pos 12UL
#define USB32DEV_LNK_PHY_CONF_RXPOLARITY_OVR_VAL_Msk 0x1000UL
#define USB32DEV_LNK_PHY_CONF_RXEQ_TRAINING_OVR_Pos 13UL
#define USB32DEV_LNK_PHY_CONF_RXEQ_TRAINING_OVR_Msk 0x2000UL
#define USB32DEV_LNK_PHY_CONF_RXEQ_TRAINING_OVR_VAL_Pos 14UL
#define USB32DEV_LNK_PHY_CONF_RXEQ_TRAINING_OVR_VAL_Msk 0x4000UL
#define USB32DEV_LNK_PHY_CONF_PHY_RESET_N_OVR_Pos 15UL
#define USB32DEV_LNK_PHY_CONF_PHY_RESET_N_OVR_Msk 0x8000UL
#define USB32DEV_LNK_PHY_CONF_PHY_RESET_N_OVR_VAL_Pos 16UL
#define USB32DEV_LNK_PHY_CONF_PHY_RESET_N_OVR_VAL_Msk 0x10000UL
#define USB32DEV_LNK_PHY_CONF_PHY_POWERDOWN_OVR_Pos 17UL
#define USB32DEV_LNK_PHY_CONF_PHY_POWERDOWN_OVR_Msk 0x20000UL
#define USB32DEV_LNK_PHY_CONF_PHY_POWERDOWN_OVR_VAL_Pos 18UL
#define USB32DEV_LNK_PHY_CONF_PHY_POWERDOWN_OVR_VAL_Msk 0xC0000UL
#define USB32DEV_LNK_PHY_CONF_PHY_RATE_OVR_Pos 20UL
#define USB32DEV_LNK_PHY_CONF_PHY_RATE_OVR_Msk 0x100000UL
#define USB32DEV_LNK_PHY_CONF_PHY_RATE_OVR_VAL_Pos 21UL
#define USB32DEV_LNK_PHY_CONF_PHY_RATE_OVR_VAL_Msk 0x200000UL
#define USB32DEV_LNK_PHY_CONF_PHY_TX_DEEMPH_OVR_Pos 22UL
#define USB32DEV_LNK_PHY_CONF_PHY_TX_DEEMPH_OVR_Msk 0x400000UL
#define USB32DEV_LNK_PHY_CONF_PHY_TX_DEEMPH_OVR_VAL_Pos 23UL
#define USB32DEV_LNK_PHY_CONF_PHY_TX_DEEMPH_OVR_VAL_Msk 0x1800000UL
#define USB32DEV_LNK_PHY_CONF_PHY_TX_MARGIN_Pos 25UL
#define USB32DEV_LNK_PHY_CONF_PHY_TX_MARGIN_Msk 0xE000000UL
#define USB32DEV_LNK_PHY_CONF_TXSWING_Pos 28UL
#define USB32DEV_LNK_PHY_CONF_TXSWING_Msk 0x10000000UL
#define USB32DEV_LNK_PHY_CONF_RX_TERMINATION_OVR_Pos 29UL
#define USB32DEV_LNK_PHY_CONF_RX_TERMINATION_OVR_Msk 0x20000000UL
#define USB32DEV_LNK_PHY_CONF_RX_TERMINATION_OVR_VAL_Pos 30UL
#define USB32DEV_LNK_PHY_CONF_RX_TERMINATION_OVR_VAL_Msk 0x40000000UL
#define USB32DEV_LNK_PHY_CONF_RX_TERMINATION_ENABLE_Pos 31UL
#define USB32DEV_LNK_PHY_CONF_RX_TERMINATION_ENABLE_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_PHY_STATUS */
#define USB32DEV_LNK_PHY_STATUS_RXVALID_Pos 0UL
#define USB32DEV_LNK_PHY_STATUS_RXVALID_Msk 0x1UL
#define USB32DEV_LNK_PHY_STATUS_PHY_STATUS_Pos 1UL
#define USB32DEV_LNK_PHY_STATUS_PHY_STATUS_Msk 0x2UL
#define USB32DEV_LNK_PHY_STATUS_RX_ELEC_IDLE_Pos 2UL
#define USB32DEV_LNK_PHY_STATUS_RX_ELEC_IDLE_Msk 0x4UL
#define USB32DEV_LNK_PHY_STATUS_RXSTATUS_Pos 3UL
#define USB32DEV_LNK_PHY_STATUS_RXSTATUS_Msk 0x38UL
#define USB32DEV_LNK_PHY_STATUS_POWER_PRESENT_Pos 6UL
#define USB32DEV_LNK_PHY_STATUS_POWER_PRESENT_Msk 0x40UL
#define USB32DEV_LNK_PHY_STATUS_DATA_BUS_WIDTH_Pos 7UL
#define USB32DEV_LNK_PHY_STATUS_DATA_BUS_WIDTH_Msk 0x180UL
#define USB32DEV_LNK_PHY_STATUS_RXCONNECT_Pos 9UL
#define USB32DEV_LNK_PHY_STATUS_RXCONNECT_Msk 0x200UL
/* USB32DEV_LNK.LNK_PHY_ERROR_CONF */
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_ERROR_DECODE_EN_Pos 0UL
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_ERROR_DECODE_EN_Msk 0x1UL
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_ERROR_EB_OVR_EN_Pos 1UL
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_ERROR_EB_OVR_EN_Msk 0x2UL
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_ERROR_EB_UND_EN_Pos 2UL
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_ERROR_EB_UND_EN_Msk 0x4UL
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_ERROR_DISPARITY_EN_Pos 3UL
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_ERROR_DISPARITY_EN_Msk 0x8UL
#define USB32DEV_LNK_PHY_ERROR_CONF_RX_ERROR_CRC5_EN_Pos 4UL
#define USB32DEV_LNK_PHY_ERROR_CONF_RX_ERROR_CRC5_EN_Msk 0x10UL
#define USB32DEV_LNK_PHY_ERROR_CONF_RX_ERROR_CRC16_EN_Pos 5UL
#define USB32DEV_LNK_PHY_ERROR_CONF_RX_ERROR_CRC16_EN_Msk 0x20UL
#define USB32DEV_LNK_PHY_ERROR_CONF_RX_ERROR_CRC32_EN_Pos 6UL
#define USB32DEV_LNK_PHY_ERROR_CONF_RX_ERROR_CRC32_EN_Msk 0x40UL
#define USB32DEV_LNK_PHY_ERROR_CONF_TRAINING_ERROR_EN_Pos 7UL
#define USB32DEV_LNK_PHY_ERROR_CONF_TRAINING_ERROR_EN_Msk 0x80UL
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_LOCK_EN_Pos 8UL
#define USB32DEV_LNK_PHY_ERROR_CONF_PHY_LOCK_EN_Msk 0x100UL
/* USB32DEV_LNK.LNK_PHY_ERROR_STATUS */
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_ERROR_DECODE_EV_Pos 0UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_ERROR_DECODE_EV_Msk 0x1UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_ERROR_EB_OVR_EV_Pos 1UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_ERROR_EB_OVR_EV_Msk 0x2UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_ERROR_EB_UND_EV_Pos 2UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_ERROR_EB_UND_EV_Msk 0x4UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_ERROR_DISPARITY_EV_Pos 3UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_ERROR_DISPARITY_EV_Msk 0x8UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_RX_ERROR_CRC5_EV_Pos 4UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_RX_ERROR_CRC5_EV_Msk 0x10UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_RX_ERROR_CRC16_EV_Pos 5UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_RX_ERROR_CRC16_EV_Msk 0x20UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_RX_ERROR_CRC32_EV_Pos 6UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_RX_ERROR_CRC32_EV_Msk 0x40UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_TRAINING_ERROR_EV_Pos 7UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_TRAINING_ERROR_EV_Msk 0x80UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_LOCK_EV_Pos 8UL
#define USB32DEV_LNK_PHY_ERROR_STATUS_PHY_LOCK_EV_Msk 0x100UL
/* USB32DEV_LNK.LNK_PHY_TRAINING_HOLDOFF */
#define USB32DEV_LNK_PHY_TRAINING_HOLDOFF_GEN1_HOLDOFF_Pos 0UL
#define USB32DEV_LNK_PHY_TRAINING_HOLDOFF_GEN1_HOLDOFF_Msk 0xFFFFUL
#define USB32DEV_LNK_PHY_TRAINING_HOLDOFF_GEN2_HOLDOFF_Pos 16UL
#define USB32DEV_LNK_PHY_TRAINING_HOLDOFF_GEN2_HOLDOFF_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_COMMAND_WORD */
#define USB32DEV_LNK_COMMAND_WORD_COMMAND_Pos 0UL
#define USB32DEV_LNK_COMMAND_WORD_COMMAND_Msk 0x7FFUL
/* USB32DEV_LNK.LNK_DEVICE_POWER_CONTROL */
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_U1_Pos 0UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_U1_Msk 0x1UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_U2_Pos 1UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_U2_Msk 0x2UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_U3_Pos 2UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_U3_Msk 0x4UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_RX_U1_Pos 4UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_RX_U1_Msk 0x10UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_RX_U2_Pos 5UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_RX_U2_Msk 0x20UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_RX_U3_Pos 6UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_RX_U3_Msk 0x40UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_LAU_Pos 7UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_LAU_Msk 0x80UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_LXU_Pos 8UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_TX_LXU_Msk 0x100UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_EXIT_LP_Pos 9UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_EXIT_LP_Msk 0x200UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_U3_EXIT_ON_HOLD_Pos 16UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_U3_EXIT_ON_HOLD_Msk 0x10000UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_U3_EXIT_ON_HOLD_EN_Pos 17UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_U3_EXIT_ON_HOLD_EN_Msk 0x20000UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_AUTO_U1_Pos 26UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_AUTO_U1_Msk 0x4000000UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_AUTO_U2_Pos 27UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_AUTO_U2_Msk 0x8000000UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_NO_U1_Pos 28UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_NO_U1_Msk 0x10000000UL
