RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_NO_U2_Pos 29UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_NO_U2_Msk 0x20000000UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_YES_U1_Pos 30UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_YES_U1_Msk 0x40000000UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_YES_U2_Pos 31UL
#define USB32DEV_LNK_DEVICE_POWER_CONTROL_YES_U2_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_LTSSM_STATE */
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_STATE_Pos 0UL
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_STATE_Msk 0x3FUL
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_OVERRIDE_VALUE_Pos 6UL
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_OVERRIDE_VALUE_Msk 0xFC0UL
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_OVERRIDE_EN_Pos 12UL
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_OVERRIDE_EN_Msk 0x1000UL
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_OVERRIDE_GO_Pos 13UL
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_OVERRIDE_GO_Msk 0x2000UL
#define USB32DEV_LNK_LTSSM_STATE_LOOPBACK_MASTER_Pos 14UL
#define USB32DEV_LNK_LTSSM_STATE_LOOPBACK_MASTER_Msk 0x4000UL
#define USB32DEV_LNK_LTSSM_STATE_DISABLE_SCRAMBLING_Pos 15UL
#define USB32DEV_LNK_LTSSM_STATE_DISABLE_SCRAMBLING_Msk 0x8000UL
#define USB32DEV_LNK_LTSSM_STATE_LOOPBACK_ERROR_Pos 16UL
#define USB32DEV_LNK_LTSSM_STATE_LOOPBACK_ERROR_Msk 0x10000UL
#define USB32DEV_LNK_LTSSM_STATE_LOOPBACK_GOOD_Pos 17UL
#define USB32DEV_LNK_LTSSM_STATE_LOOPBACK_GOOD_Msk 0x20000UL
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_FREEZE_Pos 31UL
#define USB32DEV_LNK_LTSSM_STATE_LTSSM_FREEZE_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_LOOPBACK_INIT */
#define USB32DEV_LNK_LOOPBACK_INIT_INIT_Pos 0UL
#define USB32DEV_LNK_LOOPBACK_INIT_INIT_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LOOPBACK_GENERATOR */
#define USB32DEV_LNK_LOOPBACK_GENERATOR_GENERATOR_Pos 0UL
#define USB32DEV_LNK_LOOPBACK_GENERATOR_GENERATOR_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_OBSERVE */
#define USB32DEV_LNK_LTSSM_OBSERVE_RX_DETECT_MISS_CNT_Pos 0UL
#define USB32DEV_LNK_LTSSM_OBSERVE_RX_DETECT_MISS_CNT_Msk 0xFUL
#define USB32DEV_LNK_LTSSM_OBSERVE_RX_DETECT_MISS_LIMIT_Pos 4UL
#define USB32DEV_LNK_LTSSM_OBSERVE_RX_DETECT_MISS_LIMIT_Msk 0xF0UL
#define USB32DEV_LNK_LTSSM_OBSERVE_RECOVERY_CNT_Pos 8UL
#define USB32DEV_LNK_LTSSM_OBSERVE_RECOVERY_CNT_Msk 0xF00UL
#define USB32DEV_LNK_LTSSM_OBSERVE_RECOVERY_LIMIT_Pos 12UL
#define USB32DEV_LNK_LTSSM_OBSERVE_RECOVERY_LIMIT_Msk 0xF000UL
#define USB32DEV_LNK_LTSSM_OBSERVE_TS1_RCVD_CNT_Pos 16UL
#define USB32DEV_LNK_LTSSM_OBSERVE_TS1_RCVD_CNT_Msk 0xF0000UL
#define USB32DEV_LNK_LTSSM_OBSERVE_TS2_RCVD_CNT_Pos 20UL
#define USB32DEV_LNK_LTSSM_OBSERVE_TS2_RCVD_CNT_Msk 0xF00000UL
#define USB32DEV_LNK_LTSSM_OBSERVE_IDLE_RCVD_CNT_Pos 24UL
#define USB32DEV_LNK_LTSSM_OBSERVE_IDLE_RCVD_CNT_Msk 0xF000000UL
#define USB32DEV_LNK_LTSSM_OBSERVE_POLLING_LFPS_COMPLETED_Pos 28UL
#define USB32DEV_LNK_LTSSM_OBSERVE_POLLING_LFPS_COMPLETED_Msk 0x10000000UL
#define USB32DEV_LNK_LTSSM_OBSERVE_RX_DISABLE_SCRAMBLING_Pos 29UL
#define USB32DEV_LNK_LTSSM_OBSERVE_RX_DISABLE_SCRAMBLING_Msk 0x20000000UL
#define USB32DEV_LNK_LTSSM_OBSERVE_DATA_RATE_CONFIG_Pos 30UL
#define USB32DEV_LNK_LTSSM_OBSERVE_DATA_RATE_CONFIG_Msk 0xC0000000UL
/* USB32DEV_LNK.LNK_LFPS_OBSERVE */
#define USB32DEV_LNK_LFPS_OBSERVE_POLLING_DET_Pos 0UL
#define USB32DEV_LNK_LFPS_OBSERVE_POLLING_DET_Msk 0x1UL
#define USB32DEV_LNK_LFPS_OBSERVE_PING_DET_Pos 1UL
#define USB32DEV_LNK_LFPS_OBSERVE_PING_DET_Msk 0x2UL
#define USB32DEV_LNK_LFPS_OBSERVE_RESET_DET_Pos 2UL
#define USB32DEV_LNK_LFPS_OBSERVE_RESET_DET_Msk 0x4UL
#define USB32DEV_LNK_LFPS_OBSERVE_U1_EXIT_DET_Pos 3UL
#define USB32DEV_LNK_LFPS_OBSERVE_U1_EXIT_DET_Msk 0x8UL
#define USB32DEV_LNK_LFPS_OBSERVE_U2_EXIT_DET_Pos 4UL
#define USB32DEV_LNK_LFPS_OBSERVE_U2_EXIT_DET_Msk 0x10UL
#define USB32DEV_LNK_LFPS_OBSERVE_U3_EXIT_DET_Pos 5UL
#define USB32DEV_LNK_LFPS_OBSERVE_U3_EXIT_DET_Msk 0x20UL
#define USB32DEV_LNK_LFPS_OBSERVE_LOOPBACK_DET_Pos 6UL
#define USB32DEV_LNK_LFPS_OBSERVE_LOOPBACK_DET_Msk 0x40UL
#define USB32DEV_LNK_LFPS_OBSERVE_SCD1_DET_Pos 7UL
#define USB32DEV_LNK_LFPS_OBSERVE_SCD1_DET_Msk 0x80UL
#define USB32DEV_LNK_LFPS_OBSERVE_SCD2_DET_Pos 8UL
#define USB32DEV_LNK_LFPS_OBSERVE_SCD2_DET_Msk 0x100UL
#define USB32DEV_LNK_LFPS_OBSERVE_PHY_CAP_LBPM_10G_DET_Pos 9UL
#define USB32DEV_LNK_LFPS_OBSERVE_PHY_CAP_LBPM_10G_DET_Msk 0x200UL
#define USB32DEV_LNK_LFPS_OBSERVE_PHY_CAP_LBPM_5G_DET_Pos 10UL
#define USB32DEV_LNK_LFPS_OBSERVE_PHY_CAP_LBPM_5G_DET_Msk 0x400UL
#define USB32DEV_LNK_LFPS_OBSERVE_PHY_READY_LBPM_DET_Pos 11UL
#define USB32DEV_LNK_LFPS_OBSERVE_PHY_READY_LBPM_DET_Msk 0x800UL
#define USB32DEV_LNK_LFPS_OBSERVE_POLLING_LFPS_RCVD_Pos 16UL
#define USB32DEV_LNK_LFPS_OBSERVE_POLLING_LFPS_RCVD_Msk 0x1F0000UL
#define USB32DEV_LNK_LFPS_OBSERVE_POLLING_LFPS_SENT_Pos 21UL
#define USB32DEV_LNK_LFPS_OBSERVE_POLLING_LFPS_SENT_Msk 0x3E00000UL
/* USB32DEV_LNK.LNK_LFPS_TX_POLLING_BURST */
#define USB32DEV_LNK_LFPS_TX_POLLING_BURST_BURST16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_POLLING_BURST_BURST16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_POLLING_REPEAT */
#define USB32DEV_LNK_LFPS_TX_POLLING_REPEAT_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_POLLING_REPEAT_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_PING_BURST */
#define USB32DEV_LNK_LFPS_TX_PING_BURST_BURST16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_PING_BURST_BURST16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_PING_REPEAT */
#define USB32DEV_LNK_LFPS_TX_PING_REPEAT_REPEAT32_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_PING_REPEAT_REPEAT32_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_U1_EXIT */
#define USB32DEV_LNK_LFPS_TX_U1_EXIT_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_U1_EXIT_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_U2_EXIT */
#define USB32DEV_LNK_LFPS_TX_U2_EXIT_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_U2_EXIT_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_U3_EXIT */
#define USB32DEV_LNK_LFPS_TX_U3_EXIT_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_U3_EXIT_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_POLLING_BURST */
#define USB32DEV_LNK_LFPS_RX_POLLING_BURST_BURST_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_POLLING_BURST_BURST_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_POLLING_BURST_BURST_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_POLLING_BURST_BURST_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_POLLING_REPEAT */
#define USB32DEV_LNK_LFPS_RX_POLLING_REPEAT_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_POLLING_REPEAT_REPEAT_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_POLLING_REPEAT_REPEAT_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_POLLING_REPEAT_REPEAT_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_PING */
#define USB32DEV_LNK_LFPS_RX_PING_BURST_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_PING_BURST_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_PING_BURST_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_PING_BURST_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_RESET */
#define USB32DEV_LNK_LFPS_RX_RESET_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_RESET_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U1_EXIT */
#define USB32DEV_LNK_LFPS_RX_U1_EXIT_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U1_EXIT_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U2_EXIT */
#define USB32DEV_LNK_LFPS_RX_U2_EXIT_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U2_EXIT_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U3_EXIT */
#define USB32DEV_LNK_LFPS_RX_U3_EXIT_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U3_EXIT_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U1_HANDSHAKE */
#define USB32DEV_LNK_LFPS_RX_U1_HANDSHAKE_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U1_HANDSHAKE_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U2_HANDSHAKE */
#define USB32DEV_LNK_LFPS_RX_U2_HANDSHAKE_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U2_HANDSHAKE_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U3_HANDSHAKE */
#define USB32DEV_LNK_LFPS_RX_U3_HANDSHAKE_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U3_HANDSHAKE_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_LOOPBACK_EXIT */
#define USB32DEV_LNK_LFPS_RX_LOOPBACK_EXIT_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LOOPBACK_EXIT_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_LOOPBACK_HANDSHAKE */
#define USB32DEV_LNK_LFPS_RX_LOOPBACK_HANDSHAKE_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LOOPBACK_HANDSHAKE_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_IDLE */
#define USB32DEV_LNK_LFPS_RX_IDLE_TIME_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_IDLE_TIME_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_BURST */
#define USB32DEV_LNK_LFPS_RX_BURST_TIME_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_BURST_TIME_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_TIME */
#define USB32DEV_LNK_LFPS_RX_TIME_TIME_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_TIME_TIME_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_PENDING_HP_TIMER */
#define USB32DEV_LNK_PENDING_HP_TIMER_TIMER16_Pos 0UL
#define USB32DEV_LNK_PENDING_HP_TIMER_TIMER16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_PENDING_HP_TIMEOUT */
#define USB32DEV_LNK_PENDING_HP_TIMEOUT_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PENDING_HP_TIMEOUT_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_CREDIT_HP_TIMER */
#define USB32DEV_LNK_CREDIT_HP_TIMER_TIMER_Pos 0UL
#define USB32DEV_LNK_CREDIT_HP_TIMER_TIMER_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_CREDIT_HP_TIMEOUT */
#define USB32DEV_LNK_CREDIT_HP_TIMEOUT_TIMEOUT_Pos 0UL
#define USB32DEV_LNK_CREDIT_HP_TIMEOUT_TIMEOUT_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_PM_TIMER */
#define USB32DEV_LNK_PM_TIMER_TIMER_Pos 0UL
#define USB32DEV_LNK_PM_TIMER_TIMER_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_PM_LC_TIMEOUT */
#define USB32DEV_LNK_PM_LC_TIMEOUT_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PM_LC_TIMEOUT_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_PM_ENTRY_TIMEOUT */
#define USB32DEV_LNK_PM_ENTRY_TIMEOUT_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PM_ENTRY_TIMEOUT_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_PM_UX_EXIT_TIMEOUT */
#define USB32DEV_LNK_PM_UX_EXIT_TIMEOUT_TIMEOUT_Pos 0UL
#define USB32DEV_LNK_PM_UX_EXIT_TIMEOUT_TIMEOUT_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_TIMER */
#define USB32DEV_LNK_LTSSM_TIMER_TIMER_Pos 0UL
#define USB32DEV_LNK_LTSSM_TIMER_TIMER_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_TIMEOUT */
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_LFPS_Pos 0UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_LFPS_Msk 0x1UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_ACTIVE_Pos 1UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_ACTIVE_Msk 0x2UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_IDLE_Pos 2UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_IDLE_Msk 0x4UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_U1_EXIT_Pos 3UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_U1_EXIT_Msk 0x8UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_U2_EXIT_Pos 4UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_U2_EXIT_Msk 0x10UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_U3_EXIT_Pos 5UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_U3_EXIT_Msk 0x20UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_HOT_RESET_ACTIVE_Pos 6UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_HOT_RESET_ACTIVE_Msk 0x40UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_HOT_RESET_EXIT_Pos 7UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_HOT_RESET_EXIT_Msk 0x80UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_LOOPBACK_EXIT_Pos 8UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_LOOPBACK_EXIT_Msk 0x100UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_RECOVERY_IDLE_Pos 9UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_RECOVERY_IDLE_Msk 0x200UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_RECOVERY_ACTIVE_Pos 10UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_RECOVERY_ACTIVE_Msk 0x400UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_RECOVERY_CONFIG_Pos 11UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_RECOVERY_CONFIG_Msk 0x800UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_SCD_LFPS_Pos 12UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_SCD_LFPS_Msk 0x1000UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_LBPM_LFPS_Pos 13UL
#define USB32DEV_LNK_LTSSM_TIMEOUT_POLLING_LBPM_LFPS_Msk 0x2000UL
/* USB32DEV_LNK.LNK_LTSSM_RX_DETECT_PERIOD */
#define USB32DEV_LNK_LTSSM_RX_DETECT_PERIOD_PERIOD24_Pos 0UL
#define USB32DEV_LNK_LTSSM_RX_DETECT_PERIOD_PERIOD24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_LUP_PERIOD */
#define USB32DEV_LNK_LTSSM_LUP_PERIOD_PERIOD24_Pos 0UL
#define USB32DEV_LNK_LTSSM_LUP_PERIOD_PERIOD24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_SS_INACTIVE_PERIOD */
#define USB32DEV_LNK_LTSSM_SS_INACTIVE_PERIOD_PERIOD24_Pos 0UL
#define USB32DEV_LNK_LTSSM_SS_INACTIVE_PERIOD_PERIOD24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_POLLING_LFPS_TIMEOUT */
#define USB32DEV_LNK_LTSSM_POLLING_LFPS_TIMEOUT_TIMEOUT_Pos 0UL
#define USB32DEV_LNK_LTSSM_POLLING_LFPS_TIMEOUT_TIMEOUT_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_POLLING_ACTIVE_TIMEOUT */
#define USB32DEV_LNK_LTSSM_POLLING_ACTIVE_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_POLLING_ACTIVE_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_POLLING_CONFIG_TIMEOUT */
#define USB32DEV_LNK_LTSSM_POLLING_CONFIG_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_POLLING_CONFIG_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_POLLING_IDLE_TIMEOUT */
#define USB32DEV_LNK_LTSSM_POLLING_IDLE_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_POLLING_IDLE_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_U1_EXIT_TIMEOUT */
#define USB32DEV_LNK_LTSSM_U1_EXIT_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_U1_EXIT_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_U2_EXIT_TIMEOUT */
#define USB32DEV_LNK_LTSSM_U2_EXIT_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_U2_EXIT_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_U3_EXIT_TIMEOUT */
#define USB32DEV_LNK_LTSSM_U3_EXIT_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_U3_EXIT_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_HOT_RESET_ACTIVE_TIMEOUT */
#define USB32DEV_LNK_LTSSM_HOT_RESET_ACTIVE_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_HOT_RESET_ACTIVE_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_HOT_RESET_EXIT_TIMEOUT */
#define USB32DEV_LNK_LTSSM_HOT_RESET_EXIT_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_HOT_RESET_EXIT_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_LOOPBACK_EXIT_TIMEOUT */
#define USB32DEV_LNK_LTSSM_LOOPBACK_EXIT_TIMEOUT_TIMEOUT_Pos 0UL
#define USB32DEV_LNK_LTSSM_LOOPBACK_EXIT_TIMEOUT_TIMEOUT_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_RECOVERY_IDLE_TIMEOUT */
#define USB32DEV_LNK_LTSSM_RECOVERY_IDLE_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_RECOVERY_IDLE_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_RECOVERY_ACTIVE_TIMEOUT */
#define USB32DEV_LNK_LTSSM_RECOVERY_ACTIVE_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_RECOVERY_ACTIVE_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_RECOVERY_CONFIG_TIMEOUT */
#define USB32DEV_LNK_LTSSM_RECOVERY_CONFIG_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_RECOVERY_CONFIG_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_LDN_TIMEOUT */
#define USB32DEV_LNK_LTSSM_LDN_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_LDN_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_LDN_TIMER */
#define USB32DEV_LNK_LTSSM_LDN_TIMER_TIMER24_Pos 0UL
#define USB32DEV_LNK_LTSSM_LDN_TIMER_TIMER24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_0 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_CP_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_CP_Msk 0xFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_K_D_Pos 8UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_K_D_Msk 0x100UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_SCRAMBLED_Pos 9UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_SCRAMBLED_Msk 0x200UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_DEEMPHASIS_Pos 10UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_DEEMPHASIS_Msk 0x400UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_LFPS_Pos 11UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_LFPS_Msk 0x800UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_TXONESZEROS_Pos 12UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_0_TXONESZEROS_Msk 0x1000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_1 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_CP_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_CP_Msk 0xFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_K_D_Pos 8UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_K_D_Msk 0x100UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_SCRAMBLED_Pos 9UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_SCRAMBLED_Msk 0x200UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_DEEMPHASIS_Pos 10UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_DEEMPHASIS_Msk 0x400UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_LFPS_Pos 11UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_LFPS_Msk 0x800UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_TXONESZEROS_Pos 12UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_1_TXONESZEROS_Msk 0x1000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_2 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_CP_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_CP_Msk 0xFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_K_D_Pos 8UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_K_D_Msk 0x100UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_SCRAMBLED_Pos 9UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_SCRAMBLED_Msk 0x200UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_DEEMPHASIS_Pos 10UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_DEEMPHASIS_Msk 0x400UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_LFPS_Pos 11UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_LFPS_Msk 0x800UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_TXONESZEROS_Pos 12UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_2_TXONESZEROS_Msk 0x1000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_3 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_CP_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_CP_Msk 0xFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_K_D_Pos 8UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_K_D_Msk 0x100UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_SCRAMBLED_Pos 9UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_SCRAMBLED_Msk 0x200UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_DEEMPHASIS_Pos 10UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_DEEMPHASIS_Msk 0x400UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_LFPS_Pos 11UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_LFPS_Msk 0x800UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_TXONESZEROS_Pos 12UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_3_TXONESZEROS_Msk 0x1000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_4 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_CP_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_CP_Msk 0xFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_K_D_Pos 8UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_K_D_Msk 0x100UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_SCRAMBLED_Pos 9UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_SCRAMBLED_Msk 0x200UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_DEEMPHASIS_Pos 10UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_DEEMPHASIS_Msk 0x400UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_LFPS_Pos 11UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_LFPS_Msk 0x800UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_TXONESZEROS_Pos 12UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_4_TXONESZEROS_Msk 0x1000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_5 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_CP_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_CP_Msk 0xFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_K_D_Pos 8UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_K_D_Msk 0x100UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_SCRAMBLED_Pos 9UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_SCRAMBLED_Msk 0x200UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_DEEMPHASIS_Pos 10UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_DEEMPHASIS_Msk 0x400UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_LFPS_Pos 11UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_LFPS_Msk 0x800UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_TXONESZEROS_Pos 12UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_5_TXONESZEROS_Msk 0x1000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_6 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_CP_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_CP_Msk 0xFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_K_D_Pos 8UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_K_D_Msk 0x100UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_SCRAMBLED_Pos 9UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_SCRAMBLED_Msk 0x200UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_DEEMPHASIS_Pos 10UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_DEEMPHASIS_Msk 0x400UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_LFPS_Pos 11UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_LFPS_Msk 0x800UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_TXONESZEROS_Pos 12UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_6_TXONESZEROS_Msk 0x1000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_7 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_CP_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_CP_Msk 0xFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_K_D_Pos 8UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_K_D_Msk 0x100UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_SCRAMBLED_Pos 9UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_SCRAMBLED_Msk 0x200UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_DEEMPHASIS_Pos 10UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_DEEMPHASIS_Msk 0x400UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_LFPS_Pos 11UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_LFPS_Msk 0x800UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_TXONESZEROS_Pos 12UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_7_TXONESZEROS_Msk 0x1000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_8 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_CP_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_CP_Msk 0xFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_K_D_Pos 8UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_K_D_Msk 0x100UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_SCRAMBLED_Pos 9UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_SCRAMBLED_Msk 0x200UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_DEEMPHASIS_Pos 10UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_DEEMPHASIS_Msk 0x400UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_LFPS_Pos 11UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_LFPS_Msk 0x800UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_TXONESZEROS_Pos 12UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_8_TXONESZEROS_Msk 0x1000UL
/* USB32DEV_LNK.LNK_DEBUG_BUFFER_CTRL */
#define USB32DEV_LNK_DEBUG_BUFFER_CTRL_MEM_PTR_Pos 0UL
#define USB32DEV_LNK_DEBUG_BUFFER_CTRL_MEM_PTR_Msk 0x7UL
/* USB32DEV_LNK.LNK_DATARATE_CHG_OBSERVE */
#define USB32DEV_LNK_DATARATE_CHG_OBSERVE_DATA_RATE_CHG_DET_Pos 0UL
#define USB32DEV_LNK_DATARATE_CHG_OBSERVE_DATA_RATE_CHG_DET_Msk 0x1FUL
/* USB32DEV_LNK.LNK_LFPS_TX_POLLING_BURST_GEN2 */
#define USB32DEV_LNK_LFPS_TX_POLLING_BURST_GEN2_BURST16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_POLLING_BURST_GEN2_BURST16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_POLLING_REPEAT_GEN2 */
#define USB32DEV_LNK_LFPS_TX_POLLING_REPEAT_GEN2_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_POLLING_REPEAT_GEN2_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_PING_BURST_GEN2 */
#define USB32DEV_LNK_LFPS_TX_PING_BURST_GEN2_BURST16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_PING_BURST_GEN2_BURST16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_PING_REPEAT_GEN2 */
#define USB32DEV_LNK_LFPS_TX_PING_REPEAT_GEN2_REPEAT32_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_PING_REPEAT_GEN2_REPEAT32_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_U1_EXIT_GEN2 */
#define USB32DEV_LNK_LFPS_TX_U1_EXIT_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_U1_EXIT_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_U2_EXIT_GEN2 */
#define USB32DEV_LNK_LFPS_TX_U2_EXIT_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_U2_EXIT_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_U3_EXIT_GEN2 */
#define USB32DEV_LNK_LFPS_TX_U3_EXIT_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_U3_EXIT_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_POLLING_BURST_GEN2 */
#define USB32DEV_LNK_LFPS_RX_POLLING_BURST_GEN2_BURST_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_POLLING_BURST_GEN2_BURST_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_POLLING_BURST_GEN2_BURST_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_POLLING_BURST_GEN2_BURST_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_POLLING_REPEAT_GEN2 */
#define USB32DEV_LNK_LFPS_RX_POLLING_REPEAT_GEN2_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_POLLING_REPEAT_GEN2_REPEAT_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_POLLING_REPEAT_GEN2_REPEAT_MAX_Pos 16UL
