RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
#define USB32DEV_LNK_LFPS_RX_POLLING_REPEAT_GEN2_REPEAT_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_PING_GEN2 */
#define USB32DEV_LNK_LFPS_RX_PING_GEN2_BURST_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_PING_GEN2_BURST_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_PING_GEN2_BURST_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_PING_GEN2_BURST_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_RESET_GEN2 */
#define USB32DEV_LNK_LFPS_RX_RESET_GEN2_BURST32_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_RESET_GEN2_BURST32_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U1_EXIT_GEN2 */
#define USB32DEV_LNK_LFPS_RX_U1_EXIT_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U1_EXIT_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U2_EXIT_GEN2 */
#define USB32DEV_LNK_LFPS_RX_U2_EXIT_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U2_EXIT_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U1_HANDSHAKE_GEN2 */
#define USB32DEV_LNK_LFPS_RX_U1_HANDSHAKE_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U1_HANDSHAKE_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U2_HANDSHAKE_GEN2 */
#define USB32DEV_LNK_LFPS_RX_U2_HANDSHAKE_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U2_HANDSHAKE_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_U3_HANDSHAKE_GEN2 */
#define USB32DEV_LNK_LFPS_RX_U3_HANDSHAKE_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_U3_HANDSHAKE_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_LOOPBACK_EXIT_GEN2 */
#define USB32DEV_LNK_LFPS_RX_LOOPBACK_EXIT_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LOOPBACK_EXIT_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_LOOPBACK_HANDSHAKE_GEN2 */
#define USB32DEV_LNK_LFPS_RX_LOOPBACK_HANDSHAKE_GEN2_BURST24_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LOOPBACK_HANDSHAKE_GEN2_BURST24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_PENDING_HP_TIMEOUT_GEN2 */
#define USB32DEV_LNK_PENDING_HP_TIMEOUT_GEN2_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PENDING_HP_TIMEOUT_GEN2_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_CREDIT_HP_TIMEOUT_GEN2 */
#define USB32DEV_LNK_CREDIT_HP_TIMEOUT_GEN2_TIMEOUT_Pos 0UL
#define USB32DEV_LNK_CREDIT_HP_TIMEOUT_GEN2_TIMEOUT_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_PM_LC_X2_TIMEOUT_GEN1 */
#define USB32DEV_LNK_PM_LC_X2_TIMEOUT_GEN1_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PM_LC_X2_TIMEOUT_GEN1_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_PM_LC_X1_TIMEOUT_GEN2 */
#define USB32DEV_LNK_PM_LC_X1_TIMEOUT_GEN2_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PM_LC_X1_TIMEOUT_GEN2_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_PM_LC_X2_TIMEOUT_GEN2 */
#define USB32DEV_LNK_PM_LC_X2_TIMEOUT_GEN2_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PM_LC_X2_TIMEOUT_GEN2_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_PM_ENTRY_X2_TIMEOUT_GEN1 */
#define USB32DEV_LNK_PM_ENTRY_X2_TIMEOUT_GEN1_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PM_ENTRY_X2_TIMEOUT_GEN1_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_PM_ENTRY_X1_TIMEOUT_GEN2 */
#define USB32DEV_LNK_PM_ENTRY_X1_TIMEOUT_GEN2_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PM_ENTRY_X1_TIMEOUT_GEN2_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_PM_ENTRY_X2_TIMEOUT_GEN2 */
#define USB32DEV_LNK_PM_ENTRY_X2_TIMEOUT_GEN2_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_PM_ENTRY_X2_TIMEOUT_GEN2_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_PM_UX_EXIT_TIMEOUT_GEN2 */
#define USB32DEV_LNK_PM_UX_EXIT_TIMEOUT_GEN2_TIMEOUT_Pos 0UL
#define USB32DEV_LNK_PM_UX_EXIT_TIMEOUT_GEN2_TIMEOUT_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_U1_MIN_RESIDENCY_TIMEOUT_GEN1 */
#define USB32DEV_LNK_U1_MIN_RESIDENCY_TIMEOUT_GEN1_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_U1_MIN_RESIDENCY_TIMEOUT_GEN1_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_U1_MIN_RESIDENCY_TIMEOUT_GEN2 */
#define USB32DEV_LNK_U1_MIN_RESIDENCY_TIMEOUT_GEN2_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_U1_MIN_RESIDENCY_TIMEOUT_GEN2_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_SCD_LOGIC0_REPEAT_GEN1 */
#define USB32DEV_LNK_LFPS_TX_SCD_LOGIC0_REPEAT_GEN1_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_SCD_LOGIC0_REPEAT_GEN1_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_SCD_LOGIC1_REPEAT_GEN1 */
#define USB32DEV_LNK_LFPS_TX_SCD_LOGIC1_REPEAT_GEN1_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_SCD_LOGIC1_REPEAT_GEN1_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_SCD_END_REPEAT_GEN1 */
#define USB32DEV_LNK_LFPS_TX_SCD_END_REPEAT_GEN1_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_SCD_END_REPEAT_GEN1_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN1 */
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN1_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN1_REPEAT_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN1_REPEAT_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN1_REPEAT_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN1 */
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN1_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN1_REPEAT_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN1_REPEAT_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN1_REPEAT_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_SCD_END_REPEAT_GEN1 */
#define USB32DEV_LNK_LFPS_RX_SCD_END_REPEAT_GEN1_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_SCD_END_REPEAT_GEN1_REPEAT_MIN_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_SCD_LOGIC0_REPEAT_GEN2 */
#define USB32DEV_LNK_LFPS_TX_SCD_LOGIC0_REPEAT_GEN2_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_SCD_LOGIC0_REPEAT_GEN2_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_SCD_LOGIC1_REPEAT_GEN2 */
#define USB32DEV_LNK_LFPS_TX_SCD_LOGIC1_REPEAT_GEN2_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_SCD_LOGIC1_REPEAT_GEN2_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_SCD_END_REPEAT_GEN2 */
#define USB32DEV_LNK_LFPS_TX_SCD_END_REPEAT_GEN2_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_SCD_END_REPEAT_GEN2_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN2 */
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN2_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN2_REPEAT_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN2_REPEAT_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC0_REPEAT_GEN2_REPEAT_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN2 */
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN2_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN2_REPEAT_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN2_REPEAT_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_SCD_LOGIC1_REPEAT_GEN2_REPEAT_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_SCD_END_REPEAT_GEN2 */
#define USB32DEV_LNK_LFPS_RX_SCD_END_REPEAT_GEN2_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_SCD_END_REPEAT_GEN2_REPEAT_MIN_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_LBPS_TPWM_GEN1 */
#define USB32DEV_LNK_LFPS_TX_LBPS_TPWM_GEN1_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_LBPS_TPWM_GEN1_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_LBPS_TLFPS0_GEN1 */
#define USB32DEV_LNK_LFPS_TX_LBPS_TLFPS0_GEN1_BURST16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_LBPS_TLFPS0_GEN1_BURST16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_LBPS_TLFPS1_GEN1 */
#define USB32DEV_LNK_LFPS_TX_LBPS_TLFPS1_GEN1_BURST16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_LBPS_TLFPS1_GEN1_BURST16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_LBPS_TPWM_GEN1 */
#define USB32DEV_LNK_LFPS_RX_LBPS_TPWM_GEN1_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TPWM_GEN1_REPEAT_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_LBPS_TPWM_GEN1_REPEAT_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TPWM_GEN1_REPEAT_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_LBPS_TLFPS0_GEN1 */
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS0_GEN1_BURST_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS0_GEN1_BURST_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS0_GEN1_BURST_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS0_GEN1_BURST_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_LBPS_TLFPS1_GEN1 */
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS1_GEN1_BURST_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS1_GEN1_BURST_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS1_GEN1_BURST_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS1_GEN1_BURST_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_TX_LBPS_TPWM_GEN2 */
#define USB32DEV_LNK_LFPS_TX_LBPS_TPWM_GEN2_REPEAT16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_LBPS_TPWM_GEN2_REPEAT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_LBPS_TLFPS0_GEN2 */
#define USB32DEV_LNK_LFPS_TX_LBPS_TLFPS0_GEN2_BURST16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_LBPS_TLFPS0_GEN2_BURST16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_TX_LBPS_TLFPS1_GEN2 */
#define USB32DEV_LNK_LFPS_TX_LBPS_TLFPS1_GEN2_BURST16_Pos 0UL
#define USB32DEV_LNK_LFPS_TX_LBPS_TLFPS1_GEN2_BURST16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LFPS_RX_LBPS_TPWM_GEN2 */
#define USB32DEV_LNK_LFPS_RX_LBPS_TPWM_GEN2_REPEAT_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TPWM_GEN2_REPEAT_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_LBPS_TPWM_GEN2_REPEAT_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TPWM_GEN2_REPEAT_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_LBPS_TLFPS0_GEN2 */
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS0_GEN2_BURST_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS0_GEN2_BURST_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS0_GEN2_BURST_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS0_GEN2_BURST_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_RX_LBPS_TLFPS1_GEN2 */
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS1_GEN2_BURST_MIN_Pos 0UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS1_GEN2_BURST_MIN_Msk 0xFFFFUL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS1_GEN2_BURST_MAX_Pos 16UL
#define USB32DEV_LNK_LFPS_RX_LBPS_TLFPS1_GEN2_BURST_MAX_Msk 0xFFFF0000UL
/* USB32DEV_LNK.LNK_LFPS_SCD_PATTERN */
#define USB32DEV_LNK_LFPS_SCD_PATTERN_SCD1_PATTERN_Pos 0UL
#define USB32DEV_LNK_LFPS_SCD_PATTERN_SCD1_PATTERN_Msk 0xFUL
#define USB32DEV_LNK_LFPS_SCD_PATTERN_SCD2_PATTERN_Pos 4UL
#define USB32DEV_LNK_LFPS_SCD_PATTERN_SCD2_PATTERN_Msk 0xF0UL
/* USB32DEV_LNK.LNK_TSEQ_COUNT_GEN1 */
#define USB32DEV_LNK_TSEQ_COUNT_GEN1_COUNT24_Pos 0UL
#define USB32DEV_LNK_TSEQ_COUNT_GEN1_COUNT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_TSEQ_COUNT_GEN2 */
#define USB32DEV_LNK_TSEQ_COUNT_GEN2_COUNT24_Pos 0UL
#define USB32DEV_LNK_TSEQ_COUNT_GEN2_COUNT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_SCD1_GEN2_HSK */
#define USB32DEV_LNK_SCD1_GEN2_HSK_RX_SCDX_CNT_Pos 0UL
#define USB32DEV_LNK_SCD1_GEN2_HSK_RX_SCDX_CNT_Msk 0x7UL
#define USB32DEV_LNK_SCD1_GEN2_HSK_ARX_SCDX_LIMIT_Pos 8UL
#define USB32DEV_LNK_SCD1_GEN2_HSK_ARX_SCDX_LIMIT_Msk 0x300UL
#define USB32DEV_LNK_SCD1_GEN2_HSK_TX_ARX_SCD1_CNT_Pos 12UL
#define USB32DEV_LNK_SCD1_GEN2_HSK_TX_ARX_SCD1_CNT_Msk 0x7000UL
/* USB32DEV_LNK.LNK_SCD1_GEN2_TO_GEN1_HSK */
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_SCDXCHK_RX_LFPS_CNT_Pos 0UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_SCDXCHK_RX_LFPS_CNT_Msk 0x7FUL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_TX_SCD1_CNT_Pos 8UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_TX_SCD1_CNT_Msk 0xF00UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_RX_LFPS_CNT_Pos 12UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_RX_LFPS_CNT_Msk 0x7000UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_ARX_LFPS_LIMIT_Pos 16UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_ARX_LFPS_LIMIT_Msk 0x70000UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_TX_ARX_SCD1_CNT_Pos 20UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_TX_ARX_SCD1_CNT_Msk 0x700000UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_TX_LFPS_CNT_Pos 24UL
#define USB32DEV_LNK_SCD1_GEN2_TO_GEN1_HSK_G2G1_TX_LFPS_CNT_Msk 0x1F000000UL
/* USB32DEV_LNK.LNK_SCD1_OBSERVE */
#define USB32DEV_LNK_SCD1_OBSERVE_RCVD_SCD2_CNT_Pos 0UL
#define USB32DEV_LNK_SCD1_OBSERVE_RCVD_SCD2_CNT_Msk 0x7UL
#define USB32DEV_LNK_SCD1_OBSERVE_RCVD_SCD1_CNT_Pos 4UL
#define USB32DEV_LNK_SCD1_OBSERVE_RCVD_SCD1_CNT_Msk 0x70UL
#define USB32DEV_LNK_SCD1_OBSERVE_SENT_SCD1_CNT_G2_ARX_Pos 12UL
#define USB32DEV_LNK_SCD1_OBSERVE_SENT_SCD1_CNT_G2_ARX_Msk 0x7000UL
#define USB32DEV_LNK_SCD1_OBSERVE_SENT_SCD1_CNT_G2G1_ARX_Pos 20UL
#define USB32DEV_LNK_SCD1_OBSERVE_SENT_SCD1_CNT_G2G1_ARX_Msk 0x700000UL
#define USB32DEV_LNK_SCD1_OBSERVE_G2G1_LFPS_HSK_DONE_Pos 30UL
#define USB32DEV_LNK_SCD1_OBSERVE_G2G1_LFPS_HSK_DONE_Msk 0x40000000UL
#define USB32DEV_LNK_SCD1_OBSERVE_SCD1_HSK_DONE_Pos 31UL
#define USB32DEV_LNK_SCD1_OBSERVE_SCD1_HSK_DONE_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_SCD2_GEN2_HSK */
#define USB32DEV_LNK_SCD2_GEN2_HSK_RX_SCD2_CNT_Pos 0UL
#define USB32DEV_LNK_SCD2_GEN2_HSK_RX_SCD2_CNT_Msk 0x7UL
#define USB32DEV_LNK_SCD2_GEN2_HSK_ARX_SCD2_LIMIT_Pos 8UL
#define USB32DEV_LNK_SCD2_GEN2_HSK_ARX_SCD2_LIMIT_Msk 0x300UL
#define USB32DEV_LNK_SCD2_GEN2_HSK_TX_ARX_SCD2_CNT_Pos 12UL
#define USB32DEV_LNK_SCD2_GEN2_HSK_TX_ARX_SCD2_CNT_Msk 0x7000UL
/* USB32DEV_LNK.LNK_SCD2_GEN2_TO_GEN1_HSK */
#define USB32DEV_LNK_SCD2_GEN2_TO_GEN1_HSK_SCD2CHK_RX_LFPS_CNT_Pos 0UL
#define USB32DEV_LNK_SCD2_GEN2_TO_GEN1_HSK_SCD2CHK_RX_LFPS_CNT_Msk 0x7FUL
#define USB32DEV_LNK_SCD2_GEN2_TO_GEN1_HSK_G2G1_TX_LFPS_CNT_Pos 24UL
#define USB32DEV_LNK_SCD2_GEN2_TO_GEN1_HSK_G2G1_TX_LFPS_CNT_Msk 0x1F000000UL
/* USB32DEV_LNK.LNK_SCD2_OBSERVE */
#define USB32DEV_LNK_SCD2_OBSERVE_RCVD_SCD2_CNT_Pos 0UL
#define USB32DEV_LNK_SCD2_OBSERVE_RCVD_SCD2_CNT_Msk 0x7UL
#define USB32DEV_LNK_SCD2_OBSERVE_SENT_SCD2_CNT_G2_ARX_Pos 8UL
#define USB32DEV_LNK_SCD2_OBSERVE_SENT_SCD2_CNT_G2_ARX_Msk 0x700UL
#define USB32DEV_LNK_SCD2_OBSERVE_G2G1_LFPS_HSK_DONE_Pos 30UL
#define USB32DEV_LNK_SCD2_OBSERVE_G2G1_LFPS_HSK_DONE_Msk 0x40000000UL
#define USB32DEV_LNK_SCD2_OBSERVE_SCD2_HSK_DONE_Pos 31UL
#define USB32DEV_LNK_SCD2_OBSERVE_SCD2_HSK_DONE_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_CAP_LBPM_HSK */
#define USB32DEV_LNK_CAP_LBPM_HSK_RX_CAP_LBPM_CNT_Pos 4UL
#define USB32DEV_LNK_CAP_LBPM_HSK_RX_CAP_LBPM_CNT_Msk 0x70UL
#define USB32DEV_LNK_CAP_LBPM_HSK_ARX_LBPM_LIMIT_Pos 8UL
#define USB32DEV_LNK_CAP_LBPM_HSK_ARX_LBPM_LIMIT_Msk 0x700UL
#define USB32DEV_LNK_CAP_LBPM_HSK_TX_ARX_CAP_LBPM_CNT_Pos 12UL
#define USB32DEV_LNK_CAP_LBPM_HSK_TX_ARX_CAP_LBPM_CNT_Msk 0xF000UL
/* USB32DEV_LNK.LNK_CAP_LBPM_OBSERVE */
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_10GX1_CAP_LBPM_CNT_Pos 0UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_10GX1_CAP_LBPM_CNT_Msk 0x7UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_5GX1_CAP_LBPM_CNT_Pos 4UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_5GX1_CAP_LBPM_CNT_Msk 0x70UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_10GX2_CAP_LBPM_CNT_Pos 8UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_10GX2_CAP_LBPM_CNT_Msk 0x700UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_5GX2_CAP_LBPM_CNT_Pos 12UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_5GX2_CAP_LBPM_CNT_Msk 0x7000UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_READY_LBPM_CNT_Pos 16UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_RCVD_READY_LBPM_CNT_Msk 0x70000UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_SENT_CAP_LBPM_CNT_ARX_Pos 20UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_SENT_CAP_LBPM_CNT_ARX_Msk 0x700000UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_CAP_LBPM_HSK_DONE_Pos 31UL
#define USB32DEV_LNK_CAP_LBPM_OBSERVE_CAP_LBPM_HSK_DONE_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_READY_LBPM_HSK */
#define USB32DEV_LNK_READY_LBPM_HSK_RX_RDY_LBPM_CNT_Pos 0UL
#define USB32DEV_LNK_READY_LBPM_HSK_RX_RDY_LBPM_CNT_Msk 0x7UL
#define USB32DEV_LNK_READY_LBPM_HSK_ARX_RDY_LBPM_LIMIT_Pos 4UL
#define USB32DEV_LNK_READY_LBPM_HSK_ARX_RDY_LBPM_LIMIT_Msk 0x70UL
#define USB32DEV_LNK_READY_LBPM_HSK_TX_ARX_RDY_LBPM_CNT_Pos 8UL
#define USB32DEV_LNK_READY_LBPM_HSK_TX_ARX_RDY_LBPM_CNT_Msk 0xF00UL
#define USB32DEV_LNK_READY_LBPM_HSK_ENTRY_TO_TX_DELAY_Pos 16UL
#define USB32DEV_LNK_READY_LBPM_HSK_ENTRY_TO_TX_DELAY_Msk 0xFF0000UL
/* USB32DEV_LNK.LNK_READY_LBPM_OBSERVE */
#define USB32DEV_LNK_READY_LBPM_OBSERVE_RCVD_RDY_LBPM_CNT_Pos 0UL
#define USB32DEV_LNK_READY_LBPM_OBSERVE_RCVD_RDY_LBPM_CNT_Msk 0x7UL
#define USB32DEV_LNK_READY_LBPM_OBSERVE_SENT_RDY_LBPM_CNT_ARX_Pos 4UL
#define USB32DEV_LNK_READY_LBPM_OBSERVE_SENT_RDY_LBPM_CNT_ARX_Msk 0xF0UL
#define USB32DEV_LNK_READY_LBPM_OBSERVE_RDY_LBPM_HSK_DONE_Pos 31UL
#define USB32DEV_LNK_READY_LBPM_OBSERVE_RDY_LBPM_HSK_DONE_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_RCVD_LBPM_OBSERVE */
#define USB32DEV_LNK_RCVD_LBPM_OBSERVE_LBPM_Pos 0UL
#define USB32DEV_LNK_RCVD_LBPM_OBSERVE_LBPM_Msk 0xFFUL
/* USB32DEV_LNK.LNK_LTSSM_SCD_LFPS_TIMEOUT */
#define USB32DEV_LNK_LTSSM_SCD_LFPS_TIMEOUT_TIMEOUT16_Pos 0UL
#define USB32DEV_LNK_LTSSM_SCD_LFPS_TIMEOUT_TIMEOUT16_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_LBPM_LFPS_TIMEOUT */
#define USB32DEV_LNK_LTSSM_LBPM_LFPS_TIMEOUT_TIMEOUT24_Pos 0UL
#define USB32DEV_LNK_LTSSM_LBPM_LFPS_TIMEOUT_TIMEOUT24_Msk 0xFFFFFFUL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_9_TO_12 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_9_TO_12_DEEMPH_COEFF_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_9_TO_12_DEEMPH_COEFF_Msk 0x3FFFFUL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_13 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_13_DEEMPH_COEFF_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_13_DEEMPH_COEFF_Msk 0x3FFFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_13_GEN2_TXONESZEROS_Pos 18UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_13_GEN2_TXONESZEROS_Msk 0x40000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_14 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_14_DEEMPH_COEFF_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_14_DEEMPH_COEFF_Msk 0x3FFFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_14_GEN2_TXONESZEROS_Pos 18UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_14_GEN2_TXONESZEROS_Msk 0x40000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_15 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_15_DEEMPH_COEFF_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_15_DEEMPH_COEFF_Msk 0x3FFFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_15_GEN2_TXONESZEROS_Pos 18UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_15_GEN2_TXONESZEROS_Msk 0x40000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_16 */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_16_DEEMPH_COEFF_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_16_DEEMPH_COEFF_Msk 0x3FFFFUL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_16_GEN2_TXONESZEROS_Pos 18UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_16_GEN2_TXONESZEROS_Msk 0x40000UL
/* USB32DEV_LNK.LNK_COMPLIANCE_PATTERN_OBSERVE */
#define USB32DEV_LNK_COMPLIANCE_PATTERN_OBSERVE_CP_OBSERVE_Pos 0UL
#define USB32DEV_LNK_COMPLIANCE_PATTERN_OBSERVE_CP_OBSERVE_Msk 0x3FUL
/* USB32DEV_LNK.LNK_SOFT_ERR_CNT_CONF */
#define USB32DEV_LNK_SOFT_ERR_CNT_CONF_SOFT_ERR_LFR_OPT_Pos 29UL
#define USB32DEV_LNK_SOFT_ERR_CNT_CONF_SOFT_ERR_LFR_OPT_Msk 0x20000000UL
#define USB32DEV_LNK_SOFT_ERR_CNT_CONF_SOFT_ERR_CNT_RESET_Pos 30UL
#define USB32DEV_LNK_SOFT_ERR_CNT_CONF_SOFT_ERR_CNT_RESET_Msk 0x40000000UL
#define USB32DEV_LNK_SOFT_ERR_CNT_CONF_SOFT_ERR_CNT_EN_Pos 31UL
#define USB32DEV_LNK_SOFT_ERR_CNT_CONF_SOFT_ERR_CNT_EN_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_SOFT_ERR_CNT_OBSERVE */
#define USB32DEV_LNK_SOFT_ERR_CNT_OBSERVE_SOFT_ERR_CNT_OBSERVE_Pos 0UL
#define USB32DEV_LNK_SOFT_ERR_CNT_OBSERVE_SOFT_ERR_CNT_OBSERVE_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_LTSSM_STATE_CHG_INTR_CONF */
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_SS_DISABLE_INTR_Pos 0UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_SS_DISABLE_INTR_Msk 0x1UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RX_DETECT_RESET_INTR_Pos 1UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RX_DETECT_RESET_INTR_Msk 0x2UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RX_DETECT_ACTIVE_INTR_Pos 2UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RX_DETECT_ACTIVE_INTR_Msk 0x4UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RX_DETECT_QUIET_INTR_Pos 3UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RX_DETECT_QUIET_INTR_Msk 0x8UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_SS_INACTIVE_QUIET_INTR_Pos 4UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_SS_INACTIVE_QUIET_INTR_Msk 0x10UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_SS_INACTIVE_DISCONNECT_DETECT_INTR_Pos 5UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_SS_INACTIVE_DISCONNECT_DETECT_INTR_Msk 0x20UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_HOTRESET_ACTIVE_INTR_Pos 6UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_HOTRESET_ACTIVE_INTR_Msk 0x40UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_HOTRESET_EXIT_INTR_Pos 7UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_HOTRESET_EXIT_INTR_Msk 0x80UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_LFPS_INTR_Pos 8UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_LFPS_INTR_Msk 0x100UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_RXEQ_INTR_Pos 9UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_RXEQ_INTR_Msk 0x200UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_ACTIVE_INTR_Pos 10UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_ACTIVE_INTR_Msk 0x400UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_CONFIGURATION_INTR_Pos 11UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_CONFIGURATION_INTR_Msk 0x800UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_IDLE_INTR_Pos 12UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_IDLE_INTR_Msk 0x1000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_LFPSPLUS_INTR_Pos 13UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_LFPSPLUS_INTR_Msk 0x2000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_PORT_MATCH_INTR_Pos 14UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_PORT_MATCH_INTR_Msk 0x4000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_PORT_CONFIG_INTR_Pos 15UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_POLLING_PORT_CONFIG_INTR_Msk 0x8000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_U0_INTR_Pos 16UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_U0_INTR_Msk 0x10000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_U1_INTR_Pos 17UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_U1_INTR_Msk 0x20000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_U2_INTR_Pos 18UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_U2_INTR_Msk 0x40000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_U3_INTR_Pos 19UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_U3_INTR_Msk 0x80000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_LOOPBACK_ACTIVE_INTR_Pos 20UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_LOOPBACK_ACTIVE_INTR_Msk 0x100000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_LOOPBACK_EXIT_INTR_Pos 21UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_LOOPBACK_EXIT_INTR_Msk 0x200000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_COMPLIANCE_INTR_Pos 22UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_COMPLIANCE_INTR_Msk 0x400000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RECOVERY_ACTIVE_INTR_Pos 23UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RECOVERY_ACTIVE_INTR_Msk 0x800000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RECOVERY_CONFIGURATION_INTR_Pos 24UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RECOVERY_CONFIGURATION_INTR_Msk 0x1000000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RECOVERY_IDLE_INTR_Pos 25UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_RECOVERY_IDLE_INTR_Msk 0x2000000UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_ILLEGAL_STATE_INTR_Pos 26UL
#define USB32DEV_LNK_LTSSM_STATE_CHG_INTR_CONF_ILLEGAL_STATE_INTR_Msk 0x4000000UL
/* USB32DEV_LNK.LNK_DEBUG_RSVD */
#define USB32DEV_LNK_DEBUG_RSVD_DEBUG_SIG_SEL_Pos 0UL
#define USB32DEV_LNK_DEBUG_RSVD_DEBUG_SIG_SEL_Msk 0xFFFFUL
#define USB32DEV_LNK_DEBUG_RSVD_HS_DDFT_SEL_Pos 16UL
#define USB32DEV_LNK_DEBUG_RSVD_HS_DDFT_SEL_Msk 0x1F0000UL
#define USB32DEV_LNK_DEBUG_RSVD_HS_DDFT_NOT_EXTD_Pos 21UL
#define USB32DEV_LNK_DEBUG_RSVD_HS_DDFT_NOT_EXTD_Msk 0x200000UL
#define USB32DEV_LNK_DEBUG_RSVD_RSVD_Pos 22UL
#define USB32DEV_LNK_DEBUG_RSVD_RSVD_Msk 0x7FC00000UL
#define USB32DEV_LNK_DEBUG_RSVD_FORCE_RATE_CONFIG_TO_GEN1_Pos 31UL
#define USB32DEV_LNK_DEBUG_RSVD_FORCE_RATE_CONFIG_TO_GEN1_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_TX_TS1_HOLDOFF_TIMEOUT */
#define USB32DEV_LNK_TX_TS1_HOLDOFF_TIMEOUT_TX_TS1_HOLDOFF_TIMEOUT_Pos 0UL
#define USB32DEV_LNK_TX_TS1_HOLDOFF_TIMEOUT_TX_TS1_HOLDOFF_TIMEOUT_Msk 0xFFFFUL
/* USB32DEV_LNK.LNK_MISC_CONF */
