RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
#define USB32DEV_LNK_MISC_CONF_REPLACED_SKP_SYMB_Pos 0UL
#define USB32DEV_LNK_MISC_CONF_REPLACED_SKP_SYMB_Msk 0xFFUL
#define USB32DEV_LNK_MISC_CONF_TX_TS2_CONF_Pos 8UL
#define USB32DEV_LNK_MISC_CONF_TX_TS2_CONF_Msk 0x300UL
#define USB32DEV_LNK_MISC_CONF_INVALID_LFPS_NOT_RST_TIMER_EN_Pos 10UL
#define USB32DEV_LNK_MISC_CONF_INVALID_LFPS_NOT_RST_TIMER_EN_Msk 0x400UL
#define USB32DEV_LNK_MISC_CONF_GEN1X2_SKP_REMOVAL_EN_Pos 11UL
#define USB32DEV_LNK_MISC_CONF_GEN1X2_SKP_REMOVAL_EN_Msk 0x800UL
#define USB32DEV_LNK_MISC_CONF_TX_DL_SET_ENABLE_Pos 12UL
#define USB32DEV_LNK_MISC_CONF_TX_DL_SET_ENABLE_Msk 0x1000UL
#define USB32DEV_LNK_MISC_CONF_GEN1_GT_4CLK_SKEW_DET_EN_Pos 13UL
#define USB32DEV_LNK_MISC_CONF_GEN1_GT_4CLK_SKEW_DET_EN_Msk 0x2000UL
#define USB32DEV_LNK_MISC_CONF_GEN2_GT_4CLK_SKEW_DET_EN_Pos 14UL
#define USB32DEV_LNK_MISC_CONF_GEN2_GT_4CLK_SKEW_DET_EN_Msk 0x4000UL
#define USB32DEV_LNK_MISC_CONF_GEN1_SKEW_EVAL_EN_Pos 15UL
#define USB32DEV_LNK_MISC_CONF_GEN1_SKEW_EVAL_EN_Msk 0x8000UL
#define USB32DEV_LNK_MISC_CONF_GEN2_SKEW_EVAL_EN_Pos 16UL
#define USB32DEV_LNK_MISC_CONF_GEN2_SKEW_EVAL_EN_Msk 0x10000UL
#define USB32DEV_LNK_MISC_CONF_GEN2_SKP_REMOVAL_OPT_Pos 17UL
#define USB32DEV_LNK_MISC_CONF_GEN2_SKP_REMOVAL_OPT_Msk 0x20000UL
#define USB32DEV_LNK_MISC_CONF_GEN2_ALGN_FSM_RST_OPT_Pos 18UL
#define USB32DEV_LNK_MISC_CONF_GEN2_ALGN_FSM_RST_OPT_Msk 0x40000UL
#define USB32DEV_LNK_MISC_CONF_PENDING_LXU_BEFORE_LGOOD_BUG_FIX_EN_Pos 19UL
#define USB32DEV_LNK_MISC_CONF_PENDING_LXU_BEFORE_LGOOD_BUG_FIX_EN_Msk 0x80000UL
#define USB32DEV_LNK_MISC_CONF_RX_DESKEW_CLK_GT_EN_Pos 20UL
#define USB32DEV_LNK_MISC_CONF_RX_DESKEW_CLK_GT_EN_Msk 0x100000UL
#define USB32DEV_LNK_MISC_CONF_GEN2X2_DESKEW_ON_TS1_Pos 21UL
#define USB32DEV_LNK_MISC_CONF_GEN2X2_DESKEW_ON_TS1_Msk 0x200000UL
#define USB32DEV_LNK_MISC_CONF_TX_IDLE_CONF_Pos 22UL
#define USB32DEV_LNK_MISC_CONF_TX_IDLE_CONF_Msk 0xC00000UL
#define USB32DEV_LNK_MISC_CONF_RX_DESKEW_RST_IF_RECOV_Pos 30UL
#define USB32DEV_LNK_MISC_CONF_RX_DESKEW_RST_IF_RECOV_Msk 0x40000000UL
#define USB32DEV_LNK_MISC_CONF_RX_DESKEW_EN_Pos 31UL
#define USB32DEV_LNK_MISC_CONF_RX_DESKEW_EN_Msk 0x80000000UL
/* USB32DEV_LNK.LNK_MISC_OBSERVE */
#define USB32DEV_LNK_MISC_OBSERVE_LOCKED_SKEW_VAL_Pos 0UL
#define USB32DEV_LNK_MISC_OBSERVE_LOCKED_SKEW_VAL_Msk 0x1FUL
/* USB32DEV_LNK.LNK_LTSSM_SUBSTATE_OBSERVE */
#define USB32DEV_LNK_LTSSM_SUBSTATE_OBSERVE_LTSSM_SUBSTATE_OBSERVE_Pos 0UL
#define USB32DEV_LNK_LTSSM_SUBSTATE_OBSERVE_LTSSM_SUBSTATE_OBSERVE_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_RX_TYPE1_HEADER_BUFFER */
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_HEADER_Pos 0UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_HEADER_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_RX_TYPE1_HEADER_BUFFER_STATE_0 */
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE0_Pos 0UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE0_Msk 0xFUL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_VALID0_Pos 4UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_VALID0_Msk 0x10UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_RCVD0_Pos 5UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_RCVD0_Msk 0x20UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE1_Pos 8UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE1_Msk 0xF00UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_VALID1_Pos 12UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_VALID1_Msk 0x1000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_RCVD1_Pos 13UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_RCVD1_Msk 0x2000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE2_Pos 16UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE2_Msk 0xF0000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_VALID2_Pos 20UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_VALID2_Msk 0x100000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_RCVD2_Pos 21UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_RCVD2_Msk 0x200000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE3_Pos 24UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE3_Msk 0xF000000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_VALID3_Pos 28UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_VALID3_Msk 0x10000000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_RCVD3_Pos 29UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_0_RCVD3_Msk 0x20000000UL
/* USB32DEV_LNK.LNK_RX_TYPE1_HEADER_BUFFER_STATE_1 */
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE4_Pos 0UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE4_Msk 0xFUL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_VALID4_Pos 4UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_VALID4_Msk 0x10UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_RCVD4_Pos 5UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_RCVD4_Msk 0x20UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE5_Pos 8UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE5_Msk 0xF00UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_VALID5_Pos 12UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_VALID5_Msk 0x1000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_RCVD5_Pos 13UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_RCVD5_Msk 0x2000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE6_Pos 16UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE6_Msk 0xF0000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_VALID6_Pos 20UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_VALID6_Msk 0x100000UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_RCVD6_Pos 21UL
#define USB32DEV_LNK_RX_TYPE1_HEADER_BUFFER_STATE_1_RCVD6_Msk 0x200000UL
/* USB32DEV_LNK.LNK_RX_TYPE2_HEADER_BUFFER */
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_HEADER_Pos 0UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_HEADER_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_RX_TYPE2_HEADER_BUFFER_STATE_0 */
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE0_Pos 0UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE0_Msk 0xFUL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_VALID0_Pos 4UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_VALID0_Msk 0x10UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_RCVD0_Pos 5UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_RCVD0_Msk 0x20UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE1_Pos 8UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE1_Msk 0xF00UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_VALID1_Pos 12UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_VALID1_Msk 0x1000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_RCVD1_Pos 13UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_RCVD1_Msk 0x2000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE2_Pos 16UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE2_Msk 0xF0000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_VALID2_Pos 20UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_VALID2_Msk 0x100000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_RCVD2_Pos 21UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_RCVD2_Msk 0x200000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE3_Pos 24UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE3_Msk 0xF000000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_VALID3_Pos 28UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_VALID3_Msk 0x10000000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_RCVD3_Pos 29UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_0_RCVD3_Msk 0x20000000UL
/* USB32DEV_LNK.LNK_RX_TYPE2_HEADER_BUFFER_STATE_1 */
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE4_Pos 0UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE4_Msk 0xFUL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_VALID4_Pos 4UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_VALID4_Msk 0x10UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_RCVD4_Pos 5UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_RCVD4_Msk 0x20UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE5_Pos 8UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE5_Msk 0xF00UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_VALID5_Pos 12UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_VALID5_Msk 0x1000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_RCVD5_Pos 13UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_RCVD5_Msk 0x2000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE6_Pos 16UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE6_Msk 0xF0000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_VALID6_Pos 20UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_VALID6_Msk 0x100000UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_RCVD6_Pos 21UL
#define USB32DEV_LNK_RX_TYPE2_HEADER_BUFFER_STATE_1_RCVD6_Msk 0x200000UL
/* USB32DEV_LNK.LNK_TX_TYPE1_HEADER_BUFFER */
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_HEADER_Pos 0UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_HEADER_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_TX_TYPE1_HEADER_BUFFER_STATE_0 */
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE0_Pos 0UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE0_Msk 0xFUL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_VALID0_Pos 4UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_VALID0_Msk 0x10UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SENT0_Pos 5UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SENT0_Msk 0x20UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE1_Pos 8UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE1_Msk 0xF00UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_VALID1_Pos 12UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_VALID1_Msk 0x1000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SENT1_Pos 13UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SENT1_Msk 0x2000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE2_Pos 16UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE2_Msk 0xF0000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_VALID2_Pos 20UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_VALID2_Msk 0x100000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SENT2_Pos 21UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SENT2_Msk 0x200000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE3_Pos 24UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SEQUENCE3_Msk 0xF000000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_VALID3_Pos 28UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_VALID3_Msk 0x10000000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SENT3_Pos 29UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_0_SENT3_Msk 0x20000000UL
/* USB32DEV_LNK.LNK_TX_TYPE1_HEADER_BUFFER_STATE_1 */
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE4_Pos 0UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE4_Msk 0xFUL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_VALID4_Pos 4UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_VALID4_Msk 0x10UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SENT4_Pos 5UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SENT4_Msk 0x20UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE5_Pos 8UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE5_Msk 0xF00UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_VALID5_Pos 12UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_VALID5_Msk 0x1000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SENT5_Pos 13UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SENT5_Msk 0x2000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE6_Pos 16UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SEQUENCE6_Msk 0xF0000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_VALID6_Pos 20UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_VALID6_Msk 0x100000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SENT6_Pos 21UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_SENT6_Msk 0x200000UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_REMOTE_CREDITS_Pos 29UL
#define USB32DEV_LNK_TX_TYPE1_HEADER_BUFFER_STATE_1_REMOTE_CREDITS_Msk 0xE0000000UL
/* USB32DEV_LNK.LNK_TX_TYPE2_HEADER_BUFFER */
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_HEADER_Pos 0UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_HEADER_Msk 0xFFFFFFFFUL
/* USB32DEV_LNK.LNK_TX_TYPE2_HEADER_BUFFER_STATE_0 */
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE0_Pos 0UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE0_Msk 0xFUL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_VALID0_Pos 4UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_VALID0_Msk 0x10UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SENT0_Pos 5UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SENT0_Msk 0x20UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE1_Pos 8UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE1_Msk 0xF00UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_VALID1_Pos 12UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_VALID1_Msk 0x1000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SENT1_Pos 13UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SENT1_Msk 0x2000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE2_Pos 16UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE2_Msk 0xF0000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_VALID2_Pos 20UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_VALID2_Msk 0x100000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SENT2_Pos 21UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SENT2_Msk 0x200000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE3_Pos 24UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SEQUENCE3_Msk 0xF000000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_VALID3_Pos 28UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_VALID3_Msk 0x10000000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SENT3_Pos 29UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_0_SENT3_Msk 0x20000000UL
/* USB32DEV_LNK.LNK_TX_TYPE2_HEADER_BUFFER_STATE_1 */
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE4_Pos 0UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE4_Msk 0xFUL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_VALID4_Pos 4UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_VALID4_Msk 0x10UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SENT4_Pos 5UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SENT4_Msk 0x20UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE5_Pos 8UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE5_Msk 0xF00UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_VALID5_Pos 12UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_VALID5_Msk 0x1000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SENT5_Pos 13UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SENT5_Msk 0x2000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE6_Pos 16UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SEQUENCE6_Msk 0xF0000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_VALID6_Pos 20UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_VALID6_Msk 0x100000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SENT6_Pos 21UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_SENT6_Msk 0x200000UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_REMOTE_CREDITS_Pos 29UL
#define USB32DEV_LNK_TX_TYPE2_HEADER_BUFFER_STATE_1_REMOTE_CREDITS_Msk 0xE0000000UL


