RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
/* USB32DEV_PROT.PROT_CS */
#define USB32DEV_PROT_CS_DEVICEADDR_Pos 0UL
#define USB32DEV_PROT_CS_DEVICEADDR_Msk 0x7FUL
#define USB32DEV_PROT_CS_DISABLE_INGRS_SEQ_MATCH_Pos 7UL
#define USB32DEV_PROT_CS_DISABLE_INGRS_SEQ_MATCH_Msk 0x80UL
#define USB32DEV_PROT_CS_DISABLE_EGRS_SEQ_MATCH_Pos 8UL
#define USB32DEV_PROT_CS_DISABLE_EGRS_SEQ_MATCH_Msk 0x100UL
#define USB32DEV_PROT_CS_DISABLE_HE_DETECTION_Pos 9UL
#define USB32DEV_PROT_CS_DISABLE_HE_DETECTION_Msk 0x200UL
#define USB32DEV_PROT_CS_SPARE_CS_Pos 10UL
#define USB32DEV_PROT_CS_SPARE_CS_Msk 0x1C00UL
#define USB32DEV_PROT_CS_EN_STATUS_CONTROL_Pos 13UL
#define USB32DEV_PROT_CS_EN_STATUS_CONTROL_Msk 0x2000UL
#define USB32DEV_PROT_CS_STATUS_RESPONSE_Pos 14UL
#define USB32DEV_PROT_CS_STATUS_RESPONSE_Msk 0x4000UL
#define USB32DEV_PROT_CS_STATUS_CLR_BUSY_Pos 15UL
#define USB32DEV_PROT_CS_STATUS_CLR_BUSY_Msk 0x8000UL
#define USB32DEV_PROT_CS_SETUP_CLR_BUSY_Pos 16UL
#define USB32DEV_PROT_CS_SETUP_CLR_BUSY_Msk 0x10000UL
#define USB32DEV_PROT_CS_NRDY_ALL_Pos 17UL
#define USB32DEV_PROT_CS_NRDY_ALL_Msk 0x20000UL
#define USB32DEV_PROT_CS_TP_THRESHOLD_Pos 18UL
#define USB32DEV_PROT_CS_TP_THRESHOLD_Msk 0xFC0000UL
#define USB32DEV_PROT_CS_PROT_HOST_RESET_RESP_Pos 24UL
#define USB32DEV_PROT_CS_PROT_HOST_RESET_RESP_Msk 0x1000000UL
#define USB32DEV_PROT_CS_SEQ_NUM_CONFIG_Pos 25UL
#define USB32DEV_PROT_CS_SEQ_NUM_CONFIG_Msk 0x2000000UL
#define USB32DEV_PROT_CS_DISABLE_IDLE_DET_Pos 26UL
#define USB32DEV_PROT_CS_DISABLE_IDLE_DET_Msk 0x4000000UL
#define USB32DEV_PROT_CS_MULT_TIMER_Pos 27UL
#define USB32DEV_PROT_CS_MULT_TIMER_Msk 0xF8000000UL
/* USB32DEV_PROT.PROT_INTR */
#define USB32DEV_PROT_INTR_LMP_RCV_EV_Pos 0UL
#define USB32DEV_PROT_INTR_LMP_RCV_EV_Msk 0x1UL
#define USB32DEV_PROT_INTR_LMP_UNKNOWN_EV_Pos 1UL
#define USB32DEV_PROT_INTR_LMP_UNKNOWN_EV_Msk 0x2UL
#define USB32DEV_PROT_INTR_LMP_PORT_CAP_EV_Pos 2UL
#define USB32DEV_PROT_INTR_LMP_PORT_CAP_EV_Msk 0x4UL
#define USB32DEV_PROT_INTR_LMP_PORT_CFG_EV_Pos 3UL
#define USB32DEV_PROT_INTR_LMP_PORT_CFG_EV_Msk 0x8UL
#define USB32DEV_PROT_INTR_TIMEOUT_PORT_CAP_EV_Pos 4UL
#define USB32DEV_PROT_INTR_TIMEOUT_PORT_CAP_EV_Msk 0x10UL
#define USB32DEV_PROT_INTR_TIMEOUT_PORT_CFG_EV_Pos 5UL
#define USB32DEV_PROT_INTR_TIMEOUT_PORT_CFG_EV_Msk 0x20UL
#define USB32DEV_PROT_INTR_TIMEOUT_PING_EV_Pos 6UL
#define USB32DEV_PROT_INTR_TIMEOUT_PING_EV_Msk 0x40UL
#define USB32DEV_PROT_INTR_ITP_EV_Pos 8UL
#define USB32DEV_PROT_INTR_ITP_EV_Msk 0x100UL
#define USB32DEV_PROT_INTR_SUTOK_EV_Pos 9UL
#define USB32DEV_PROT_INTR_SUTOK_EV_Msk 0x200UL
#define USB32DEV_PROT_INTR_HOST_ERR_EV_Pos 10UL
#define USB32DEV_PROT_INTR_HOST_ERR_EV_Msk 0x400UL
#define USB32DEV_PROT_INTR_STATUS_STAGE_Pos 11UL
#define USB32DEV_PROT_INTR_STATUS_STAGE_Msk 0x800UL
#define USB32DEV_PROT_INTR_LMP_INVALID_PORT_CAP_EV_Pos 12UL
#define USB32DEV_PROT_INTR_LMP_INVALID_PORT_CAP_EV_Msk 0x1000UL
#define USB32DEV_PROT_INTR_LMP_INVALID_PORT_CFG_EV_Pos 13UL
#define USB32DEV_PROT_INTR_LMP_INVALID_PORT_CFG_EV_Msk 0x2000UL
#define USB32DEV_PROT_INTR_EP0_STALLED_EV_Pos 14UL
#define USB32DEV_PROT_INTR_EP0_STALLED_EV_Msk 0x4000UL
#define USB32DEV_PROT_INTR_SET_ADDR0_EV_Pos 15UL
#define USB32DEV_PROT_INTR_SET_ADDR0_EV_Msk 0x8000UL
#define USB32DEV_PROT_INTR_LDM_TX_Pos 16UL
#define USB32DEV_PROT_INTR_LDM_TX_Msk 0x10000UL
#define USB32DEV_PROT_INTR_LDM_DL_TX_Pos 17UL
#define USB32DEV_PROT_INTR_LDM_DL_TX_Msk 0x20000UL
#define USB32DEV_PROT_INTR_LDM_RX_Pos 18UL
#define USB32DEV_PROT_INTR_LDM_RX_Msk 0x40000UL
#define USB32DEV_PROT_INTR_LDM_DL_RX_Pos 19UL
#define USB32DEV_PROT_INTR_LDM_DL_RX_Msk 0x80000UL
#define USB32DEV_PROT_INTR_LDM_RESP_TIMEOUT_1_Pos 20UL
#define USB32DEV_PROT_INTR_LDM_RESP_TIMEOUT_1_Msk 0x100000UL
#define USB32DEV_PROT_INTR_LDM_RESP_TIMEOUT_2_Pos 21UL
#define USB32DEV_PROT_INTR_LDM_RESP_TIMEOUT_2_Msk 0x200000UL
#define USB32DEV_PROT_INTR_LDM_RESP_TIMEOUT_3_Pos 22UL
#define USB32DEV_PROT_INTR_LDM_RESP_TIMEOUT_3_Msk 0x400000UL
#define USB32DEV_PROT_INTR_SET_ADDR_Pos 23UL
#define USB32DEV_PROT_INTR_SET_ADDR_Msk 0x800000UL
#define USB32DEV_PROT_INTR_DEFERRED_SET_Pos 24UL
#define USB32DEV_PROT_INTR_DEFERRED_SET_Msk 0x1000000UL
#define USB32DEV_PROT_INTR_DEFERRED_CLEAR_Pos 25UL
#define USB32DEV_PROT_INTR_DEFERRED_CLEAR_Msk 0x2000000UL
#define USB32DEV_PROT_INTR_LDM_STATE_CHANGE_Pos 26UL
#define USB32DEV_PROT_INTR_LDM_STATE_CHANGE_Msk 0x4000000UL
#define USB32DEV_PROT_INTR_T1_SCH_FULL_Pos 27UL
#define USB32DEV_PROT_INTR_T1_SCH_FULL_Msk 0x8000000UL
#define USB32DEV_PROT_INTR_T2_SCH_FULL_Pos 28UL
#define USB32DEV_PROT_INTR_T2_SCH_FULL_Msk 0x10000000UL
/* USB32DEV_PROT.PROT_INTR_SET */
#define USB32DEV_PROT_INTR_SET_LMP_RCV_EV_Pos 0UL
#define USB32DEV_PROT_INTR_SET_LMP_RCV_EV_Msk 0x1UL
#define USB32DEV_PROT_INTR_SET_LMP_UNKNOWN_EV_Pos 1UL
#define USB32DEV_PROT_INTR_SET_LMP_UNKNOWN_EV_Msk 0x2UL
#define USB32DEV_PROT_INTR_SET_LMP_PORT_CAP_EV_Pos 2UL
#define USB32DEV_PROT_INTR_SET_LMP_PORT_CAP_EV_Msk 0x4UL
#define USB32DEV_PROT_INTR_SET_LMP_PORT_CFG_EV_Pos 3UL
#define USB32DEV_PROT_INTR_SET_LMP_PORT_CFG_EV_Msk 0x8UL
#define USB32DEV_PROT_INTR_SET_TIMEOUT_PORT_CAP_EV_Pos 4UL
#define USB32DEV_PROT_INTR_SET_TIMEOUT_PORT_CAP_EV_Msk 0x10UL
#define USB32DEV_PROT_INTR_SET_TIMEOUT_PORT_CFG_EV_Pos 5UL
#define USB32DEV_PROT_INTR_SET_TIMEOUT_PORT_CFG_EV_Msk 0x20UL
#define USB32DEV_PROT_INTR_SET_TIMEOUT_PING_EV_Pos 6UL
#define USB32DEV_PROT_INTR_SET_TIMEOUT_PING_EV_Msk 0x40UL
#define USB32DEV_PROT_INTR_SET_ITP_EV_Pos 8UL
#define USB32DEV_PROT_INTR_SET_ITP_EV_Msk 0x100UL
#define USB32DEV_PROT_INTR_SET_SUTOK_EV_Pos 9UL
#define USB32DEV_PROT_INTR_SET_SUTOK_EV_Msk 0x200UL
#define USB32DEV_PROT_INTR_SET_HOST_ERR_EV_Pos 10UL
#define USB32DEV_PROT_INTR_SET_HOST_ERR_EV_Msk 0x400UL
#define USB32DEV_PROT_INTR_SET_STATUS_STAGE_Pos 11UL
#define USB32DEV_PROT_INTR_SET_STATUS_STAGE_Msk 0x800UL
#define USB32DEV_PROT_INTR_SET_LMP_INVALID_PORT_CAP_EV_Pos 12UL
#define USB32DEV_PROT_INTR_SET_LMP_INVALID_PORT_CAP_EV_Msk 0x1000UL
#define USB32DEV_PROT_INTR_SET_LMP_INVALID_PORT_CFG_EV_Pos 13UL
#define USB32DEV_PROT_INTR_SET_LMP_INVALID_PORT_CFG_EV_Msk 0x2000UL
#define USB32DEV_PROT_INTR_SET_EP0_STALLED_EV_Pos 14UL
#define USB32DEV_PROT_INTR_SET_EP0_STALLED_EV_Msk 0x4000UL
#define USB32DEV_PROT_INTR_SET_SET_ADDR0_EV_Pos 15UL
#define USB32DEV_PROT_INTR_SET_SET_ADDR0_EV_Msk 0x8000UL
#define USB32DEV_PROT_INTR_SET_LDM_TX_Pos 16UL
#define USB32DEV_PROT_INTR_SET_LDM_TX_Msk 0x10000UL
#define USB32DEV_PROT_INTR_SET_LDM_DL_TX_Pos 17UL
#define USB32DEV_PROT_INTR_SET_LDM_DL_TX_Msk 0x20000UL
#define USB32DEV_PROT_INTR_SET_LDM_RX_Pos 18UL
#define USB32DEV_PROT_INTR_SET_LDM_RX_Msk 0x40000UL
#define USB32DEV_PROT_INTR_SET_LDM_DL_RX_Pos 19UL
#define USB32DEV_PROT_INTR_SET_LDM_DL_RX_Msk 0x80000UL
#define USB32DEV_PROT_INTR_SET_RESP_TIMEOUT_1_Pos 20UL
#define USB32DEV_PROT_INTR_SET_RESP_TIMEOUT_1_Msk 0x100000UL
#define USB32DEV_PROT_INTR_SET_RESP_TIMEOUT_2_Pos 21UL
#define USB32DEV_PROT_INTR_SET_RESP_TIMEOUT_2_Msk 0x200000UL
#define USB32DEV_PROT_INTR_SET_RESP_TIMEOUT_3_Pos 22UL
#define USB32DEV_PROT_INTR_SET_RESP_TIMEOUT_3_Msk 0x400000UL
#define USB32DEV_PROT_INTR_SET_SET_ADDR_Pos 23UL
#define USB32DEV_PROT_INTR_SET_SET_ADDR_Msk 0x800000UL
#define USB32DEV_PROT_INTR_SET_DEFERRED_SET_Pos 24UL
#define USB32DEV_PROT_INTR_SET_DEFERRED_SET_Msk 0x1000000UL
#define USB32DEV_PROT_INTR_SET_DEFERRED_CLEAR_Pos 25UL
#define USB32DEV_PROT_INTR_SET_DEFERRED_CLEAR_Msk 0x2000000UL
#define USB32DEV_PROT_INTR_SET_LDM_STATE_CHANGE_Pos 26UL
#define USB32DEV_PROT_INTR_SET_LDM_STATE_CHANGE_Msk 0x4000000UL
#define USB32DEV_PROT_INTR_SET_T1_SCH_FULL_Pos 27UL
#define USB32DEV_PROT_INTR_SET_T1_SCH_FULL_Msk 0x8000000UL
#define USB32DEV_PROT_INTR_SET_T2_SCH_FULL_Pos 28UL
#define USB32DEV_PROT_INTR_SET_T2_SCH_FULL_Msk 0x10000000UL
/* USB32DEV_PROT.PROT_INTR_MASK */
#define USB32DEV_PROT_INTR_MASK_LMP_RCV_MASK_Pos 0UL
#define USB32DEV_PROT_INTR_MASK_LMP_RCV_MASK_Msk 0x1UL
#define USB32DEV_PROT_INTR_MASK_LMP_UNKNOWN_MASK_Pos 1UL
#define USB32DEV_PROT_INTR_MASK_LMP_UNKNOWN_MASK_Msk 0x2UL
#define USB32DEV_PROT_INTR_MASK_LMP_PORT_CAP_MASK_Pos 2UL
#define USB32DEV_PROT_INTR_MASK_LMP_PORT_CAP_MASK_Msk 0x4UL
#define USB32DEV_PROT_INTR_MASK_LMP_PORT_CFG_MASK_Pos 3UL
#define USB32DEV_PROT_INTR_MASK_LMP_PORT_CFG_MASK_Msk 0x8UL
#define USB32DEV_PROT_INTR_MASK_TIMEOUT_PORT_CAP_MASK_Pos 4UL
#define USB32DEV_PROT_INTR_MASK_TIMEOUT_PORT_CAP_MASK_Msk 0x10UL
#define USB32DEV_PROT_INTR_MASK_TIMEOUT_PORT_CFG_MASK_Pos 5UL
#define USB32DEV_PROT_INTR_MASK_TIMEOUT_PORT_CFG_MASK_Msk 0x20UL
#define USB32DEV_PROT_INTR_MASK_TIMEOUT_PING_MASK_Pos 6UL
#define USB32DEV_PROT_INTR_MASK_TIMEOUT_PING_MASK_Msk 0x40UL
#define USB32DEV_PROT_INTR_MASK_ITP_MASK_Pos 8UL
#define USB32DEV_PROT_INTR_MASK_ITP_MASK_Msk 0x100UL
#define USB32DEV_PROT_INTR_MASK_SUTOK_MASK_Pos 9UL
#define USB32DEV_PROT_INTR_MASK_SUTOK_MASK_Msk 0x200UL
#define USB32DEV_PROT_INTR_MASK_HOST_ERR_MASK_Pos 10UL
#define USB32DEV_PROT_INTR_MASK_HOST_ERR_MASK_Msk 0x400UL
#define USB32DEV_PROT_INTR_MASK_STATUS_STAGE_MASK_Pos 11UL
#define USB32DEV_PROT_INTR_MASK_STATUS_STAGE_MASK_Msk 0x800UL
#define USB32DEV_PROT_INTR_MASK_LMP_INVALID_PORT_CAP_MASK_Pos 12UL
#define USB32DEV_PROT_INTR_MASK_LMP_INVALID_PORT_CAP_MASK_Msk 0x1000UL
#define USB32DEV_PROT_INTR_MASK_LMP_INVALID_PORT_CFG_MASK_Pos 13UL
#define USB32DEV_PROT_INTR_MASK_LMP_INVALID_PORT_CFG_MASK_Msk 0x2000UL
#define USB32DEV_PROT_INTR_MASK_EP0_STALLED_MASK_Pos 14UL
#define USB32DEV_PROT_INTR_MASK_EP0_STALLED_MASK_Msk 0x4000UL
#define USB32DEV_PROT_INTR_MASK_SET_ADDR0_MASK_Pos 15UL
#define USB32DEV_PROT_INTR_MASK_SET_ADDR0_MASK_Msk 0x8000UL
#define USB32DEV_PROT_INTR_MASK_LDM_TX_MASK_Pos 16UL
#define USB32DEV_PROT_INTR_MASK_LDM_TX_MASK_Msk 0x10000UL
#define USB32DEV_PROT_INTR_MASK_LDM_DL_TX_MASK_Pos 17UL
#define USB32DEV_PROT_INTR_MASK_LDM_DL_TX_MASK_Msk 0x20000UL
#define USB32DEV_PROT_INTR_MASK_LDM_RX_MASK_Pos 18UL
#define USB32DEV_PROT_INTR_MASK_LDM_RX_MASK_Msk 0x40000UL
#define USB32DEV_PROT_INTR_MASK_LDM_DL_RX_MASK_Pos 19UL
#define USB32DEV_PROT_INTR_MASK_LDM_DL_RX_MASK_Msk 0x80000UL
#define USB32DEV_PROT_INTR_MASK_RESP_TIMEOUT_1_MASK_Pos 20UL
#define USB32DEV_PROT_INTR_MASK_RESP_TIMEOUT_1_MASK_Msk 0x100000UL
#define USB32DEV_PROT_INTR_MASK_RESP_TIMEOUT_2_MASK_Pos 21UL
#define USB32DEV_PROT_INTR_MASK_RESP_TIMEOUT_2_MASK_Msk 0x200000UL
#define USB32DEV_PROT_INTR_MASK_RESP_TIMEOUT_3_MASK_Pos 22UL
#define USB32DEV_PROT_INTR_MASK_RESP_TIMEOUT_3_MASK_Msk 0x400000UL
#define USB32DEV_PROT_INTR_MASK_SET_ADDR_MASK_Pos 23UL
#define USB32DEV_PROT_INTR_MASK_SET_ADDR_MASK_Msk 0x800000UL
#define USB32DEV_PROT_INTR_MASK_DEFERRED_SET_MASK_Pos 24UL
#define USB32DEV_PROT_INTR_MASK_DEFERRED_SET_MASK_Msk 0x1000000UL
#define USB32DEV_PROT_INTR_MASK_DEFERRED_CLEAR_MASK_Pos 25UL
#define USB32DEV_PROT_INTR_MASK_DEFERRED_CLEAR_MASK_Msk 0x2000000UL
#define USB32DEV_PROT_INTR_MASK_LDM_STATE_CHANGE_MASK_Pos 26UL
#define USB32DEV_PROT_INTR_MASK_LDM_STATE_CHANGE_MASK_Msk 0x4000000UL
#define USB32DEV_PROT_INTR_MASK_T1_SCH_FULL_MASK_Pos 27UL
#define USB32DEV_PROT_INTR_MASK_T1_SCH_FULL_MASK_Msk 0x8000000UL
#define USB32DEV_PROT_INTR_MASK_T2_SCH_FULL_MASK_Pos 28UL
#define USB32DEV_PROT_INTR_MASK_T2_SCH_FULL_MASK_Msk 0x10000000UL
/* USB32DEV_PROT.PROT_INTR_MASKED */
#define USB32DEV_PROT_INTR_MASKED_LMP_RCV_MASKED_Pos 0UL
#define USB32DEV_PROT_INTR_MASKED_LMP_RCV_MASKED_Msk 0x1UL
#define USB32DEV_PROT_INTR_MASKED_LMP_UNKNOWN_MASKED_Pos 1UL
#define USB32DEV_PROT_INTR_MASKED_LMP_UNKNOWN_MASKED_Msk 0x2UL
#define USB32DEV_PROT_INTR_MASKED_LMP_PORT_CAP_MASKED_Pos 2UL
#define USB32DEV_PROT_INTR_MASKED_LMP_PORT_CAP_MASKED_Msk 0x4UL
#define USB32DEV_PROT_INTR_MASKED_LMP_PORT_CFG_MASKED_Pos 3UL
#define USB32DEV_PROT_INTR_MASKED_LMP_PORT_CFG_MASKED_Msk 0x8UL
#define USB32DEV_PROT_INTR_MASKED_TIMEOUT_PORT_CAP_MASKED_Pos 4UL
#define USB32DEV_PROT_INTR_MASKED_TIMEOUT_PORT_CAP_MASKED_Msk 0x10UL
#define USB32DEV_PROT_INTR_MASKED_TIMEOUT_PORT_CFG_MASKED_Pos 5UL
#define USB32DEV_PROT_INTR_MASKED_TIMEOUT_PORT_CFG_MASKED_Msk 0x20UL
#define USB32DEV_PROT_INTR_MASKED_TIMEOUT_PING_MASKED_Pos 6UL
#define USB32DEV_PROT_INTR_MASKED_TIMEOUT_PING_MASKED_Msk 0x40UL
#define USB32DEV_PROT_INTR_MASKED_ITP_MASKED_Pos 8UL
#define USB32DEV_PROT_INTR_MASKED_ITP_MASKED_Msk 0x100UL
#define USB32DEV_PROT_INTR_MASKED_SUTOK_MASKED_Pos 9UL
#define USB32DEV_PROT_INTR_MASKED_SUTOK_MASKED_Msk 0x200UL
#define USB32DEV_PROT_INTR_MASKED_HOST_ERR_MASKED_Pos 10UL
#define USB32DEV_PROT_INTR_MASKED_HOST_ERR_MASKED_Msk 0x400UL
#define USB32DEV_PROT_INTR_MASKED_STATUS_STAGE_MASKED_Pos 11UL
#define USB32DEV_PROT_INTR_MASKED_STATUS_STAGE_MASKED_Msk 0x800UL
#define USB32DEV_PROT_INTR_MASKED_LMP_INVALID_PORT_CAP_MASKED_Pos 12UL
#define USB32DEV_PROT_INTR_MASKED_LMP_INVALID_PORT_CAP_MASKED_Msk 0x1000UL
#define USB32DEV_PROT_INTR_MASKED_LMP_INVALID_PORT_CFG_MASKED_Pos 13UL
#define USB32DEV_PROT_INTR_MASKED_LMP_INVALID_PORT_CFG_MASKED_Msk 0x2000UL
#define USB32DEV_PROT_INTR_MASKED_EP0_STALLED_MASKED_Pos 14UL
#define USB32DEV_PROT_INTR_MASKED_EP0_STALLED_MASKED_Msk 0x4000UL
#define USB32DEV_PROT_INTR_MASKED_SET_ADDR0_MASKED_Pos 15UL
#define USB32DEV_PROT_INTR_MASKED_SET_ADDR0_MASKED_Msk 0x8000UL
#define USB32DEV_PROT_INTR_MASKED_LDM_TX_MASKED_Pos 16UL
#define USB32DEV_PROT_INTR_MASKED_LDM_TX_MASKED_Msk 0x10000UL
#define USB32DEV_PROT_INTR_MASKED_LDM_DL_TX_MASKED_Pos 17UL
#define USB32DEV_PROT_INTR_MASKED_LDM_DL_TX_MASKED_Msk 0x20000UL
#define USB32DEV_PROT_INTR_MASKED_LDM_RX_MASKED_Pos 18UL
#define USB32DEV_PROT_INTR_MASKED_LDM_RX_MASKED_Msk 0x40000UL
#define USB32DEV_PROT_INTR_MASKED_LDM_DL_RX_MASKED_Pos 19UL
#define USB32DEV_PROT_INTR_MASKED_LDM_DL_RX_MASKED_Msk 0x80000UL
#define USB32DEV_PROT_INTR_MASKED_RESP_TIMEOUT_1_MASKED_Pos 20UL
#define USB32DEV_PROT_INTR_MASKED_RESP_TIMEOUT_1_MASKED_Msk 0x100000UL
#define USB32DEV_PROT_INTR_MASKED_RESP_TIMEOUT_2_MASKED_Pos 21UL
#define USB32DEV_PROT_INTR_MASKED_RESP_TIMEOUT_2_MASKED_Msk 0x200000UL
#define USB32DEV_PROT_INTR_MASKED_RESP_TIMEOUT_3_MASKED_Pos 22UL
#define USB32DEV_PROT_INTR_MASKED_RESP_TIMEOUT_3_MASKED_Msk 0x400000UL
#define USB32DEV_PROT_INTR_MASKED_SET_ADDR_MASKED_Pos 23UL
#define USB32DEV_PROT_INTR_MASKED_SET_ADDR_MASKED_Msk 0x800000UL
#define USB32DEV_PROT_INTR_MASKED_DEFERRED_SET_MASKED_Pos 24UL
#define USB32DEV_PROT_INTR_MASKED_DEFERRED_SET_MASKED_Msk 0x1000000UL
#define USB32DEV_PROT_INTR_MASKED_DEFERRED_CLEAR_MASKED_Pos 25UL
#define USB32DEV_PROT_INTR_MASKED_DEFERRED_CLEAR_MASKED_Msk 0x2000000UL
#define USB32DEV_PROT_INTR_MASKED_LDM_STATE_CHANGE_MASKED_Pos 26UL
#define USB32DEV_PROT_INTR_MASKED_LDM_STATE_CHANGE_MASKED_Msk 0x4000000UL
#define USB32DEV_PROT_INTR_MASKED_T1_SCH_FULL_MASKED_Pos 27UL
#define USB32DEV_PROT_INTR_MASKED_T1_SCH_FULL_MASKED_Msk 0x8000000UL
#define USB32DEV_PROT_INTR_MASKED_T2_SCH_FULL_MASKED_Pos 28UL
#define USB32DEV_PROT_INTR_MASKED_T2_SCH_FULL_MASKED_Msk 0x10000000UL
/* USB32DEV_PROT.PROT_EP_INTR */
#define USB32DEV_PROT_EP_INTR_EP_IN_Pos 0UL
#define USB32DEV_PROT_EP_INTR_EP_IN_Msk 0xFFFFUL
#define USB32DEV_PROT_EP_INTR_EP_OUT_Pos 16UL
#define USB32DEV_PROT_EP_INTR_EP_OUT_Msk 0xFFFF0000UL
/* USB32DEV_PROT.PROT_EP_INTR_SET */
#define USB32DEV_PROT_EP_INTR_SET_EP_IN_Pos 0UL
#define USB32DEV_PROT_EP_INTR_SET_EP_IN_Msk 0xFFFFUL
#define USB32DEV_PROT_EP_INTR_SET_EP_OUT_Pos 16UL
#define USB32DEV_PROT_EP_INTR_SET_EP_OUT_Msk 0xFFFF0000UL
/* USB32DEV_PROT.PROT_EP_INTR_MASK */
#define USB32DEV_PROT_EP_INTR_MASK_EP_IN_MASK_Pos 0UL
#define USB32DEV_PROT_EP_INTR_MASK_EP_IN_MASK_Msk 0xFFFFUL
#define USB32DEV_PROT_EP_INTR_MASK_EP_OUT_MASK_Pos 16UL
#define USB32DEV_PROT_EP_INTR_MASK_EP_OUT_MASK_Msk 0xFFFF0000UL
/* USB32DEV_PROT.PROT_EP_INTR_MASKED */
#define USB32DEV_PROT_EP_INTR_MASKED_EP_IN_MASKED_Pos 0UL
#define USB32DEV_PROT_EP_INTR_MASKED_EP_IN_MASKED_Msk 0xFFFFUL
#define USB32DEV_PROT_EP_INTR_MASKED_EP_OUT_MASKED_Pos 16UL
#define USB32DEV_PROT_EP_INTR_MASKED_EP_OUT_MASKED_Msk 0xFFFF0000UL
/* USB32DEV_PROT.PROT_DEVICE_NOTIF_FUNC_WAKE */
#define USB32DEV_PROT_DEVICE_NOTIF_FUNC_WAKE_INTERFACE_Pos 0UL
#define USB32DEV_PROT_DEVICE_NOTIF_FUNC_WAKE_INTERFACE_Msk 0xFFUL
#define USB32DEV_PROT_DEVICE_NOTIF_FUNC_WAKE_REQUEST_Pos 31UL
#define USB32DEV_PROT_DEVICE_NOTIF_FUNC_WAKE_REQUEST_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_DEVICE_NOTIF_LTM */
#define USB32DEV_PROT_DEVICE_NOTIF_LTM_BELT_LATENCY_Pos 0UL
#define USB32DEV_PROT_DEVICE_NOTIF_LTM_BELT_LATENCY_Msk 0x3FFUL
#define USB32DEV_PROT_DEVICE_NOTIF_LTM_BELT_SCALE_Pos 10UL
#define USB32DEV_PROT_DEVICE_NOTIF_LTM_BELT_SCALE_Msk 0xC00UL
#define USB32DEV_PROT_DEVICE_NOTIF_LTM_REQUEST_Pos 31UL
#define USB32DEV_PROT_DEVICE_NOTIF_LTM_REQUEST_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_DEVICE_NOTIF_BIAM */
#define USB32DEV_PROT_DEVICE_NOTIF_BIAM_BIA_Pos 0UL
#define USB32DEV_PROT_DEVICE_NOTIF_BIAM_BIA_Msk 0xFFFFUL
#define USB32DEV_PROT_DEVICE_NOTIF_BIAM_REQUEST_Pos 31UL
#define USB32DEV_PROT_DEVICE_NOTIF_BIAM_REQUEST_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_LMP_PORT_CAPABILITY_TIMER */
#define USB32DEV_PROT_LMP_PORT_CAPABILITY_TIMER_RX_TIMEOUT_Pos 0UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITY_TIMER_RX_TIMEOUT_Msk 0x7FFFUL
#define USB32DEV_PROT_LMP_PORT_CAPABILITY_TIMER_RX_DISABLE_Pos 15UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITY_TIMER_RX_DISABLE_Msk 0x8000UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITY_TIMER_TX_TIMEOUT_Pos 16UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITY_TIMER_TX_TIMEOUT_Msk 0x7FFF0000UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITY_TIMER_TX_DISABLE_Pos 31UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITY_TIMER_TX_DISABLE_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_LMP_PORT_CONFIGURATION_TIMER */
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TIMER_RX_TIMEOUT_Pos 0UL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TIMER_RX_TIMEOUT_Msk 0x7FFFUL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TIMER_RX_DISABLE_Pos 15UL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TIMER_RX_DISABLE_Msk 0x8000UL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TIMER_TX_TIMEOUT_Pos 16UL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TIMER_TX_TIMEOUT_Msk 0x7FFF0000UL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TIMER_TX_DISABLE_Pos 31UL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TIMER_TX_DISABLE_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_PING_TIMEOUT */
#define USB32DEV_PROT_PING_TIMEOUT_PING_TIMEOUT_Pos 0UL
#define USB32DEV_PROT_PING_TIMEOUT_PING_TIMEOUT_Msk 0xFFFFFFUL
#define USB32DEV_PROT_PING_TIMEOUT_PING_DISABLE_Pos 31UL
#define USB32DEV_PROT_PING_TIMEOUT_PING_DISABLE_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_FRAMECNT */
#define USB32DEV_PROT_FRAMECNT_SS_MICROFRAME_Pos 0UL
#define USB32DEV_PROT_FRAMECNT_SS_MICROFRAME_Msk 0x3FFFUL
#define USB32DEV_PROT_FRAMECNT_DELTA_Pos 14UL
#define USB32DEV_PROT_FRAMECNT_DELTA_Msk 0x7FFC000UL
/* USB32DEV_PROT.PROT_ITP_CORRECTION */
#define USB32DEV_PROT_ITP_CORRECTION_CORRECTION_Pos 0UL
#define USB32DEV_PROT_ITP_CORRECTION_CORRECTION_Msk 0x3FFFUL
/* USB32DEV_PROT.PROT_SETUPDAT0 */
#define USB32DEV_PROT_SETUPDAT0_SETUP_REQUEST_TYPE_Pos 0UL
#define USB32DEV_PROT_SETUPDAT0_SETUP_REQUEST_TYPE_Msk 0xFFUL
#define USB32DEV_PROT_SETUPDAT0_SETUP_REQUEST_Pos 8UL
#define USB32DEV_PROT_SETUPDAT0_SETUP_REQUEST_Msk 0xFF00UL
#define USB32DEV_PROT_SETUPDAT0_SETUP_VALUE_Pos 16UL
#define USB32DEV_PROT_SETUPDAT0_SETUP_VALUE_Msk 0xFFFF0000UL
/* USB32DEV_PROT.PROT_SETUPDAT1 */
#define USB32DEV_PROT_SETUPDAT1_SETUP_INDEX_Pos 0UL
#define USB32DEV_PROT_SETUPDAT1_SETUP_INDEX_Msk 0xFFFFUL
#define USB32DEV_PROT_SETUPDAT1_SETUP_LENGTH_Pos 16UL
#define USB32DEV_PROT_SETUPDAT1_SETUP_LENGTH_Msk 0xFFFF0000UL
/* USB32DEV_PROT.PROT_SEQ_NUM */
#define USB32DEV_PROT_SEQ_NUM_INGRESS_EP_NUM_Pos 0UL
#define USB32DEV_PROT_SEQ_NUM_INGRESS_EP_NUM_Msk 0xFUL
#define USB32DEV_PROT_SEQ_NUM_INGRESS_READ_SEQ_NUM_Pos 4UL
#define USB32DEV_PROT_SEQ_NUM_INGRESS_READ_SEQ_NUM_Msk 0x1F0UL
#define USB32DEV_PROT_SEQ_NUM_INGRESS_WRITE_SEQ_NUM_Pos 9UL
#define USB32DEV_PROT_SEQ_NUM_INGRESS_WRITE_SEQ_NUM_Msk 0x3E00UL
#define USB32DEV_PROT_SEQ_NUM_EGRESS_EP_NUM_Pos 16UL
#define USB32DEV_PROT_SEQ_NUM_EGRESS_EP_NUM_Msk 0xF0000UL
#define USB32DEV_PROT_SEQ_NUM_EGRESS_READ_SEQ_NUM_Pos 20UL
#define USB32DEV_PROT_SEQ_NUM_EGRESS_READ_SEQ_NUM_Msk 0x1F00000UL
#define USB32DEV_PROT_SEQ_NUM_EGRESS_WRITE_SEQ_NUM_Pos 25UL
#define USB32DEV_PROT_SEQ_NUM_EGRESS_WRITE_SEQ_NUM_Msk 0x3E000000UL
/* USB32DEV_PROT.PROT_LMP_RECEIVED */
#define USB32DEV_PROT_LMP_RECEIVED_U2_INACTIVITY_TIMEOUT_Pos 0UL
#define USB32DEV_PROT_LMP_RECEIVED_U2_INACTIVITY_TIMEOUT_Msk 0xFFUL
#define USB32DEV_PROT_LMP_RECEIVED_FORCE_LINKPM_ACCEPT_Pos 8UL
#define USB32DEV_PROT_LMP_RECEIVED_FORCE_LINKPM_ACCEPT_Msk 0x100UL
/* USB32DEV_PROT.PROT_LMP_OVERRIDE */
#define USB32DEV_PROT_LMP_OVERRIDE_U2_INACTIVITY_TIMEOUT_Pos 0UL
#define USB32DEV_PROT_LMP_OVERRIDE_U2_INACTIVITY_TIMEOUT_Msk 0xFFUL
#define USB32DEV_PROT_LMP_OVERRIDE_FORCE_LINKPM_ACCEPT_Pos 8UL
#define USB32DEV_PROT_LMP_OVERRIDE_FORCE_LINKPM_ACCEPT_Msk 0x100UL
#define USB32DEV_PROT_LMP_OVERRIDE_INACITIVITY_TIMEOUT_OVR_Pos 29UL
#define USB32DEV_PROT_LMP_OVERRIDE_INACITIVITY_TIMEOUT_OVR_Msk 0x20000000UL
#define USB32DEV_PROT_LMP_OVERRIDE_LINKPM_ACCEPT_OVR_Pos 30UL
#define USB32DEV_PROT_LMP_OVERRIDE_LINKPM_ACCEPT_OVR_Msk 0x40000000UL
#define USB32DEV_PROT_LMP_OVERRIDE_LMP_SEND_Pos 31UL
#define USB32DEV_PROT_LMP_OVERRIDE_LMP_SEND_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_LMP_PORT_CAPABILITIES_RX */
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_RX_LINK_SPEED_Pos 0UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_RX_LINK_SPEED_Msk 0x7FUL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_RX_NUM_HP_BUFFERS_Pos 7UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_RX_NUM_HP_BUFFERS_Msk 0x7F80UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_RX_DIRECTION_Pos 15UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_RX_DIRECTION_Msk 0x18000UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_RX_TIEBREAKER_Pos 17UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_RX_TIEBREAKER_Msk 0x1E0000UL
/* USB32DEV_PROT.PROT_LMP_PORT_CAPABILITIES_TX */
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_LINK_SPEED_Pos 0UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_LINK_SPEED_Msk 0x7FUL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_NUM_HP_BUFFERS_Pos 7UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_NUM_HP_BUFFERS_Msk 0x7F80UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_DIRECTION_Pos 15UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_DIRECTION_Msk 0x18000UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_TIEBREAKER_Pos 17UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_TIEBREAKER_Msk 0x1E0000UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_LMP_SEND_Pos 31UL
#define USB32DEV_PROT_LMP_PORT_CAPABILITIES_TX_LMP_SEND_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_LMP_PORT_CONFIGURATION_RX */
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_RX_LINK_SPEED_Pos 0UL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_RX_LINK_SPEED_Msk 0x7FUL
/* USB32DEV_PROT.PROT_LMP_PORT_CONFIGURATION_TX */
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TX_LINK_SPEED_Pos 0UL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TX_LINK_SPEED_Msk 0x7FUL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TX_LMP_SEND_Pos 31UL
#define USB32DEV_PROT_LMP_PORT_CONFIGURATION_TX_LMP_SEND_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_STREAM_ERROR_DISABLE */
#define USB32DEV_PROT_STREAM_ERROR_DISABLE_TYPE_Pos 0UL
#define USB32DEV_PROT_STREAM_ERROR_DISABLE_TYPE_Msk 0x3FUL
/* USB32DEV_PROT.PROT_STREAM_ERROR_STATUS */
#define USB32DEV_PROT_STREAM_ERROR_STATUS_ID_Pos 0UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_ID_Msk 0xFFFFUL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_EP_NUM_Pos 16UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_EP_NUM_Msk 0xF0000UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_EP_IO_Pos 20UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_EP_IO_Msk 0x100000UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_ERROR_TYPE_Pos 21UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_ERROR_TYPE_Msk 0x7E00000UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_ERROR_STATE_Pos 27UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_ERROR_STATE_Msk 0x38000000UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_ERROR_DETECTED_Pos 31UL
#define USB32DEV_PROT_STREAM_ERROR_STATUS_ERROR_DETECTED_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_LMP_PACKET_RX */
