RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
#define USB32DEV_PROT_LMP_PACKET_RX_LMP_PACKET_Pos 0UL
#define USB32DEV_PROT_LMP_PACKET_RX_LMP_PACKET_Msk 0xFFFFFFFFUL
/* USB32DEV_PROT.PROT_LMP_PACKET_TX */
#define USB32DEV_PROT_LMP_PACKET_TX_LMP_PACKET_Pos 0UL
#define USB32DEV_PROT_LMP_PACKET_TX_LMP_PACKET_Msk 0xFFFFFFFFUL
/* USB32DEV_PROT.PROT_EPI_INTR */
#define USB32DEV_PROT_EPI_INTR_COMMIT_Pos 0UL
#define USB32DEV_PROT_EPI_INTR_COMMIT_Msk 0x1UL
#define USB32DEV_PROT_EPI_INTR_RETRY_Pos 1UL
#define USB32DEV_PROT_EPI_INTR_RETRY_Msk 0x2UL
#define USB32DEV_PROT_EPI_INTR_FLOWCONTROL_Pos 2UL
#define USB32DEV_PROT_EPI_INTR_FLOWCONTROL_Msk 0x4UL
#define USB32DEV_PROT_EPI_INTR_ZERO_Pos 4UL
#define USB32DEV_PROT_EPI_INTR_ZERO_Msk 0x10UL
#define USB32DEV_PROT_EPI_INTR_SHORT_Pos 5UL
#define USB32DEV_PROT_EPI_INTR_SHORT_Msk 0x20UL
#define USB32DEV_PROT_EPI_INTR_OOSERR_Pos 6UL
#define USB32DEV_PROT_EPI_INTR_OOSERR_Msk 0x40UL
#define USB32DEV_PROT_EPI_INTR_DBTERM_Pos 8UL
#define USB32DEV_PROT_EPI_INTR_DBTERM_Msk 0x100UL
#define USB32DEV_PROT_EPI_INTR_STREAM_ERROR_Pos 9UL
#define USB32DEV_PROT_EPI_INTR_STREAM_ERROR_Msk 0x200UL
#define USB32DEV_PROT_EPI_INTR_FIRST_ACK_NUMP_0_Pos 10UL
#define USB32DEV_PROT_EPI_INTR_FIRST_ACK_NUMP_0_Msk 0x400UL
#define USB32DEV_PROT_EPI_INTR_STREAM_ST_CHG_Pos 16UL
#define USB32DEV_PROT_EPI_INTR_STREAM_ST_CHG_Msk 0x10000UL
#define USB32DEV_PROT_EPI_INTR_FLOWCONTROL_EXIT_Pos 17UL
#define USB32DEV_PROT_EPI_INTR_FLOWCONTROL_EXIT_Msk 0x20000UL
#define USB32DEV_PROT_EPI_INTR_SPARE_REG_Pos 18UL
#define USB32DEV_PROT_EPI_INTR_SPARE_REG_Msk 0x40000UL
/* USB32DEV_PROT.PROT_EPI_INTR_SET */
#define USB32DEV_PROT_EPI_INTR_SET_COMMIT_Pos 0UL
#define USB32DEV_PROT_EPI_INTR_SET_COMMIT_Msk 0x1UL
#define USB32DEV_PROT_EPI_INTR_SET_RETRY_Pos 1UL
#define USB32DEV_PROT_EPI_INTR_SET_RETRY_Msk 0x2UL
#define USB32DEV_PROT_EPI_INTR_SET_FLOWCONTROL_Pos 2UL
#define USB32DEV_PROT_EPI_INTR_SET_FLOWCONTROL_Msk 0x4UL
#define USB32DEV_PROT_EPI_INTR_SET_ZERO_Pos 4UL
#define USB32DEV_PROT_EPI_INTR_SET_ZERO_Msk 0x10UL
#define USB32DEV_PROT_EPI_INTR_SET_SHORT_Pos 5UL
#define USB32DEV_PROT_EPI_INTR_SET_SHORT_Msk 0x20UL
#define USB32DEV_PROT_EPI_INTR_SET_OOSERR_Pos 6UL
#define USB32DEV_PROT_EPI_INTR_SET_OOSERR_Msk 0x40UL
#define USB32DEV_PROT_EPI_INTR_SET_DBTERM_Pos 8UL
#define USB32DEV_PROT_EPI_INTR_SET_DBTERM_Msk 0x100UL
#define USB32DEV_PROT_EPI_INTR_SET_STREAM_ERROR_Pos 9UL
#define USB32DEV_PROT_EPI_INTR_SET_STREAM_ERROR_Msk 0x200UL
#define USB32DEV_PROT_EPI_INTR_SET_FIRST_ACK_NUMP_0_Pos 10UL
#define USB32DEV_PROT_EPI_INTR_SET_FIRST_ACK_NUMP_0_Msk 0x400UL
#define USB32DEV_PROT_EPI_INTR_SET_STREAM_ST_CHG_Pos 16UL
#define USB32DEV_PROT_EPI_INTR_SET_STREAM_ST_CHG_Msk 0x10000UL
#define USB32DEV_PROT_EPI_INTR_SET_FLOWCONTROL_EXIT_Pos 17UL
#define USB32DEV_PROT_EPI_INTR_SET_FLOWCONTROL_EXIT_Msk 0x20000UL
#define USB32DEV_PROT_EPI_INTR_SET_SPARE_REG_Pos 18UL
#define USB32DEV_PROT_EPI_INTR_SET_SPARE_REG_Msk 0x40000UL
/* USB32DEV_PROT.PROT_EPI_INTR_MASK */
#define USB32DEV_PROT_EPI_INTR_MASK_COMMIT_MASK_Pos 0UL
#define USB32DEV_PROT_EPI_INTR_MASK_COMMIT_MASK_Msk 0x1UL
#define USB32DEV_PROT_EPI_INTR_MASK_RETRY_MASK_Pos 1UL
#define USB32DEV_PROT_EPI_INTR_MASK_RETRY_MASK_Msk 0x2UL
#define USB32DEV_PROT_EPI_INTR_MASK_FLOWCONTROL_MASK_Pos 2UL
#define USB32DEV_PROT_EPI_INTR_MASK_FLOWCONTROL_MASK_Msk 0x4UL
#define USB32DEV_PROT_EPI_INTR_MASK_ZERO_MASK_Pos 4UL
#define USB32DEV_PROT_EPI_INTR_MASK_ZERO_MASK_Msk 0x10UL
#define USB32DEV_PROT_EPI_INTR_MASK_SHORT_MASK_Pos 5UL
#define USB32DEV_PROT_EPI_INTR_MASK_SHORT_MASK_Msk 0x20UL
#define USB32DEV_PROT_EPI_INTR_MASK_OOSERR_MASK_Pos 6UL
#define USB32DEV_PROT_EPI_INTR_MASK_OOSERR_MASK_Msk 0x40UL
#define USB32DEV_PROT_EPI_INTR_MASK_DBTERM_MASK_Pos 8UL
#define USB32DEV_PROT_EPI_INTR_MASK_DBTERM_MASK_Msk 0x100UL
#define USB32DEV_PROT_EPI_INTR_MASK_STREAM_ERROR_MASK_Pos 9UL
#define USB32DEV_PROT_EPI_INTR_MASK_STREAM_ERROR_MASK_Msk 0x200UL
#define USB32DEV_PROT_EPI_INTR_MASK_FIRST_ACK_NUMP_0_MASK_Pos 10UL
#define USB32DEV_PROT_EPI_INTR_MASK_FIRST_ACK_NUMP_0_MASK_Msk 0x400UL
#define USB32DEV_PROT_EPI_INTR_MASK_STREAM_ST_CHG_MASK_Pos 16UL
#define USB32DEV_PROT_EPI_INTR_MASK_STREAM_ST_CHG_MASK_Msk 0x10000UL
#define USB32DEV_PROT_EPI_INTR_MASK_FLOWCONTROL_EXIT_MASK_Pos 17UL
#define USB32DEV_PROT_EPI_INTR_MASK_FLOWCONTROL_EXIT_MASK_Msk 0x20000UL
#define USB32DEV_PROT_EPI_INTR_MASK_SPARE_REG_MASK_Pos 18UL
#define USB32DEV_PROT_EPI_INTR_MASK_SPARE_REG_MASK_Msk 0x40000UL
/* USB32DEV_PROT.PROT_EPI_INTR_MASKED */
#define USB32DEV_PROT_EPI_INTR_MASKED_COMMIT_MASKED_Pos 0UL
#define USB32DEV_PROT_EPI_INTR_MASKED_COMMIT_MASKED_Msk 0x1UL
#define USB32DEV_PROT_EPI_INTR_MASKED_RETRY_MASKED_Pos 1UL
#define USB32DEV_PROT_EPI_INTR_MASKED_RETRY_MASKED_Msk 0x2UL
#define USB32DEV_PROT_EPI_INTR_MASKED_FLOWCONTROL_MASKED_Pos 2UL
#define USB32DEV_PROT_EPI_INTR_MASKED_FLOWCONTROL_MASKED_Msk 0x4UL
#define USB32DEV_PROT_EPI_INTR_MASKED_ZERO_MASKED_Pos 4UL
#define USB32DEV_PROT_EPI_INTR_MASKED_ZERO_MASKED_Msk 0x10UL
#define USB32DEV_PROT_EPI_INTR_MASKED_SHORT_MASKED_Pos 5UL
#define USB32DEV_PROT_EPI_INTR_MASKED_SHORT_MASKED_Msk 0x20UL
#define USB32DEV_PROT_EPI_INTR_MASKED_OOSERR_MASKED_Pos 6UL
#define USB32DEV_PROT_EPI_INTR_MASKED_OOSERR_MASKED_Msk 0x40UL
#define USB32DEV_PROT_EPI_INTR_MASKED_DBTERM_MASKED_Pos 8UL
#define USB32DEV_PROT_EPI_INTR_MASKED_DBTERM_MASKED_Msk 0x100UL
#define USB32DEV_PROT_EPI_INTR_MASKED_STREAM_ERROR_MASKED_Pos 9UL
#define USB32DEV_PROT_EPI_INTR_MASKED_STREAM_ERROR_MASKED_Msk 0x200UL
#define USB32DEV_PROT_EPI_INTR_MASKED_FIRST_ACK_NUMP_0_MASKED_Pos 10UL
#define USB32DEV_PROT_EPI_INTR_MASKED_FIRST_ACK_NUMP_0_MASKED_Msk 0x400UL
#define USB32DEV_PROT_EPI_INTR_MASKED_STREAM_ST_CHG_MASKED_Pos 16UL
#define USB32DEV_PROT_EPI_INTR_MASKED_STREAM_ST_CHG_MASKED_Msk 0x10000UL
#define USB32DEV_PROT_EPI_INTR_MASKED_FLOWCONTROL_EXIT_MASKED_Pos 17UL
#define USB32DEV_PROT_EPI_INTR_MASKED_FLOWCONTROL_EXIT_MASKED_Msk 0x20000UL
#define USB32DEV_PROT_EPI_INTR_MASKED_SPARE_REG_MASKED_Pos 18UL
#define USB32DEV_PROT_EPI_INTR_MASKED_SPARE_REG_MASKED_Msk 0x40000UL
/* USB32DEV_PROT.PROT_EPI_CS1 */
#define USB32DEV_PROT_EPI_CS1_VALID_Pos 0UL
#define USB32DEV_PROT_EPI_CS1_VALID_Msk 0x1UL
#define USB32DEV_PROT_EPI_CS1_NRDY_Pos 1UL
#define USB32DEV_PROT_EPI_CS1_NRDY_Msk 0x2UL
#define USB32DEV_PROT_EPI_CS1_STALL_Pos 2UL
#define USB32DEV_PROT_EPI_CS1_STALL_Msk 0x4UL
#define USB32DEV_PROT_EPI_CS1_STREAM_EN_Pos 3UL
#define USB32DEV_PROT_EPI_CS1_STREAM_EN_Msk 0x8UL
#define USB32DEV_PROT_EPI_CS1_EP_RESET_Pos 4UL
#define USB32DEV_PROT_EPI_CS1_EP_RESET_Msk 0x10UL
#define USB32DEV_PROT_EPI_CS1_ERDY_FLOWCONTROL_Pos 8UL
#define USB32DEV_PROT_EPI_CS1_ERDY_FLOWCONTROL_Msk 0x100UL
/* USB32DEV_PROT.PROT_EPI_CS2 */
#define USB32DEV_PROT_EPI_CS2_EPI_TYPE_Pos 0UL
#define USB32DEV_PROT_EPI_CS2_EPI_TYPE_Msk 0x3UL
#define USB32DEV_PROT_EPI_CS2_SPARE_Pos 2UL
#define USB32DEV_PROT_EPI_CS2_SPARE_Msk 0xFCUL
#define USB32DEV_PROT_EPI_CS2_MAXBURST_Pos 8UL
#define USB32DEV_PROT_EPI_CS2_MAXBURST_Msk 0xF00UL
#define USB32DEV_PROT_EPI_CS2_ISOINPKS_Pos 17UL
#define USB32DEV_PROT_EPI_CS2_ISOINPKS_Msk 0x1FE0000UL
#define USB32DEV_PROT_EPI_CS2_BINTERVAL_Pos 25UL
#define USB32DEV_PROT_EPI_CS2_BINTERVAL_Msk 0x1E000000UL
/* USB32DEV_PROT.PROT_EPI_UNMAPPED_STREAM */
#define USB32DEV_PROT_EPI_UNMAPPED_STREAM_SPSM_STATE_Pos 16UL
#define USB32DEV_PROT_EPI_UNMAPPED_STREAM_SPSM_STATE_Msk 0xF0000UL
#define USB32DEV_PROT_EPI_UNMAPPED_STREAM_COMMAND_Pos 30UL
#define USB32DEV_PROT_EPI_UNMAPPED_STREAM_COMMAND_Msk 0x40000000UL
/* USB32DEV_PROT.PROT_EPI_MAPPED_STREAM */
#define USB32DEV_PROT_EPI_MAPPED_STREAM_STREAM_ID_Pos 0UL
#define USB32DEV_PROT_EPI_MAPPED_STREAM_STREAM_ID_Msk 0xFFFFUL
#define USB32DEV_PROT_EPI_MAPPED_STREAM_EP_NUMBER_Pos 16UL
#define USB32DEV_PROT_EPI_MAPPED_STREAM_EP_NUMBER_Msk 0xF0000UL
#define USB32DEV_PROT_EPI_MAPPED_STREAM_UNMAPPED_Pos 29UL
#define USB32DEV_PROT_EPI_MAPPED_STREAM_UNMAPPED_Msk 0x20000000UL
#define USB32DEV_PROT_EPI_MAPPED_STREAM_UNMAP_Pos 30UL
#define USB32DEV_PROT_EPI_MAPPED_STREAM_UNMAP_Msk 0x40000000UL
#define USB32DEV_PROT_EPI_MAPPED_STREAM_ENABLE_Pos 31UL
#define USB32DEV_PROT_EPI_MAPPED_STREAM_ENABLE_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_EPO_INTR */
#define USB32DEV_PROT_EPO_INTR_COMMIT_Pos 0UL
#define USB32DEV_PROT_EPO_INTR_COMMIT_Msk 0x1UL
#define USB32DEV_PROT_EPO_INTR_RETRY_Pos 1UL
#define USB32DEV_PROT_EPO_INTR_RETRY_Msk 0x2UL
#define USB32DEV_PROT_EPO_INTR_FLOWCONTROL_Pos 2UL
#define USB32DEV_PROT_EPO_INTR_FLOWCONTROL_Msk 0x4UL
#define USB32DEV_PROT_EPO_INTR_ZERO_Pos 4UL
#define USB32DEV_PROT_EPO_INTR_ZERO_Msk 0x10UL
#define USB32DEV_PROT_EPO_INTR_SHORT_Pos 5UL
#define USB32DEV_PROT_EPO_INTR_SHORT_Msk 0x20UL
#define USB32DEV_PROT_EPO_INTR_OOSERR_Pos 6UL
#define USB32DEV_PROT_EPO_INTR_OOSERR_Msk 0x40UL
#define USB32DEV_PROT_EPO_INTR_STREAM_ERROR_Pos 9UL
#define USB32DEV_PROT_EPO_INTR_STREAM_ERROR_Msk 0x200UL
#define USB32DEV_PROT_EPO_INTR_PP_ZERO_Pos 11UL
#define USB32DEV_PROT_EPO_INTR_PP_ZERO_Msk 0x800UL
#define USB32DEV_PROT_EPO_INTR_EOB_ONE_Pos 12UL
#define USB32DEV_PROT_EPO_INTR_EOB_ONE_Msk 0x1000UL
#define USB32DEV_PROT_EPO_INTR_STREAM_ST_CHG_Pos 16UL
#define USB32DEV_PROT_EPO_INTR_STREAM_ST_CHG_Msk 0x10000UL
#define USB32DEV_PROT_EPO_INTR_FLOWCONTROL_EXIT_Pos 17UL
#define USB32DEV_PROT_EPO_INTR_FLOWCONTROL_EXIT_Msk 0x20000UL
#define USB32DEV_PROT_EPO_INTR_SPARE_REG_Pos 18UL
#define USB32DEV_PROT_EPO_INTR_SPARE_REG_Msk 0x40000UL
/* USB32DEV_PROT.PROT_EPO_INTR_SET */
#define USB32DEV_PROT_EPO_INTR_SET_COMMIT_Pos 0UL
#define USB32DEV_PROT_EPO_INTR_SET_COMMIT_Msk 0x1UL
#define USB32DEV_PROT_EPO_INTR_SET_RETRY_Pos 1UL
#define USB32DEV_PROT_EPO_INTR_SET_RETRY_Msk 0x2UL
#define USB32DEV_PROT_EPO_INTR_SET_FLOWCONTROL_Pos 2UL
#define USB32DEV_PROT_EPO_INTR_SET_FLOWCONTROL_Msk 0x4UL
#define USB32DEV_PROT_EPO_INTR_SET_ZERO_Pos 4UL
#define USB32DEV_PROT_EPO_INTR_SET_ZERO_Msk 0x10UL
#define USB32DEV_PROT_EPO_INTR_SET_SHORT_Pos 5UL
#define USB32DEV_PROT_EPO_INTR_SET_SHORT_Msk 0x20UL
#define USB32DEV_PROT_EPO_INTR_SET_OOSERR_Pos 6UL
#define USB32DEV_PROT_EPO_INTR_SET_OOSERR_Msk 0x40UL
#define USB32DEV_PROT_EPO_INTR_SET_STREAM_ERROR_Pos 9UL
#define USB32DEV_PROT_EPO_INTR_SET_STREAM_ERROR_Msk 0x200UL
#define USB32DEV_PROT_EPO_INTR_SET_PP_ZERO_Pos 11UL
#define USB32DEV_PROT_EPO_INTR_SET_PP_ZERO_Msk 0x800UL
#define USB32DEV_PROT_EPO_INTR_SET_EOB_ONE_Pos 12UL
#define USB32DEV_PROT_EPO_INTR_SET_EOB_ONE_Msk 0x1000UL
#define USB32DEV_PROT_EPO_INTR_SET_STREAM_ST_CHG_Pos 16UL
#define USB32DEV_PROT_EPO_INTR_SET_STREAM_ST_CHG_Msk 0x10000UL
#define USB32DEV_PROT_EPO_INTR_SET_FLOWCONTROL_EXIT_Pos 17UL
#define USB32DEV_PROT_EPO_INTR_SET_FLOWCONTROL_EXIT_Msk 0x20000UL
#define USB32DEV_PROT_EPO_INTR_SET_SPARE_REG_Pos 18UL
#define USB32DEV_PROT_EPO_INTR_SET_SPARE_REG_Msk 0x40000UL
/* USB32DEV_PROT.PROT_EPO_INTR_MASK */
#define USB32DEV_PROT_EPO_INTR_MASK_COMMIT_MASK_Pos 0UL
#define USB32DEV_PROT_EPO_INTR_MASK_COMMIT_MASK_Msk 0x1UL
#define USB32DEV_PROT_EPO_INTR_MASK_RETRY_MASK_Pos 1UL
#define USB32DEV_PROT_EPO_INTR_MASK_RETRY_MASK_Msk 0x2UL
#define USB32DEV_PROT_EPO_INTR_MASK_FLOWCONTROL_MASK_Pos 2UL
#define USB32DEV_PROT_EPO_INTR_MASK_FLOWCONTROL_MASK_Msk 0x4UL
#define USB32DEV_PROT_EPO_INTR_MASK_ZERO_MASK_Pos 4UL
#define USB32DEV_PROT_EPO_INTR_MASK_ZERO_MASK_Msk 0x10UL
#define USB32DEV_PROT_EPO_INTR_MASK_SHORT_MASK_Pos 5UL
#define USB32DEV_PROT_EPO_INTR_MASK_SHORT_MASK_Msk 0x20UL
#define USB32DEV_PROT_EPO_INTR_MASK_OOSERR_MASK_Pos 6UL
#define USB32DEV_PROT_EPO_INTR_MASK_OOSERR_MASK_Msk 0x40UL
#define USB32DEV_PROT_EPO_INTR_MASK_STREAM_ERROR_MASK_Pos 9UL
#define USB32DEV_PROT_EPO_INTR_MASK_STREAM_ERROR_MASK_Msk 0x200UL
#define USB32DEV_PROT_EPO_INTR_MASK_PP_ZERO_MASK_Pos 11UL
#define USB32DEV_PROT_EPO_INTR_MASK_PP_ZERO_MASK_Msk 0x800UL
#define USB32DEV_PROT_EPO_INTR_MASK_EOB_ONE_MASK_Pos 12UL
#define USB32DEV_PROT_EPO_INTR_MASK_EOB_ONE_MASK_Msk 0x1000UL
#define USB32DEV_PROT_EPO_INTR_MASK_STREAM_ST_CHG_MASK_Pos 16UL
#define USB32DEV_PROT_EPO_INTR_MASK_STREAM_ST_CHG_MASK_Msk 0x10000UL
#define USB32DEV_PROT_EPO_INTR_MASK_FLOWCONTROL_EXIT_MASK_Pos 17UL
#define USB32DEV_PROT_EPO_INTR_MASK_FLOWCONTROL_EXIT_MASK_Msk 0x20000UL
#define USB32DEV_PROT_EPO_INTR_MASK_SPARE_REG_MASK_Pos 18UL
#define USB32DEV_PROT_EPO_INTR_MASK_SPARE_REG_MASK_Msk 0x40000UL
/* USB32DEV_PROT.PROT_EPO_INTR_MASKED */
#define USB32DEV_PROT_EPO_INTR_MASKED_COMMIT_MASKED_Pos 0UL
#define USB32DEV_PROT_EPO_INTR_MASKED_COMMIT_MASKED_Msk 0x1UL
#define USB32DEV_PROT_EPO_INTR_MASKED_RETRY_MASKED_Pos 1UL
#define USB32DEV_PROT_EPO_INTR_MASKED_RETRY_MASKED_Msk 0x2UL
#define USB32DEV_PROT_EPO_INTR_MASKED_FLOWCONTROL_MASKED_Pos 2UL
#define USB32DEV_PROT_EPO_INTR_MASKED_FLOWCONTROL_MASKED_Msk 0x4UL
#define USB32DEV_PROT_EPO_INTR_MASKED_ZERO_MASKED_Pos 4UL
#define USB32DEV_PROT_EPO_INTR_MASKED_ZERO_MASKED_Msk 0x10UL
#define USB32DEV_PROT_EPO_INTR_MASKED_SHORT_MASKED_Pos 5UL
#define USB32DEV_PROT_EPO_INTR_MASKED_SHORT_MASKED_Msk 0x20UL
#define USB32DEV_PROT_EPO_INTR_MASKED_OOSERR_MASKED_Pos 6UL
#define USB32DEV_PROT_EPO_INTR_MASKED_OOSERR_MASKED_Msk 0x40UL
#define USB32DEV_PROT_EPO_INTR_MASKED_STREAM_ERROR_MASKED_Pos 9UL
#define USB32DEV_PROT_EPO_INTR_MASKED_STREAM_ERROR_MASKED_Msk 0x200UL
#define USB32DEV_PROT_EPO_INTR_MASKED_PP_ZERO_MASKED_Pos 11UL
#define USB32DEV_PROT_EPO_INTR_MASKED_PP_ZERO_MASKED_Msk 0x800UL
#define USB32DEV_PROT_EPO_INTR_MASKED_EOB_ONE_MASKED_Pos 12UL
#define USB32DEV_PROT_EPO_INTR_MASKED_EOB_ONE_MASKED_Msk 0x1000UL
#define USB32DEV_PROT_EPO_INTR_MASKED_STREAM_ST_CHG_MASKED_Pos 16UL
#define USB32DEV_PROT_EPO_INTR_MASKED_STREAM_ST_CHG_MASKED_Msk 0x10000UL
#define USB32DEV_PROT_EPO_INTR_MASKED_FLOWCONTROL_EXIT_MASKED_Pos 17UL
#define USB32DEV_PROT_EPO_INTR_MASKED_FLOWCONTROL_EXIT_MASKED_Msk 0x20000UL
#define USB32DEV_PROT_EPO_INTR_MASKED_SPARE_REG_MASKED_Pos 18UL
#define USB32DEV_PROT_EPO_INTR_MASKED_SPARE_REG_MASKED_Msk 0x40000UL
/* USB32DEV_PROT.PROT_EPO_CS1 */
#define USB32DEV_PROT_EPO_CS1_VALID_Pos 0UL
#define USB32DEV_PROT_EPO_CS1_VALID_Msk 0x1UL
#define USB32DEV_PROT_EPO_CS1_NRDY_Pos 1UL
#define USB32DEV_PROT_EPO_CS1_NRDY_Msk 0x2UL
#define USB32DEV_PROT_EPO_CS1_STALL_Pos 2UL
#define USB32DEV_PROT_EPO_CS1_STALL_Msk 0x4UL
#define USB32DEV_PROT_EPO_CS1_STREAM_EN_Pos 3UL
#define USB32DEV_PROT_EPO_CS1_STREAM_EN_Msk 0x8UL
#define USB32DEV_PROT_EPO_CS1_EP_RESET_Pos 4UL
#define USB32DEV_PROT_EPO_CS1_EP_RESET_Msk 0x10UL
#define USB32DEV_PROT_EPO_CS1_EN_PP_ZERO_DET_Pos 6UL
#define USB32DEV_PROT_EPO_CS1_EN_PP_ZERO_DET_Msk 0x40UL
#define USB32DEV_PROT_EPO_CS1_EN_EOB_ONE_DET_Pos 7UL
#define USB32DEV_PROT_EPO_CS1_EN_EOB_ONE_DET_Msk 0x80UL
#define USB32DEV_PROT_EPO_CS1_ERDY_FLOWCONTROL_Pos 8UL
#define USB32DEV_PROT_EPO_CS1_ERDY_FLOWCONTROL_Msk 0x100UL
/* USB32DEV_PROT.PROT_EPO_CS2 */
#define USB32DEV_PROT_EPO_CS2_EPO_TYPE_Pos 0UL
#define USB32DEV_PROT_EPO_CS2_EPO_TYPE_Msk 0x3UL
#define USB32DEV_PROT_EPO_CS2_SPARE_Pos 2UL
#define USB32DEV_PROT_EPO_CS2_SPARE_Msk 0xFCUL
#define USB32DEV_PROT_EPO_CS2_MAXBURST_Pos 8UL
#define USB32DEV_PROT_EPO_CS2_MAXBURST_Msk 0xF00UL
#define USB32DEV_PROT_EPO_CS2_ISOINPKS_Pos 17UL
#define USB32DEV_PROT_EPO_CS2_ISOINPKS_Msk 0x1FE0000UL
/* USB32DEV_PROT.PROT_EPO_UNMAPPED_STREAM */
#define USB32DEV_PROT_EPO_UNMAPPED_STREAM_SPSM_STATE_Pos 16UL
#define USB32DEV_PROT_EPO_UNMAPPED_STREAM_SPSM_STATE_Msk 0xF0000UL
#define USB32DEV_PROT_EPO_UNMAPPED_STREAM_COMMAND_Pos 30UL
#define USB32DEV_PROT_EPO_UNMAPPED_STREAM_COMMAND_Msk 0x40000000UL
/* USB32DEV_PROT.PROT_EPO_MAPPED_STREAM */
#define USB32DEV_PROT_EPO_MAPPED_STREAM_STREAM_ID_Pos 0UL
#define USB32DEV_PROT_EPO_MAPPED_STREAM_STREAM_ID_Msk 0xFFFFUL
#define USB32DEV_PROT_EPO_MAPPED_STREAM_EP_NUMBER_Pos 16UL
#define USB32DEV_PROT_EPO_MAPPED_STREAM_EP_NUMBER_Msk 0xF0000UL
#define USB32DEV_PROT_EPO_MAPPED_STREAM_UNMAPPED_Pos 29UL
#define USB32DEV_PROT_EPO_MAPPED_STREAM_UNMAPPED_Msk 0x20000000UL
#define USB32DEV_PROT_EPO_MAPPED_STREAM_UNMAP_Pos 30UL
#define USB32DEV_PROT_EPO_MAPPED_STREAM_UNMAP_Msk 0x40000000UL
#define USB32DEV_PROT_EPO_MAPPED_STREAM_ENABLE_Pos 31UL
#define USB32DEV_PROT_EPO_MAPPED_STREAM_ENABLE_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_SUBLINK_DEV_NNOTIFICATION */
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_EN_SUBLINK_Pos 0UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_EN_SUBLINK_Msk 0x1UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_EN_SUBLINK_SET_ADDR0_Pos 1UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_EN_SUBLINK_SET_ADDR0_Msk 0x2UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_LSE_Pos 2UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_LSE_Msk 0xCUL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_ST_Pos 4UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_ST_Msk 0x30UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_LANES_Pos 6UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_LANES_Msk 0x3C0UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_LP_Pos 10UL
#define USB32DEV_PROT_SUBLINK_DEV_NNOTIFICATION_LP_Msk 0xC00UL
/* USB32DEV_PROT.PROT_SUBLINK_LSM */
#define USB32DEV_PROT_SUBLINK_LSM_RX_LSM_Pos 0UL
#define USB32DEV_PROT_SUBLINK_LSM_RX_LSM_Msk 0xFFFFUL
#define USB32DEV_PROT_SUBLINK_LSM_TX_LSM_Pos 16UL
#define USB32DEV_PROT_SUBLINK_LSM_TX_LSM_Msk 0xFFFF0000UL
/* USB32DEV_PROT.PROT_PTM_CONFIG */
#define USB32DEV_PROT_PTM_CONFIG_LDM_ENABLE_Pos 0UL
#define USB32DEV_PROT_PTM_CONFIG_LDM_ENABLE_Msk 0x1UL
#define USB32DEV_PROT_PTM_CONFIG_COUNTER_CFG_Pos 1UL
#define USB32DEV_PROT_PTM_CONFIG_COUNTER_CFG_Msk 0x2UL
#define USB32DEV_PROT_PTM_CONFIG_WAIT_ITP_Pos 2UL
#define USB32DEV_PROT_PTM_CONFIG_WAIT_ITP_Msk 0x4UL
#define USB32DEV_PROT_PTM_CONFIG_START_Pos 8UL
#define USB32DEV_PROT_PTM_CONFIG_START_Msk 0x100UL
#define USB32DEV_PROT_PTM_CONFIG_STATE_CHANGE_SEL_Pos 9UL
#define USB32DEV_PROT_PTM_CONFIG_STATE_CHANGE_SEL_Msk 0xE00UL
#define USB32DEV_PROT_PTM_CONFIG_LMP_SEND_Pos 31UL
#define USB32DEV_PROT_PTM_CONFIG_LMP_SEND_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_FW_PTM_COUNTER */
#define USB32DEV_PROT_FW_PTM_COUNTER_LOAD_Pos 0UL
#define USB32DEV_PROT_FW_PTM_COUNTER_LOAD_Msk 0x1UL
#define USB32DEV_PROT_FW_PTM_COUNTER_VALUE_Pos 1UL
#define USB32DEV_PROT_FW_PTM_COUNTER_VALUE_Msk 0xFFFFFFEUL
/* USB32DEV_PROT.PROT_HW_PTM_COUNTER */
#define USB32DEV_PROT_HW_PTM_COUNTER_READ_Pos 0UL
#define USB32DEV_PROT_HW_PTM_COUNTER_READ_Msk 0x1UL
#define USB32DEV_PROT_HW_PTM_COUNTER_BIC_Pos 1UL
#define USB32DEV_PROT_HW_PTM_COUNTER_BIC_Msk 0x7FFEUL
#define USB32DEV_PROT_HW_PTM_COUNTER_DC_Pos 15UL
#define USB32DEV_PROT_HW_PTM_COUNTER_DC_Msk 0xFFF8000UL
/* USB32DEV_PROT.PROT_PTM_STATUS */
#define USB32DEV_PROT_PTM_STATUS_LDM_REQ_STATE_Pos 0UL
#define USB32DEV_PROT_PTM_STATUS_LDM_REQ_STATE_Msk 0x7UL
#define USB32DEV_PROT_PTM_STATUS_LDMS_TX_Pos 3UL
#define USB32DEV_PROT_PTM_STATUS_LDMS_TX_Msk 0x18UL
/* USB32DEV_PROT.PROT_PTM_T1 */
#define USB32DEV_PROT_PTM_T1_TIME_Pos 0UL
#define USB32DEV_PROT_PTM_T1_TIME_Msk 0x7FFFFFFUL
/* USB32DEV_PROT.PROT_PTM_T4 */
#define USB32DEV_PROT_PTM_T4_TIME_Pos 0UL
#define USB32DEV_PROT_PTM_T4_TIME_Msk 0x7FFFFFFUL
/* USB32DEV_PROT.PROT_LMP_LDM_RESPONSE */
#define USB32DEV_PROT_LMP_LDM_RESPONSE_LDM_TYPE_Pos 0UL
#define USB32DEV_PROT_LMP_LDM_RESPONSE_LDM_TYPE_Msk 0x7UL
#define USB32DEV_PROT_LMP_LDM_RESPONSE_LDMS_RX_Pos 3UL
#define USB32DEV_PROT_LMP_LDM_RESPONSE_LDMS_RX_Msk 0x18UL
#define USB32DEV_PROT_LMP_LDM_RESPONSE_LDM_RESP_DELAY_Pos 15UL
#define USB32DEV_PROT_LMP_LDM_RESPONSE_LDM_RESP_DELAY_Msk 0x1FFF8000UL
/* USB32DEV_PROT.PROT_EPI_ENHANCE */
#define USB32DEV_PROT_EPI_ENHANCE_EN_TERM_NUMP0_RTY1_Pos 0UL
#define USB32DEV_PROT_EPI_ENHANCE_EN_TERM_NUMP0_RTY1_Msk 0x1UL
#define USB32DEV_PROT_EPI_ENHANCE_EN_EOB_ZLP_Pos 1UL
#define USB32DEV_PROT_EPI_ENHANCE_EN_EOB_ZLP_Msk 0x2UL
#define USB32DEV_PROT_EPI_ENHANCE_EN_EOB_SHORT_Pos 31UL
#define USB32DEV_PROT_EPI_ENHANCE_EN_EOB_SHORT_Msk 0x80000000UL
/* USB32DEV_PROT.PROT_ENHANCE */
#define USB32DEV_PROT_ENHANCE_EN_DPH_ERR_DET_Pos 0UL
#define USB32DEV_PROT_ENHANCE_EN_DPH_ERR_DET_Msk 0x1UL
#define USB32DEV_PROT_ENHANCE_DISABLE_STREAM_ERDY_Pos 1UL
#define USB32DEV_PROT_ENHANCE_DISABLE_STREAM_ERDY_Msk 0x2UL
#define USB32DEV_PROT_ENHANCE_STREAM_ERDY_ONLY_DISABLED_ST_Pos 2UL
#define USB32DEV_PROT_ENHANCE_STREAM_ERDY_ONLY_DISABLED_ST_Msk 0x4UL
#define USB32DEV_PROT_ENHANCE_EN_REJECTED_ERDY_Pos 3UL
#define USB32DEV_PROT_ENHANCE_EN_REJECTED_ERDY_Msk 0x8UL
#define USB32DEV_PROT_ENHANCE_DISABLE_SI_MODE_Pos 4UL
#define USB32DEV_PROT_ENHANCE_DISABLE_SI_MODE_Msk 0x10UL
#define USB32DEV_PROT_ENHANCE_EN_EGRS_ISO_SEQ_MATCH_Pos 5UL
#define USB32DEV_PROT_ENHANCE_EN_EGRS_ISO_SEQ_MATCH_Msk 0x20UL
#define USB32DEV_PROT_ENHANCE_ITP_RST_SEQ_NUM_CONDITION_Pos 6UL
#define USB32DEV_PROT_ENHANCE_ITP_RST_SEQ_NUM_CONDITION_Msk 0x3C0UL
#define USB32DEV_PROT_ENHANCE_ITP_PTM_INTR_CONDITION_Pos 10UL
#define USB32DEV_PROT_ENHANCE_ITP_PTM_INTR_CONDITION_Msk 0x3C00UL
#define USB32DEV_PROT_ENHANCE_INGRESS_FULL_COUNTER_Pos 14UL
#define USB32DEV_PROT_ENHANCE_INGRESS_FULL_COUNTER_Msk 0x1C000UL
#define USB32DEV_PROT_ENHANCE_STREAM_READ_DIR_Pos 17UL
#define USB32DEV_PROT_ENHANCE_STREAM_READ_DIR_Msk 0x20000UL
#define USB32DEV_PROT_ENHANCE_STREAM_READ_END_POINT_Pos 18UL
#define USB32DEV_PROT_ENHANCE_STREAM_READ_END_POINT_Msk 0x3C0000UL
#define USB32DEV_PROT_ENHANCE_STREAM_READ_STATE_Pos 22UL
#define USB32DEV_PROT_ENHANCE_STREAM_READ_STATE_Msk 0x3FC00000UL
#define USB32DEV_PROT_ENHANCE_RESET_SCH_TYPE1_Pos 30UL
#define USB32DEV_PROT_ENHANCE_RESET_SCH_TYPE1_Msk 0x40000000UL
#define USB32DEV_PROT_ENHANCE_RESET_SCH_TYPE2_Pos 31UL
#define USB32DEV_PROT_ENHANCE_RESET_SCH_TYPE2_Msk 0x80000000UL


