RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
/* USB32DEV_PHYSS_USB40PHY_TOP.TOP_CTRL_0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_PWR_GOOD_CORE_RX_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_PWR_GOOD_CORE_RX_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_PWR_GOOD_CORE_PLL_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_PWR_GOOD_CORE_PLL_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_VBUS_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_VBUS_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_PLL_RSTB_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_PLL_RSTB_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_LFPS_CLK_DIV_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_LFPS_CLK_DIV_Msk 0xF00UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_TX_SHIFT_CLK_DIV_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_TX_SHIFT_CLK_DIV_Msk 0xF000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_PHYSS_EN_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_PHYSS_EN_Msk 0x10000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_RX_EQ_TRAINING_FLAG_Pos 17UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_REG_RX_EQ_TRAINING_FLAG_Msk 0x20000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_PCLK_EN_Pos 19UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_PCLK_EN_Msk 0x80000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_RATE_CHANGE_DONE_Pos 20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_RATE_CHANGE_DONE_Msk 0x100000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_RATE_Pos 21UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_RATE_Msk 0x600000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_PLL_VCCD_LEVELSHIFT_EN_Pos 24UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_PLL_VCCD_LEVELSHIFT_EN_Msk 0x1000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_PLL_VHS_LEVELSHIFT_EN_Pos 25UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_PLL_VHS_LEVELSHIFT_EN_Msk 0x2000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_GEN1_BERT_EN_Pos 28UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CTRL_0_GEN1_BERT_EN_Msk 0x10000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.PCS_CTRL_0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN2_HDR_CORRECTION_DISABLE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN2_HDR_CORRECTION_DISABLE_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN2_SKP_CORRECTION_DISABLE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN2_SKP_CORRECTION_DISABLE_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN2_SDS_CORRECTION_DISABLE_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN2_SDS_CORRECTION_DISABLE_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_CLEAR_ERR_CNTR_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_CLEAR_ERR_CNTR_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_ONEZERO_CNT_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_ONEZERO_CNT_Msk 0xF0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_TX_SER_EN_DLY_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_TX_SER_EN_DLY_Msk 0x3800UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN1_EB_HALF_DEPTH_Pos 24UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN1_EB_HALF_DEPTH_Msk 0xF000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN2_EB_HALF_DEPTH_Pos 28UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_CTRL_0_GEN2_EB_HALF_DEPTH_Msk 0xF0000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.PCS_STATUS */
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_REG_PCS_RX_ALIGNED_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_REG_PCS_RX_ALIGNED_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_REG_PCS_RX_MATCHED_CNT_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_REG_PCS_RX_MATCHED_CNT_Msk 0xFEUL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_REG_PIPE_RATE_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_REG_PIPE_RATE_Msk 0x300UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_ALIGNER_STATE_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_ALIGNER_STATE_Msk 0x7000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_CDR_LOCK_TO_REFERENCE_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_STATUS_CDR_LOCK_TO_REFERENCE_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.PCS_SPARE */
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_SPARE_REG_DFT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_SPARE_REG_DFT_Msk 0xFFFUL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_SPARE_REG_SPARE0_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_SPARE_REG_SPARE0_Msk 0xFFF000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_SPARE_REG_SPARE1_Pos 24UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PCS_SPARE_REG_SPARE1_Msk 0xFF000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.ERR_STATUS */
#define USB32DEV_PHYSS_USB40PHY_TOP_ERR_STATUS_HDR_ERR_CORRECTED_CNT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ERR_STATUS_HDR_ERR_CORRECTED_CNT_Msk 0xFFFFUL
#define USB32DEV_PHYSS_USB40PHY_TOP_ERR_STATUS_SKP_ERR_CORRECTED_CNT_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ERR_STATUS_SKP_ERR_CORRECTED_CNT_Msk 0x3FF0000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ERR_STATUS_SDS_ERR_CORRECTED_CNT_Pos 26UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ERR_STATUS_SDS_ERR_CORRECTED_CNT_Msk 0x3C000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.PIPE_OVERRIDE_0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_PIPE_ENCDEC_BYPASS_OVRD_EN_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_PIPE_ENCDEC_BYPASS_OVRD_EN_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_PIPE_ENCDEC_BYPASS_OVRD_VALUE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_PIPE_ENCDEC_BYPASS_OVRD_VALUE_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_EB_MODE_OVRD_EN_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_EB_MODE_OVRD_EN_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_EB_MODE_OVRD_VALUE_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_EB_MODE_OVRD_VALUE_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_DETECTRX_OVRD_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_DETECTRX_OVRD_EN_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_DETECTRX_OVRD_VALUE_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_DETECTRX_OVRD_VALUE_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_ELECTIDLE_OVRD_EN_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_ELECTIDLE_OVRD_EN_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_ELECTIDLE_OVRD_VALUE_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_ELECTIDLE_OVRD_VALUE_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_ONE_ZEROS_OVRD_EN_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_ONE_ZEROS_OVRD_EN_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_ONE_ZEROS_OVRD_VALUE_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_TX_ONE_ZEROS_OVRD_VALUE_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_RX_POLARITY_OVRD_EN_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_RX_POLARITY_OVRD_EN_Msk 0x2000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_RX_POLARITY_OVRD_VALUE_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_RX_POLARITY_OVRD_VALUE_Msk 0x4000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_RX_EQ_TRAINING_OVRD_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_RX_EQ_TRAINING_OVRD_EN_Msk 0x8000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_RX_EQ_TRAINING_OVRD_VALUE_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_RX_EQ_TRAINING_OVRD_VALUE_Msk 0x10000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_POWER_DOWN_OVRD_EN_Pos 17UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_POWER_DOWN_OVRD_EN_Msk 0x20000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_POWER_DOWN_OVRD_VALUE_Pos 18UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_POWER_DOWN_OVRD_VALUE_Msk 0x1C0000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_BLOCK_ALIGN_CONTROL_OVRD_EN_Pos 30UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_BLOCK_ALIGN_CONTROL_OVRD_EN_Msk 0x40000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_BLOCK_ALIGN_CONTROL_OVRD_VALUE_Pos 31UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_OVERRIDE_0_REG_PIPE_BLOCK_ALIGN_CONTROL_OVRD_VALUE_Msk 0x80000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.PIPE_STATUS */
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_RXVALID_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_RXVALID_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_PHY_STATUS_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_PHY_STATUS_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_RX_ELECIDLE_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_RX_ELECIDLE_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_RX_STATUS_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_RX_STATUS_Msk 0x38UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_POWER_PRESENT_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_REG_PIPE_POWER_PRESENT_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_RX_TERMINATION_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_RX_TERMINATION_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_RX_STANDBY_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_RX_STANDBY_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_PHY_IN_P0_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_PHY_IN_P0_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_PHY_IN_P1_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_PHY_IN_P1_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_PHY_IN_P2_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_PHY_IN_P2_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_PHY_IN_P3_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_STATUS_PHY_IN_P3_Msk 0x1000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.INTR0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RATE_CHANGE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RATE_CHANGE_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_P0_CHANGE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_P0_CHANGE_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_P1_CHANGE_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_P1_CHANGE_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_P2_CHANGE_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_P2_CHANGE_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_P3_CHANGE_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_P3_CHANGE_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_TX_SFT_REG_WDONE_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_TX_SFT_REG_WDONE_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_PLL_LOCKED_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_PLL_LOCKED_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_POWER_GOOD_RXA_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_POWER_GOOD_RXA_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_POWER_GOOD_RXCK_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_POWER_GOOD_RXCK_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_POWER_GOOD_RXD_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_POWER_GOOD_RXD_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_OSA_ERROR_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_OSA_ERROR_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_OSA_ALL_DONE_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_OSA_ALL_DONE_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_EQ_START_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_EQ_START_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_EYE_HIGHT_DONE_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_EYE_HIGHT_DONE_Msk 0x2000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_EYE_MON_DONE_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_RX_EYE_MON_DONE_Msk 0x4000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PLL_LOCKED_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PLL_LOCKED_Msk 0x8000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PLL_PWR_GOOD_LCPLL_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PLL_PWR_GOOD_LCPLL_Msk 0x10000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PLL_PWR_GOOD_REF_Pos 17UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PLL_PWR_GOOD_REF_Msk 0x20000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PLL_PWR_GOOD_DIG_Pos 18UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PLL_PWR_GOOD_DIG_Msk 0x40000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_RX_ALIGNER_LOCK_Pos 19UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_RX_ALIGNER_LOCK_Msk 0x80000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_RX_DETECTED_Pos 20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_RX_DETECTED_Msk 0x100000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_DECODE_ERR_Pos 21UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_DECODE_ERR_Msk 0x200000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_EB_OVERFLOW_Pos 22UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_EB_OVERFLOW_Msk 0x400000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_EB_UNDERFLOW_Pos 23UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_PCS_EB_UNDERFLOW_Msk 0x800000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_LOOPBACK_LOCK_Pos 24UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_LOOPBACK_LOCK_Msk 0x1000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_LOOPBACK_DONE_Pos 25UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_LOOPBACK_DONE_Msk 0x2000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_TX_IMP_CAL_DONE_Pos 26UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_REG_INT_TX_IMP_CAL_DONE_Msk 0x4000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SAR_DONE_Pos 27UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SAR_DONE_Msk 0x8000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_RX_TERMINATION_CHANGE_Pos 28UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_RX_TERMINATION_CHANGE_Msk 0x10000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_RX_STANDBY_CHANGE_Pos 29UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_RX_STANDBY_CHANGE_Msk 0x20000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.INTR0_SET */
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RATE_CHANGE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RATE_CHANGE_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_P0_CHANGE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_P0_CHANGE_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_P1_CHANGE_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_P1_CHANGE_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_P2_CHANGE_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_P2_CHANGE_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_P3_CHANGE_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_P3_CHANGE_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_TX_SFT_REG_WDONE_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_TX_SFT_REG_WDONE_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_PLL_LOCKED_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_PLL_LOCKED_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_POWER_GOOD_RXA_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_POWER_GOOD_RXA_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_POWER_GOOD_RXCK_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_POWER_GOOD_RXCK_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_POWER_GOOD_RXD_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_POWER_GOOD_RXD_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_OSA_ERROR_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_OSA_ERROR_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_OSA_ALL_DONE_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_OSA_ALL_DONE_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_EQ_START_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_EQ_START_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_EYE_HIGHT_DONE_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_EYE_HIGHT_DONE_Msk 0x2000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_EYE_MON_DONE_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_RX_EYE_MON_DONE_Msk 0x4000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PLL_LOCKED_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PLL_LOCKED_Msk 0x8000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PLL_PWR_GOOD_LCPLL_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PLL_PWR_GOOD_LCPLL_Msk 0x10000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PLL_PWR_GOOD_REF_Pos 17UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PLL_PWR_GOOD_REF_Msk 0x20000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PLL_PWR_GOOD_DIG_Pos 18UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PLL_PWR_GOOD_DIG_Msk 0x40000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_RX_ALIGNER_LOCK_Pos 19UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_RX_ALIGNER_LOCK_Msk 0x80000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_RX_DETECTED_Pos 20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_RX_DETECTED_Msk 0x100000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_DECODE_ERR_Pos 21UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_DECODE_ERR_Msk 0x200000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_EB_OVERFLOW_Pos 22UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_EB_OVERFLOW_Msk 0x400000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_EB_UNDERFLOW_Pos 23UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_PCS_EB_UNDERFLOW_Msk 0x800000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_LOOPBACK_LOCK_Pos 24UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_LOOPBACK_LOCK_Msk 0x1000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_LOOPBACK_DONE_Pos 25UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_LOOPBACK_DONE_Msk 0x2000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_TX_IMP_CAL_DONE_Pos 26UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_REG_INT_TX_IMP_CAL_DONE_Msk 0x4000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_SAR_DONE_Pos 27UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_SAR_DONE_Msk 0x8000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_RX_TERMINATION_CHANGE_Pos 28UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_RX_TERMINATION_CHANGE_Msk 0x10000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_RX_STANDBY_CHANGE_Pos 29UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_SET_RX_STANDBY_CHANGE_Msk 0x20000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.INTR0_MASK */
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RATE_CHANGE_MASK_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RATE_CHANGE_MASK_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_P0_CHANGE_MASK_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_P0_CHANGE_MASK_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_P1_CHANGE_MASK_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_P1_CHANGE_MASK_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_P2_CHANGE_MASK_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_P2_CHANGE_MASK_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_P3_CHANGE_MASK_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_P3_CHANGE_MASK_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_TX_SFT_REG_WDONE_MASK_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_TX_SFT_REG_WDONE_MASK_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_PLL_LOCKED_MASK_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_PLL_LOCKED_MASK_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_POWER_GOOD_RXA_MASK_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_POWER_GOOD_RXA_MASK_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_POWER_GOOD_RXCK_MASK_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_POWER_GOOD_RXCK_MASK_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_POWER_GOOD_RXD_MASK_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_POWER_GOOD_RXD_MASK_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_OSA_ERROR_MASK_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_OSA_ERROR_MASK_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_OSA_ALL_DONE_MASK_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_OSA_ALL_DONE_MASK_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_EQ_START_MASK_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_EQ_START_MASK_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_EYE_HIGHT_DONE_MASK_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_EYE_HIGHT_DONE_MASK_Msk 0x2000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_EYE_MON_DONE_MASK_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_RX_EYE_MON_DONE_MASK_Msk 0x4000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PLL_LOCKED_MASK_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PLL_LOCKED_MASK_Msk 0x8000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PLL_PWR_GOOD_LCPLL_MASK_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PLL_PWR_GOOD_LCPLL_MASK_Msk 0x10000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PLL_PWR_GOOD_REF_MASK_Pos 17UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PLL_PWR_GOOD_REF_MASK_Msk 0x20000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PLL_PWR_GOOD_DIG_MASK_Pos 18UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PLL_PWR_GOOD_DIG_MASK_Msk 0x40000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_RX_ALIGNER_LOCK_MASK_Pos 19UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_RX_ALIGNER_LOCK_MASK_Msk 0x80000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_RX_DETECTED_MASK_Pos 20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_RX_DETECTED_MASK_Msk 0x100000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_DECODE_ERR_MASK_Pos 21UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_DECODE_ERR_MASK_Msk 0x200000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_EB_OVERFLOW_MASK_Pos 22UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_EB_OVERFLOW_MASK_Msk 0x400000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_EB_UNDERFLOW_MASK_Pos 23UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_PCS_EB_UNDERFLOW_MASK_Msk 0x800000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_LOOPBACK_LOCK_MASK_Pos 24UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_LOOPBACK_LOCK_MASK_Msk 0x1000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_LOOPBACK_DONE_MASK_Pos 25UL
