RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_LOOPBACK_DONE_MASK_Msk 0x2000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_TX_IMP_CAL_DONE_Pos 26UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_REG_INT_TX_IMP_CAL_DONE_Msk 0x4000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_SAR_DONE_Pos 27UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_SAR_DONE_Msk 0x8000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_RX_TERMINATION_CHANGE_Pos 28UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_RX_TERMINATION_CHANGE_Msk 0x10000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_RX_STANDBY_CHANGE_Pos 29UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASK_RX_STANDBY_CHANGE_Msk 0x20000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.INTR0_MASKED */
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RATE_CHANGE_MASKD_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RATE_CHANGE_MASKD_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_P0_CHANGE_MASKD_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_P0_CHANGE_MASKD_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_P1_CHANGE_MASKD_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_P1_CHANGE_MASKD_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_P2_CHANGE_MASKD_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_P2_CHANGE_MASKD_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_P3_CHANGE_MASKD_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_P3_CHANGE_MASKD_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_TX_SFT_REG_WDONE_MASKD_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_TX_SFT_REG_WDONE_MASKD_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_PLL_LOCKED_MASKD_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_PLL_LOCKED_MASKD_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_POWER_GOOD_RXA_MASKD_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_POWER_GOOD_RXA_MASKD_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_POWER_GOOD_RXCK_MASKD_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_POWER_GOOD_RXCK_MASKD_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_POWER_GOOD_RXD_MASKD_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_POWER_GOOD_RXD_MASKD_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_OSA_ERROR_MASKD_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_OSA_ERROR_MASKD_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_OSA_ALL_DONE_MASKD_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_OSA_ALL_DONE_MASKD_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_EQ_START_MASKD_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_EQ_START_MASKD_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_EYE_HIGHT_DONE_MASKD_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_EYE_HIGHT_DONE_MASKD_Msk 0x2000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_EYE_MON_DONE_MASKD_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_RX_EYE_MON_DONE_MASKD_Msk 0x4000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PLL_LOCKED_MASKD_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PLL_LOCKED_MASKD_Msk 0x8000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PLL_PWR_GOOD_LCPLL_MASKD_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PLL_PWR_GOOD_LCPLL_MASKD_Msk 0x10000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PLL_PWR_GOOD_REF_MASKD_Pos 17UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PLL_PWR_GOOD_REF_MASKD_Msk 0x20000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PLL_PWR_GOOD_DIG_MASKD_Pos 18UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PLL_PWR_GOOD_DIG_MASKD_Msk 0x40000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_RX_ALIGNER_LOCK_MASKD_Pos 19UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_RX_ALIGNER_LOCK_MASKD_Msk 0x80000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_RX_DETECTED_MASKD_Pos 20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_RX_DETECTED_MASKD_Msk 0x100000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_DECODE_ERR_MASKD_Pos 21UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_DECODE_ERR_MASKD_Msk 0x200000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_EB_OVERFLOW_MASKD_Pos 22UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_EB_OVERFLOW_MASKD_Msk 0x400000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_EB_UNDERFLOW_MASKD_Pos 23UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_PCS_EB_UNDERFLOW_MASKD_Msk 0x800000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_LOOPBACK_LOCK_MASKD_Pos 24UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_LOOPBACK_LOCK_MASKD_Msk 0x1000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_LOOPBACK_DONE_MASKD_Pos 25UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_LOOPBACK_DONE_MASKD_Msk 0x2000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_TX_IMP_CAL_DONE_Pos 26UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_REG_INT_TX_IMP_CAL_DONE_Msk 0x4000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_SAR_DONE_Pos 27UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_SAR_DONE_Msk 0x8000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_RX_TERMINATION_CHANGE_Pos 28UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_RX_TERMINATION_CHANGE_Msk 0x10000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_RX_STANDBY_CHANGE_Pos 29UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR0_MASKED_RX_STANDBY_CHANGE_Msk 0x20000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.INTR1 */
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR1_REG_INT_RX_LFPSDET_OUT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR1_REG_INT_RX_LFPSDET_OUT_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_TOP.INTR1_SET */
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR1_SET_REG_INT_RX_LFPSDET_OUT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR1_SET_REG_INT_RX_LFPSDET_OUT_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_TOP.INTR1_MASK */
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR1_MASK_REG_INT_RX_LFPSDET_OUT_MASK_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR1_MASK_REG_INT_RX_LFPSDET_OUT_MASK_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_TOP.INTR1_MASKED */
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR1_MASKED_REG_INT_RX_LFPSDET_OUT_MASKD_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_INTR1_MASKED_REG_INT_RX_LFPSDET_OUT_MASKD_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CTRL_0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_EN_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_EN_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_DRV_EN_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_DRV_EN_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_CML2CMOS_EN_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_CML2CMOS_EN_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_TX_SERIALIZER_RST_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_TX_SERIALIZER_RST_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VCPREG_EN_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VCPREG_EN_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VCPREG_SEL_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VCPREG_SEL_Msk 0x1E0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_CPCLK_SEL_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_CPCLK_SEL_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VREG_CLK_EN_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VREG_CLK_EN_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VREG_CLK_SEL_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VREG_CLK_SEL_Msk 0x7800UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VREG_DRV_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VREG_DRV_EN_Msk 0x8000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VREG_DRV_SEL_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_VREG_DRV_SEL_Msk 0xF0000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_PULL_DN_Pos 20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_PULL_DN_Msk 0x100000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_LOOPBK_EN_Pos 21UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_LOOPBK_EN_Msk 0x200000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_DCD_CTRL_Pos 22UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_DCD_CTRL_Msk 0x3C00000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_DETECTRX_TRIM_Pos 26UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_DETECTRX_TRIM_Msk 0xC000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_ELECIDLE_DRV_Pos 28UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_0_REG_TX_AFE_TX_ELECIDLE_DRV_Msk 0x30000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CTRL_1 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_TX_ICAL_TRIM_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_TX_ICAL_TRIM_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_BURNIN_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_BURNIN_EN_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_TX_ADFT_EN_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_TX_ADFT_EN_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_TX_ADFT_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_TX_ADFT_Msk 0x3E00UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_TX_DDFT_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CTRL_1_REG_TX_AFE_TX_DDFT_Msk 0x7C000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_RXDETECT_CNT */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_RXDETECT_CNT_RXDETECT_WAIT_CNT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_RXDETECT_CNT_RXDETECT_WAIT_CNT_Msk 0xFFUL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_RXDETECT_CNT_PULLUP_ASSERT_DLY_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_RXDETECT_CNT_PULLUP_ASSERT_DLY_Msk 0xFF00UL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_OVERRIDE_0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_PULL_UP_OVRD_EN_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_PULL_UP_OVRD_EN_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_PULL_UP_OVRD_VALUE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_PULL_UP_OVRD_VALUE_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_SER_EN_OVRD_EN_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_SER_EN_OVRD_EN_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_SER_EN_OVRD_VALUE_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_SER_EN_OVRD_VALUE_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_HSCLK_DRV_EN_OVRD_EN_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_HSCLK_DRV_EN_OVRD_EN_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_HSCLK_DRV_EN_OVRD_VALUE_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_HSCLK_DRV_EN_OVRD_VALUE_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_TX_AFE_SER_RESET_OVRD_EN_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_TX_AFE_SER_RESET_OVRD_EN_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_TX_AFE_SER_RESET_OVRD_VALUE_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_TX_AFE_SER_RESET_OVRD_VALUE_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_DETECTRX_OVRD_EN_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_DETECTRX_OVRD_EN_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_DETECTRX_OVRD_VALUE_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_DETECTRX_OVRD_VALUE_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_ELECIDLE_OVRD_EN_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_ELECIDLE_OVRD_EN_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_ELECIDLE_OVRD_VALUE_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_ELECIDLE_OVRD_VALUE_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_LFPS_OVRD_EN_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_LFPS_OVRD_EN_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_LFPS_OVRD_VALUE_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_LFPS_OVRD_VALUE_Msk 0x2000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_ZTRIM_OVRD_EN_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_ZTRIM_OVRD_EN_Msk 0x10000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_ZTRIM_OVRD_VALUE_Pos 17UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_OVERRIDE_0_REG_TX_AFE_TX_ZTRIM_OVRD_VALUE_Msk 0x3E0000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_DEBUG */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_DEBUG_REG_TX_AFE_DDFT_OUT1_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_DEBUG_REG_TX_AFE_DDFT_OUT1_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_DEBUG_REG_TX_AFE_DDFT_OUT2_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_DEBUG_REG_TX_AFE_DDFT_OUT2_Msk 0x2UL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_STATUS */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_STATUS_ZCAL_STATUS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_STATUS_ZCAL_STATUS_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_STATUS_ZCAL_CODE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_STATUS_ZCAL_CODE_Msk 0x3EUL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_STATUS_ZCAL_COMP_OUT_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_STATUS_ZCAL_COMP_OUT_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_STATUS_TX_DETECTRX_OUT_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_STATUS_TX_DETECTRX_OUT_Msk 0x80UL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_ZTRIM */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_EN_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_EN_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_MODE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_MODE_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_COMP_WAIT_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_COMP_WAIT_Msk 0xCUL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_START_CODE_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_START_CODE_Msk 0x1F0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_FINAL_CODE_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_FINAL_CODE_Msk 0x3E00UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_CURR_STATE_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_ZTRIM_ZCAL_CURR_STATE_Msk 0x70000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_REG_TX_CFG_WRITE_DONE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_REG_TX_CFG_WRITE_DONE_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG_SFT_W_0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_0_REG_TX_CFG_SFT_W_0_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_0_REG_TX_CFG_SFT_W_0_Msk 0x3FFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG_SFT_W_1 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_1_REG_TX_CFG_SFT_W_1_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_1_REG_TX_CFG_SFT_W_1_Msk 0x3FFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG_SFT_W_2 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_2_REG_TX_CFG_SFT_W_2_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_2_REG_TX_CFG_SFT_W_2_Msk 0x3FFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG_SFT_W_3 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_3_REG_TX_CFG_SFT_W_3_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_3_REG_TX_CFG_SFT_W_3_Msk 0x3FFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG_SFT_W_4 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_4_REG_TX_CFG_SFT_W_4_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_4_REG_TX_CFG_SFT_W_4_Msk 0x3FFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG_SFT_W_5 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_5_REG_TX_CFG_SFT_W_5_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_5_REG_TX_CFG_SFT_W_5_Msk 0x3FFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG_SFT_W_6 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_6_REG_TX_CFG_SFT_W_6_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_6_REG_TX_CFG_SFT_W_6_Msk 0x3FFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG_SFT_W_7 */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_7_REG_TX_CFG_SFT_W_7_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_W_7_REG_TX_CFG_SFT_W_7_Msk 0x3FFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.TX_AFE_CFG_SFT_R */
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_R_REG_TX_CFG_SFT_R_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_TX_AFE_CFG_SFT_R_REG_TX_CFG_SFT_R_Msk 0xFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.ADC */
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_DAC_CNTRL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_DAC_CNTRL_Msk 0xFFUL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_MID_VAL_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_MID_VAL_Msk 0xFF00UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_LDO_TRIM_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_LDO_TRIM_Msk 0xF0000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_LDO_EN_Pos 20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_LDO_EN_Msk 0x100000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_ISO_N_Pos 21UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_ISO_N_Msk 0x200000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_PD_LV_Pos 22UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_PD_LV_Msk 0x400000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_DFT_MUXSEL_Pos 23UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_DFT_MUXSEL_Msk 0x800000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_VSEL_Pos 24UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_VSEL_Msk 0x7000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_VREF_DAC_SEL_Pos 27UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_VREF_DAC_SEL_Msk 0x18000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_SAR_EN_Pos 29UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_SAR_EN_Msk 0x20000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.ADC_STATUS */
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_STATUS_CMP_OUT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_STATUS_CMP_OUT_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_STATUS_SAR_OUT_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_ADC_STATUS_SAR_OUT_Msk 0xFF00UL
/* USB32DEV_PHYSS_USB40PHY_TOP.PHYSS_LOOPBACK_CTRL_0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_EN_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_EN_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_NO_AFE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_NO_AFE_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_START_PTTN_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_START_PTTN_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_NO_8B_10B_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_NO_8B_10B_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_PTTN_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_PTTN_Msk 0x70UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_NO_RX_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_LOOPBACK_NO_RX_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_TX_ONE_ZERO_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_TX_ONE_ZERO_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_SAMPLE_RX_AFE_OUT_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_CTRL_0_SAMPLE_RX_AFE_OUT_Msk 0x400UL
/* USB32DEV_PHYSS_USB40PHY_TOP.PHYSS_LOOPBACK_DEBUG_0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_DEBUG_0_RX_AFE_DATA_0_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_DEBUG_0_RX_AFE_DATA_0_Msk 0xFFFFFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.PHYSS_LOOPBACK_DEBUG_1 */
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_DEBUG_1_RX_AFE_DATA_1_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_DEBUG_1_RX_AFE_DATA_1_Msk 0xFFFFFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.PHYSS_LOOPBACK_STATUS_1 */
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_ERR_COUNT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_ERR_COUNT_Msk 0xFFFFUL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_STATUS_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_STATUS_Msk 0x30000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_DONE_Pos 18UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_DONE_Msk 0x40000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_GEN_STATE_Pos 20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_GEN_STATE_Msk 0x300000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_CHK_STATE_Pos 22UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_STATUS_1_LOOPBACK_CHK_STATE_Msk 0xC00000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.PHYSS_LOOPBACK_USER_0 */
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_USER_0_REG_LOOPBACK_USER_0_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_USER_0_REG_LOOPBACK_USER_0_Msk 0xFFFFFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.PHYSS_LOOPBACK_USER_1 */
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_USER_1_REG_LOOPBACK_USER_1_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_LOOPBACK_USER_1_REG_LOOPBACK_USER_1_Msk 0xFFFFFFFFUL
/* USB32DEV_PHYSS_USB40PHY_TOP.PHYSS_DDFT_MUX_SEL */
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_DDFT0_SEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_DDFT0_SEL_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_DDFT0_POLARITY_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_DDFT0_POLARITY_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_DDFT1_SEL_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_DDFT1_SEL_Msk 0x3F00UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_DDFT1_POLARITY_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_DDFT1_POLARITY_Msk 0x8000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_HS_DDFT_EN_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_HS_DDFT_EN_Msk 0x10000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_HS_DDFT0_SEL_Pos 17UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_HS_DDFT0_SEL_Msk 0x3E0000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_HS_DDFT1_SEL_Pos 22UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PHYSS_DDFT_MUX_SEL_HS_DDFT1_SEL_Msk 0x7C00000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.PIPE_RX_CTRL */
