RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_RESERVED_CFG_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_RESERVED_CFG_Msk 0xFFFFUL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_HS_ERROR_DEBOUNCE_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_HS_ERROR_DEBOUNCE_Msk 0x1F0000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_HS_DATA_ALIGN_Pos 21UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_HS_DATA_ALIGN_Msk 0x3E00000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_FORCE_REALIGN_Pos 26UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_FORCE_REALIGN_Msk 0x4000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_CDR_L2R_ON_POWER_MODE_Pos 27UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_CDR_L2R_ON_POWER_MODE_Msk 0x8000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_VCC_SEL_LFPS_DETECT_Pos 28UL
#define USB32DEV_PHYSS_USB40PHY_TOP_PIPE_RX_CTRL_VCC_SEL_LFPS_DETECT_Msk 0x10000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.LOW_POWER_CTRL */
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_LFPS_FILTER_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_LFPS_FILTER_Msk 0xFFFFUL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_HW_CTRL_DELAY_Pos 16UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_HW_CTRL_DELAY_Msk 0x1F0000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_LFPS_MASK_ON_TX_DATA_Pos 21UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_LFPS_MASK_ON_TX_DATA_Msk 0x200000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_DISABLE_LFPS_FILTER_Pos 22UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_DISABLE_LFPS_FILTER_Msk 0x400000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_LFPS_FILTER_MODE_Pos 23UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_LFPS_FILTER_MODE_Msk 0x800000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_FORCE_CDR_LOCK_TO_DATA_Pos 24UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_FORCE_CDR_LOCK_TO_DATA_Msk 0x1000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_FORCE_CDR_LOCK_TO_REFERENCE_Pos 25UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_FORCE_CDR_LOCK_TO_REFERENCE_Msk 0x2000000UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_BYPASS_FILTER_U3_WAKEUP_Pos 26UL
#define USB32DEV_PHYSS_USB40PHY_TOP_LOW_POWER_CTRL_BYPASS_FILTER_U3_WAKEUP_Msk 0x4000000UL
/* USB32DEV_PHYSS_USB40PHY_TOP.CDR_SW_CTRL */
#define USB32DEV_PHYSS_USB40PHY_TOP_CDR_SW_CTRL_L2D_START_DELAY_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CDR_SW_CTRL_L2D_START_DELAY_Msk 0xFFFFFUL
#define USB32DEV_PHYSS_USB40PHY_TOP_CDR_SW_CTRL_L2R_START_DELAY_Pos 20UL
#define USB32DEV_PHYSS_USB40PHY_TOP_CDR_SW_CTRL_L2R_START_DELAY_Msk 0xFF00000UL


/* USB32DEV_PHYSS_USB40PHY_RX.RX_SDM_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG0_DIVF_INTEGER_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG0_DIVF_INTEGER_Msk 0xFFUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_SDM_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG1_DIVF_FRAC_MSB_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG1_DIVF_FRAC_MSB_Msk 0xFFFFUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_SDM_CFG2 */
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG2_DIVF_FRAC_LSB_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG2_DIVF_FRAC_LSB_Msk 0x3UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_SDM_CFG3 */
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG3_SDM_ENABLE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG3_SDM_ENABLE_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG3_DITHER_EN_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG3_DITHER_EN_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG3_DITHER_GAIN_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_RX_SDM_CFG3_DITHER_GAIN_Msk 0x1CUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DFE_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG0_OVRD_VGATAP_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG0_OVRD_VGATAP_Msk 0x1FUL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG0_OVRD_VGATAP_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG0_OVRD_VGATAP_EN_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG0_OVRD_DFETAP1_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG0_OVRD_DFETAP1_Msk 0x7F00UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG0_OVRD_DFETAP1_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG0_OVRD_DFETAP1_EN_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DFE_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG1_OVRD_DFETAP2_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG1_OVRD_DFETAP2_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG1_OVRD_DFETAP2_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG1_OVRD_DFETAP2_EN_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG1_OVRD_DFETAP3_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG1_OVRD_DFETAP3_Msk 0x7F00UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG1_OVRD_DFETAP3_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG1_OVRD_DFETAP3_EN_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DFE_CFG2 */
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_DFE_SLICEPOINTVALUE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_DFE_SLICEPOINTVALUE_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_DFE_SLICEPOINTSIGN1_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_DFE_SLICEPOINTSIGN1_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_DFE_SLICEPOINTSIGN2_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_DFE_SLICEPOINTSIGN2_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_VGA_MU_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_VGA_MU_Msk 0xF00UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_DFE_MU_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG2_DFE_MU_Msk 0xF000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DFE_CFG3 */
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_BAL_AVRG_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_BAL_AVRG_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_VGA_BALANCE_SCALE_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_VGA_BALANCE_SCALE_Msk 0x18UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_BALANCE_SCALE_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_BALANCE_SCALE_Msk 0x60UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_VGA_POLARITY_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_VGA_POLARITY_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_POLARITY_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_POLARITY_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_VGA_ADAPT_EN_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_VGA_ADAPT_EN_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_ENABLE_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_ENABLE_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_VGA_FREEZE_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_VGA_FREEZE_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_FREEZE_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_FREEZE_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_QUALIFIER_INV_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_QUALIFIER_INV_Msk 0x2000UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_RESETB_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG3_DFE_RESETB_Msk 0x4000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DFE_STAT0 */
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT0_VGATAP_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT0_VGATAP_Msk 0x1FUL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT0_DFETAP1_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT0_DFETAP1_Msk 0x7F00UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DFE_STAT1 */
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT1_DFETAP2_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT1_DFETAP2_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT1_DFETAP3_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT1_DFETAP3_Msk 0x7F00UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DFE_STAT2 */
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT2_ERRSLIC1DELTA_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT2_ERRSLIC1DELTA_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT2_ERRSLIC2DELTA_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_STAT2_ERRSLIC2DELTA_Msk 0x7F00UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG0_OVRD_EDGSLICE1OS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG0_OVRD_EDGSLICE1OS_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG0_OVRD_EDGSLICE1OS_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG0_OVRD_EDGSLICE1OS_EN_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG0_OVRD_EDGSLICE2OS_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG0_OVRD_EDGSLICE2OS_Msk 0x7F00UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG0_OVRD_EDGSLICE2OS_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG0_OVRD_EDGSLICE2OS_EN_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG1_OVRD_DATSLICE1OS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG1_OVRD_DATSLICE1OS_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG1_OVRD_DATSLICE1OS_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG1_OVRD_DATSLICE1OS_EN_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG1_OVRD_DATSLICE2OS_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG1_OVRD_DATSLICE2OS_Msk 0x7F00UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG1_OVRD_DATSLICE2OS_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG1_OVRD_DATSLICE2OS_EN_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_CFG2 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG2_OVRD_ERRSLICE1OS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG2_OVRD_ERRSLICE1OS_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG2_OVRD_ERRSLICE1OS_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG2_OVRD_ERRSLICE1OS_EN_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG2_OVRD_ERRSLICE2OS_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG2_OVRD_ERRSLICE2OS_Msk 0x7F00UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG2_OVRD_ERRSLICE2OS_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG2_OVRD_ERRSLICE2OS_EN_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_CFG3 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG3_OVRD_ROAMSLICE1OS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG3_OVRD_ROAMSLICE1OS_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG3_OVRD_ROAMSLICE1OS_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG3_OVRD_ROAMSLICE1OS_EN_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG3_OVRD_ROAMSLICE2OS_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG3_OVRD_ROAMSLICE2OS_Msk 0x7F00UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG3_OVRD_ROAMSLICE2OS_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG3_OVRD_ROAMSLICE2OS_EN_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_CFG4 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG4_OVRD_AFEOSDAC_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG4_OVRD_AFEOSDAC_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG4_OVRD_AFEOSDAC_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG4_OVRD_AFEOSDAC_EN_Msk 0x80UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_CFG5 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_DFE_START_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_DFE_START_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_AFE_START_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_AFE_START_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_RESETB_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_RESETB_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_ALL_DONE_OVRD_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_ALL_DONE_OVRD_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_ERROR_BITS_MASK_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_ERROR_BITS_MASK_Msk 0xF0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_DFE_POLARITY_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_DFE_POLARITY_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_AFE_POLARITY_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_CFG5_OSA_AFE_POLARITY_Msk 0x200UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_STAT0 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT0_EDGSLICE1OS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT0_EDGSLICE1OS_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT0_EDGSLICE2OS_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT0_EDGSLICE2OS_Msk 0x7F00UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_STAT1 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT1_DATSLICE1OS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT1_DATSLICE1OS_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT1_DATSLICE2OS_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT1_DATSLICE2OS_Msk 0x7F00UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_STAT2 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT2_ERRSLICE1OS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT2_ERRSLICE1OS_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT2_ERRSLICE2OS_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT2_ERRSLICE2OS_Msk 0x7F00UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_STAT3 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT3_ROAMSLICE1OS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT3_ROAMSLICE1OS_Msk 0x7FUL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT3_ROAMSLICE2OS_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT3_ROAMSLICE2OS_Msk 0x7F00UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_STAT4 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT4_AFEOSDAC_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT4_AFEOSDAC_Msk 0x7FUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_STAT5 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_DFE_DONE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_DFE_DONE_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_AFE_DONE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_AFE_DONE_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_ALL_DONE_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_ALL_DONE_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_DFE_ERROR_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_DFE_ERROR_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_AFE_ERROR_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_AFE_ERROR_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_ERROR_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT5_OSA_ERROR_Msk 0x40UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_STAT6 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT6_OSA_ERR_BITS0_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT6_OSA_ERR_BITS0_Msk 0xFFFFUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_STAT7 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT7_OSA_ERR_BITS1_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT7_OSA_ERR_BITS1_Msk 0xFFFFUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSA_STAT8 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT8_OSA_ERR_BITS2_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSA_STAT8_OSA_ERR_BITS2_Msk 0xFUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_CTLE_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_CTLE_EYEHT_EN_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_CTLE_EYEHT_EN_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_EYEHT_START_CNT_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_EYEHT_START_CNT_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_CTLE_STG1_CMADJ_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_CTLE_STG1_CMADJ_Msk 0x700UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_CTLE_CAP_FZERO_EN_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_CTLE_CAP_FZERO_EN_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_CTLE_CAP_GAIN_ADJ_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG0_CTLE_CAP_GAIN_ADJ_Msk 0x1000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_CTLE_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG1RES_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG1RES_Msk 0xFUL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG1CAP_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG1CAP_Msk 0x70UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG1BOOST_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG1BOOST_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG2RES_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG2RES_Msk 0xF00UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG2CAP_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG2CAP_Msk 0x7000UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG2BOOST_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_CFG1_CTLE_STG2BOOST_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_CTLE_STAT0 */
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_STAT0_EYEHT_ERR_CNT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_STAT0_EYEHT_ERR_CNT_Msk 0xFFFFUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_CTLE_STAT1 */
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_STAT1_EYEHT_CNT_DONE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_CTLE_STAT1_EYEHT_CNT_DONE_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_EM_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EYE_WORD_CNT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EYE_WORD_CNT_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_DATA_SAMPLE_DELAY_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_DATA_SAMPLE_DELAY_Msk 0x38UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_ROAM_SAMPLE_DELAY_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_ROAM_SAMPLE_DELAY_Msk 0x1C0UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EM_CTRL_UNUSED_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EM_CTRL_UNUSED_Msk 0xE00UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EN_EYE_ODD_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EN_EYE_ODD_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EN_EYE_EVEN_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EN_EYE_EVEN_Msk 0x2000UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_START_COUNT_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_START_COUNT_Msk 0x4000UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EN_EYEMON_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG0_EN_EYEMON_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_EM_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_ROAM_SLICEPOINT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_ROAM_SLICEPOINT_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_ROAM_SLICEPOINTSIGN1_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_ROAM_SLICEPOINTSIGN1_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_ROAM_SLICEPOINTSIGN2_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_ROAM_SLICEPOINTSIGN2_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_PIROAMPSEL_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_PIROAMPSEL_Msk 0x7F00UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_PIROAMPSEL_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_CFG1_PIROAMPSEL_EN_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_EM_STAT0 */
#define USB32DEV_PHYSS_USB40PHY_RX_EM_STAT0_EYE_ERROR_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_STAT0_EYE_ERROR_Msk 0xFFFFUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_EM_STAT1 */
#define USB32DEV_PHYSS_USB40PHY_RX_EM_STAT1_EYE_DONE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_STAT1_EYE_DONE_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_STAT1_RX_ROAMSLIC1OS_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_STAT1_RX_ROAMSLIC1OS_Msk 0x1FCUL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_STAT1_RX_ROAMSLIC2OS_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_RX_EM_STAT1_RX_ROAMSLIC2OS_Msk 0xFE00UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DFEA_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFEMAINADJ_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFEMAINADJ_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFE_PDB_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFE_PDB_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP1ADJ_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP1ADJ_Msk 0x70UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP1_PDB_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP1_PDB_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP2ADJ_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP2ADJ_Msk 0x700UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP2_PDB_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP2_PDB_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP3ADJ_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP3ADJ_Msk 0x7000UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP3_PDB_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFEA_CFG0_DFETAP3_PDB_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSAA_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJEDGESLIC1_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJEDGESLIC1_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJEDGESLIC2_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJEDGESLIC2_Msk 0x38UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJDATSLIC1_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJDATSLIC1_Msk 0x1C0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJDATSLIC2_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJDATSLIC2_Msk 0xE00UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJERRSLIC1_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG0_ADJERRSLIC1_Msk 0x7000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_OSAA_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG1_ADJERRSLIC2_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG1_ADJERRSLIC2_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG1_ADJROAMSLIC1_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG1_ADJROAMSLIC1_Msk 0x38UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG1_ADJROAMSLIC2_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG1_ADJROAMSLIC2_Msk 0x1C0UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG1_AFEOSBIASADJ_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_RX_OSAA_CFG1_AFEOSBIASADJ_Msk 0xE00UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_AFE_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_AFE_CFG_CMADJ_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_AFE_CFG_CMADJ_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_AFE_CFG_TERM_EN_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_AFE_CFG_TERM_EN_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_RX_AFE_CFG_TERM_TRIM_CFG_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_AFE_CFG_TERM_TRIM_CFG_Msk 0x1F0UL
#define USB32DEV_PHYSS_USB40PHY_RX_AFE_CFG_LPBK_EN_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_RX_AFE_CFG_LPBK_EN_Msk 0x200UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_EMA_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_EMA_CFG_PICAPSEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_EMA_CFG_PICAPSEL_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_EMA_CFG_PI_PDB_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_EMA_CFG_PI_PDB_Msk 0x10UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_REFCKSEL_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_REFCKSEL_CFG_LOCK2REF_SEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_REFCKSEL_CFG_LOCK2REF_SEL_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DIVH_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_DIVH_CFG_RECCLK_DIVH_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DIVH_CFG_RECCLK_DIVH_Msk 0x1FUL
#define USB32DEV_PHYSS_USB40PHY_RX_DIVH_CFG_RECCLK_EN_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DIVH_CFG_RECCLK_EN_Msk 0x100UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_PFD_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_PFD_CFG_PFDDELAY_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_PFD_CFG_PFDDELAY_Msk 0xFUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_CP_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_CP_CFG_IPUP_ADJ_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_CP_CFG_IPUP_ADJ_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_CP_CFG_IPDN_ADJ_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_CP_CFG_IPDN_ADJ_Msk 0x70UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_LF_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_LF_CFG_LPF_ADJ_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_LF_CFG_LPF_ADJ_Msk 0x3UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_BIASGEN_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_RX_BIASGEN_CFG0_AFEBIASSET0_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_BIASGEN_CFG0_AFEBIASSET0_Msk 0xFFFUL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_BIASGEN_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_RX_BIASGEN_CFG1_AFEBIASSET1_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_BIASGEN_CFG1_AFEBIASSET1_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_RX_BIASGEN_CFG1_CFG_BIAS_Pos 8UL
