RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
#define USB32DEV_PHYSS_USB40PHY_RX_BIASGEN_CFG1_CFG_BIAS_Msk 0x3F00UL
#define USB32DEV_PHYSS_USB40PHY_RX_BIASGEN_CFG1_BIAS_PDB_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_RX_BIASGEN_CFG1_BIAS_PDB_Msk 0x4000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_GNRL_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_BUS_BIT_MODE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_BUS_BIT_MODE_Msk 0x3UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_DESERRESETB_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_DESERRESETB_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_DATA_RATE_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_DATA_RATE_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_CLKGEN_PDB_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_CLKGEN_PDB_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_LOWPWR_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_LOWPWR_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_ERR_PATH_EN_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_ERR_PATH_EN_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_ROM_PATH_EN_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_ROM_PATH_EN_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_EDGE_DESER_EN_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_EDGE_DESER_EN_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_SUMEVN_PDB_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_SUMEVN_PDB_Msk 0x200UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_SUMODD_PDB_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_SUMODD_PDB_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_SUMVDD_PULLDOWN_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_SUMVDD_PULLDOWN_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_VCO_ADJ_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_VCO_ADJ_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_CLKINV_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_RX_GNRL_CFG_CLKINV_Msk 0x2000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_VREG_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG0_VCPREGSEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG0_VCPREGSEL_Msk 0xFUL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG0_VREGRXASEL_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG0_VREGRXASEL_Msk 0xF0UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG0_VREGRXCKSEL_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG0_VREGRXCKSEL_Msk 0xF00UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG0_VREGRXDSEL_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG0_VREGRXDSEL_Msk 0xF000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_VREG_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VCPREG_PDB_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VCPREG_PDB_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VREGRXA_PDB_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VREGRXA_PDB_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VREGRXCK_PDB_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VREGRXCK_PDB_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VREGRXD_PDB_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VREGRXD_PDB_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VCPREG_BPB_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_VCPREG_BPB_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_CPCLK_SEL_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_CPCLK_SEL_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_BURNIN_EN_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_CFG1_BURNIN_EN_Msk 0x40UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_VREG_STAT */
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_STAT_POWER_GOOD_RXA_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_STAT_POWER_GOOD_RXA_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_STAT_POWER_GOOD_RXCK_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_STAT_POWER_GOOD_RXCK_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_STAT_POWER_GOOD_RXD_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_RX_VREG_STAT_POWER_GOOD_RXD_Msk 0x4UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_SD_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_SD_CFG_LFPS_VTH_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_SD_CFG_LFPS_VTH_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_SD_CFG_LFPSDET_PDB_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_SD_CFG_LFPSDET_PDB_Msk 0x8UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_SD_STAT */
#define USB32DEV_PHYSS_USB40PHY_RX_SD_STAT_LFPSDET_OUT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_SD_STAT_LFPSDET_OUT_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_LD_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_LOCKIN_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_LOCKIN_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_FLOCKSEL_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_FLOCKSEL_Msk 0x30UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_LOCKOUTSEL_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_LOCKOUTSEL_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_LUDDISABLE_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_LUDDISABLE_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_FD_OVRD_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_FD_OVRD_Msk 0x300UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_RESETLOCKB_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_RESETLOCKB_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_LD_RESETB_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_CFG_LD_RESETB_Msk 0x800UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_LD_STAT */
#define USB32DEV_PHYSS_USB40PHY_RX_LD_STAT_PLL_LOCKED_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_LD_STAT_PLL_LOCKED_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DFE_CFG4 */
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG4_INIT_VGATAP_VALUE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG4_INIT_VGATAP_VALUE_Msk 0x1FUL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG4_TAP_UPDATE_TRSHLD_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_RX_DFE_CFG4_TAP_UPDATE_TRSHLD_Msk 0xE0UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_HDWR_ENABLE */
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_CTLE_HDWR_ENABLE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_CTLE_HDWR_ENABLE_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_DFE_HDWR_ENABLE_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_DFE_HDWR_ENABLE_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_DESER_HDWR_ENABLE_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_DESER_HDWR_ENABLE_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_CDR_HDWR_ENABLE_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_CDR_HDWR_ENABLE_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_SPARE_HDWR_ENABLE_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_HDWR_ENABLE_SPARE_HDWR_ENABLE_Msk 0x30UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_ATEST_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_CNTL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_CNTL_Msk 0xFUL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_ENABLE_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_ENABLE_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_IB20U_SEL_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_IB20U_SEL_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_DAC_TEST_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_DAC_TEST_Msk 0xF00UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_DFE_TEST_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_DFE_TEST_Msk 0x7000UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_VREGDIV_EN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_ATEST_CFG_ADFT_VREGDIV_EN_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.RX_DTEST_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_DTEST_CFG_DDFT0_SEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_DTEST_CFG_DDFT0_SEL_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_RX_DTEST_CFG_DDFT1_SEL_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_RX_DTEST_CFG_DDFT1_SEL_Msk 0x3F00UL
#define USB32DEV_PHYSS_USB40PHY_RX_DTEST_CFG_DDFT_ENABLE_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_RX_DTEST_CFG_DDFT_ENABLE_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_RX.SPARE_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_CFG_SPARE_OUT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_CFG_SPARE_OUT_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_CFG_SPARE_FT_OUT_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_CFG_SPARE_FT_OUT_Msk 0xFFF8UL
/* USB32DEV_PHYSS_USB40PHY_RX.SPARE_STAT */
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_STAT_SPARE_INPUTS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_STAT_SPARE_INPUTS_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_STAT_SPARE_FT_IN_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_STAT_SPARE_FT_IN_Msk 0xFFF8UL
/* USB32DEV_PHYSS_USB40PHY_RX.SPARE_HV_CFG */
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_HV_CFG_SPARE_HV_CFG_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_RX_SPARE_HV_CFG_SPARE_HV_CFG_Msk 0x7UL


