RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_SDM_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SDM_CFG_SDM_ENABLE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SDM_CFG_SDM_ENABLE_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SDM_CFG_DITHER_EN_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SDM_CFG_DITHER_EN_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SDM_CFG_DITHER_GAIN_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SDM_CFG_DITHER_GAIN_Msk 0x1CUL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_SSM_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG0_DIVF_FRAC_MSB_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG0_DIVF_FRAC_MSB_Msk 0xFFUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG0_DIVF_INTEGER_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG0_DIVF_INTEGER_Msk 0xFF00UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_SSM_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG1_DIVF_FRAC_LSB_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG1_DIVF_FRAC_LSB_Msk 0x3FFUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG1_SPREAD_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG1_SPREAD_Msk 0xE000UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_SSM_CFG2 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG2_SSM_STEP_CNT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG2_SSM_STEP_CNT_Msk 0x1FFUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG2_SSM_UPDATE_CNT_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG2_SSM_UPDATE_CNT_Msk 0x3E00UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG2_SSM_ENABLE_Pos 14UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_SSM_CFG2_SSM_ENABLE_Msk 0x4000UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_AFC_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_VCTL_SET_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_VCTL_SET_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_VCMP_PDB_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_VCMP_PDB_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_VCMP_SEL_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_VCMP_SEL_Msk 0xF0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_OVRD_CAPSEL_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_OVRD_CAPSEL_Msk 0x7F00UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_OVRRIDEN_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG0_AFC_OVRRIDEN_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_AFC_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_VCTL_HI_CNT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_VCTL_HI_CNT_Msk 0x1FUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_VCTL_LO_CNT_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_VCTL_LO_CNT_Msk 0x3E0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_VCTL_ENABLE_OVERRIDE_Pos 10UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_VCTL_ENABLE_OVERRIDE_Msk 0x400UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_VCTL_ENABLE_OVERRIDE_VALUE_Pos 11UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_VCTL_ENABLE_OVERRIDE_VALUE_Msk 0x800UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_SEL_MIN_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_SEL_MIN_Msk 0x1000UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_SEL_MAX_Pos 13UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG1_AFC_SEL_MAX_Msk 0x2000UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_AFC_CFG2 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG2_AFC_CLKDIVSEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG2_AFC_CLKDIVSEL_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG2_AFC_PDB_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_CFG2_AFC_PDB_Msk 0x40UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_AFC_STAT */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_STAT_CAPSEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AFC_STAT_CAPSEL_Msk 0x7FUL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_AAC_CFG0 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG0_AACREFSEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG0_AACREFSEL_Msk 0xFUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG0_AAC_OVRD_AACSEL_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG0_AAC_OVRD_AACSEL_Msk 0x1F0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG0_AAC_OVRRIDEN_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG0_AAC_OVRRIDEN_Msk 0x200UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_AAC_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG1_AAC_CLKDIVSEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG1_AAC_CLKDIVSEL_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG1_AAC_FRZCNT_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG1_AAC_FRZCNT_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG1_AAC_NORECAL_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG1_AAC_NORECAL_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG1_AAC_PDB_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_CFG1_AAC_PDB_Msk 0x100UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_AAC_STAT */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_STAT_AACSEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_AAC_STAT_AACSEL_Msk 0x1FUL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_REFCKSEL_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_REFCKSEL_CFG_REFCLKSEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_REFCKSEL_CFG_REFCLKSEL_Msk 0x7UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_DIVR_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVR_CFG_LCDIVR_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVR_CFG_LCDIVR_Msk 0xFUL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_DIVP_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_LCDIVP_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_LCDIVP_Msk 0xFUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_LCBYPASS_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_LCBYPASS_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_TX0_DIVP_PDB_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_TX0_DIVP_PDB_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_TX1_DIVP_PDB_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_TX1_DIVP_PDB_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_PLL_SYNC_ENABLE_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVP_CFG_PLL_SYNC_ENABLE_Msk 0x80UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_DIVH_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVH_CFG_HSREF_DIVH_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVH_CFG_HSREF_DIVH_Msk 0x1FUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVH_CFG_HSREF_EN_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DIVH_CFG_HSREF_EN_Msk 0x20UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_PFD_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_PFD_CFG_PFDDELAY_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_PFD_CFG_PFDDELAY_Msk 0xFUL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_CP_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_CP_CFG_CFGRCP_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_CP_CFG_CFGRCP_Msk 0xFUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_CP_CFG_ICPDAC_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_CP_CFG_ICPDAC_Msk 0xF0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_CP_CFG_CP_PDB_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_CP_CFG_CP_PDB_Msk 0x100UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_LF_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LF_CFG_LF_RTUNE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LF_CFG_LF_RTUNE_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LF_CFG_LF_CTUNE_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LF_CFG_LF_CTUNE_Msk 0x18UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_VCO_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VCO_CFG_DCVARMODE_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VCO_CFG_DCVARMODE_Msk 0xFUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VCO_CFG_VCOVARCM1_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VCO_CFG_VCOVARCM1_Msk 0xF0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VCO_CFG_VCOVARCM2_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VCO_CFG_VCOVARCM2_Msk 0xF00UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_BIASGEN_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_BIASGEN_CFG_CFG_BIAS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_BIASGEN_CFG_CFG_BIAS_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_BIASGEN_CFG_TERM_TRIM_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_BIASGEN_CFG_TERM_TRIM_Msk 0x1F00UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_GNRL_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_GNRL_CFG_PLL_PDB_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_GNRL_CFG_PLL_PDB_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_GNRL_CFG_LKDT_RESETB_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_GNRL_CFG_LKDT_RESETB_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_GNRL_CFG_RESETLOCKB_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_GNRL_CFG_RESETLOCKB_Msk 0x4UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_VREG_CFG1 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG1_VCPREGSEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG1_VCPREGSEL_Msk 0xFUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG1_VREGLCPLLSEL_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG1_VREGLCPLLSEL_Msk 0xF0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG1_VREGREFSEL_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG1_VREGREFSEL_Msk 0xF00UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG1_VREGDIGSEL_Pos 12UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG1_VREGDIGSEL_Msk 0xF000UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_VREG_CFG2 */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VCPREG_PDB_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VCPREG_PDB_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VREGLCPLL_PDB_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VREGLCPLL_PDB_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VREGREF_PDB_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VREGREF_PDB_Msk 0x4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VREGDIG_PDB_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VREGDIG_PDB_Msk 0x8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VCPREG_BPB_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_VCPREG_BPB_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_CPCLK_SEL_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_CPCLK_SEL_Msk 0x20UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_BURNIN_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_CFG2_BURNIN_Msk 0x40UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_VREG_STAT */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_STAT_PWR_GOOD_LCPLL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_STAT_PWR_GOOD_LCPLL_Msk 0x1UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_STAT_PWR_GOOD_REF_Pos 1UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_STAT_PWR_GOOD_REF_Msk 0x2UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_STAT_PWR_GOOD_DIG_Pos 2UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_VREG_STAT_PWR_GOOD_DIG_Msk 0x4UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_LD_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_LOCKOS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_LOCKOS_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_DLFCNTSEL_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_DLFCNTSEL_Msk 0x30UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_LUDDIVSEL_Pos 6UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_LUDDIVSEL_Msk 0x40UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_LUDDISABLE_Pos 7UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_LUDDISABLE_Msk 0x80UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_CRS_FD_AUXCLK_SEL_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_CRS_FD_AUXCLK_SEL_Msk 0x100UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_CRS_FD_DISABLE_Pos 9UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_CFG_CRS_FD_DISABLE_Msk 0x200UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_LD_STAT */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_STAT_FLOCK_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_LD_STAT_FLOCK_Msk 0x1UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_ATEST */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_ATEST_ADFT_SEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_ATEST_ADFT_SEL_Msk 0xFUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_ATEST_ADFT_ENABLE_Pos 4UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_ATEST_ADFT_ENABLE_Msk 0x10UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_ATEST_ADFT_VREGDIV_EN_Pos 5UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_ATEST_ADFT_VREGDIV_EN_Msk 0x20UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.PLL_DTEST */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DTEST_DDFT0_SEL_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DTEST_DDFT0_SEL_Msk 0x3FUL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DTEST_DDFT1_SEL_Pos 8UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DTEST_DDFT1_SEL_Msk 0x3F00UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DTEST_DDFT_ENABLE_Pos 15UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_PLL_DTEST_DDFT_ENABLE_Msk 0x8000UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.SPARE_CFG */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_SPARE_CFG_SPARE_OUT_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_SPARE_CFG_SPARE_OUT_Msk 0x3UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_SPARE_CFG_SPARE_FT_OUT_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_SPARE_CFG_SPARE_FT_OUT_Msk 0xFFF8UL
/* USB32DEV_PHYSS_USB40PHY_PLL_SYS.SPARE_STAT */
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_SPARE_STAT_SPARE_INPUTS_Pos 0UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_SPARE_STAT_SPARE_INPUTS_Msk 0x7UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_SPARE_STAT_SPARE_FT_IN_Pos 3UL
#define USB32DEV_PHYSS_USB40PHY_PLL_SYS_SPARE_STAT_SPARE_FT_IN_Msk 0xFFF8UL


