RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_usb32dev.h
/* USB32DEV_ADAPTER_DMA_SCK.SCK_DSCR */
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_DSCR_NUMBER_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_DSCR_NUMBER_Msk 0xFFFFUL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_DSCR_COUNT_Pos 16UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_DSCR_COUNT_Msk 0xFF0000UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_DSCR_LOW_Pos 24UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_DSCR_LOW_Msk 0xFF000000UL
/* USB32DEV_ADAPTER_DMA_SCK.SCK_SIZE */
#define USB32DEV_ADAPTER_DMA_SCK_SIZE_TRANS_SIZE_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_SIZE_TRANS_SIZE_Msk 0xFFFFFFFFUL
/* USB32DEV_ADAPTER_DMA_SCK.SCK_COUNT */
#define USB32DEV_ADAPTER_DMA_SCK_COUNT_TRANS_COUNT_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_COUNT_TRANS_COUNT_Msk 0xFFFFFFFFUL
/* USB32DEV_ADAPTER_DMA_SCK.SCK_STATUS */
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_AVL_COUNT_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_AVL_COUNT_Msk 0x1FUL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_AVL_MIN_Pos 5UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_AVL_MIN_Msk 0x3E0UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_AVL_ENABLE_Pos 10UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_AVL_ENABLE_Msk 0x400UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SCK_ZLP_ALWAYS_Pos 11UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SCK_ZLP_ALWAYS_Msk 0x800UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_STATE_Pos 15UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_STATE_Msk 0x38000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_ZLP_RCVD_Pos 18UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_ZLP_RCVD_Msk 0x40000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSPENDED_Pos 19UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSPENDED_Msk 0x80000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_ENABLED_Pos 20UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_ENABLED_Msk 0x100000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_TRUNCATE_Pos 21UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_TRUNCATE_Msk 0x200000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_EN_PROD_EVENTS_Pos 22UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_EN_PROD_EVENTS_Msk 0x400000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_EN_CONS_EVENTS_Pos 23UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_EN_CONS_EVENTS_Msk 0x800000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSP_PARTIAL_Pos 24UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSP_PARTIAL_Msk 0x1000000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSP_LAST_Pos 25UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSP_LAST_Msk 0x2000000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSP_TRANS_Pos 26UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSP_TRANS_Msk 0x4000000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSP_EOP_Pos 27UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_SUSP_EOP_Msk 0x8000000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_WRAPUP_Pos 28UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_WRAPUP_Msk 0x10000000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_UNIT_Pos 29UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_UNIT_Msk 0x20000000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_GO_SUSPEND_Pos 30UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_GO_SUSPEND_Msk 0x40000000UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_GO_ENABLE_Pos 31UL
#define USB32DEV_ADAPTER_DMA_SCK_STATUS_GO_ENABLE_Msk 0x80000000UL
/* USB32DEV_ADAPTER_DMA_SCK.SCK_INTR */
#define USB32DEV_ADAPTER_DMA_SCK_INTR_PRODUCE_EVENT_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_PRODUCE_EVENT_Msk 0x1UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_CONSUME_EVENT_Pos 1UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_CONSUME_EVENT_Msk 0x2UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_DSCR_IS_LOW_Pos 2UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_DSCR_IS_LOW_Msk 0x4UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_DSCR_NOT_AVL_Pos 3UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_DSCR_NOT_AVL_Msk 0x8UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_STALL_Pos 4UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_STALL_Msk 0x10UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_SUSPEND_Pos 5UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_SUSPEND_Msk 0x20UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_ERROR_Pos 6UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_ERROR_Msk 0x40UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_TRANS_DONE_Pos 7UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_TRANS_DONE_Msk 0x80UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_PARTIAL_BUF_Pos 8UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_PARTIAL_BUF_Msk 0x100UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_LAST_BUF_Pos 9UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_LAST_BUF_Msk 0x200UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_EVENT_RCVD_Pos 10UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_EVENT_RCVD_Msk 0x400UL
/* USB32DEV_ADAPTER_DMA_SCK.SCK_INTR_MASK */
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_PRODUCE_EVENT_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_PRODUCE_EVENT_Msk 0x1UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_CONSUME_EVENT_Pos 1UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_CONSUME_EVENT_Msk 0x2UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_DSCR_IS_LOW_Pos 2UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_DSCR_IS_LOW_Msk 0x4UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_DSCR_NOT_AVL_Pos 3UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_DSCR_NOT_AVL_Msk 0x8UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_STALL_Pos 4UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_STALL_Msk 0x10UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_SUSPEND_Pos 5UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_SUSPEND_Msk 0x20UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_ERROR_Pos 6UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_ERROR_Msk 0x40UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_TRANS_DONE_Pos 7UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_TRANS_DONE_Msk 0x80UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_PARTIAL_BUF_Pos 8UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_PARTIAL_BUF_Msk 0x100UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_LAST_BUF_Pos 9UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_LAST_BUF_Msk 0x200UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_EVENT_RCVD_Pos 10UL
#define USB32DEV_ADAPTER_DMA_SCK_INTR_MASK_EVENT_RCVD_Msk 0x400UL
/* USB32DEV_ADAPTER_DMA_SCK.DSCR_BUFFER */
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_BUFFER_BUFFER_ADDR_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_BUFFER_BUFFER_ADDR_Msk 0x7FFFFFFFUL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_BUFFER_MARKER_Pos 31UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_BUFFER_MARKER_Msk 0x80000000UL
/* USB32DEV_ADAPTER_DMA_SCK.DSCR_SYNC */
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_CONS_SCK_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_CONS_SCK_Msk 0xFFUL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_CONS_IP_Pos 8UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_CONS_IP_Msk 0x3F00UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_EN_CONS_EVENT_Pos 14UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_EN_CONS_EVENT_Msk 0x4000UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_EN_CONS_INT_Pos 15UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_EN_CONS_INT_Msk 0x8000UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_PROD_SCK_Pos 16UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_PROD_SCK_Msk 0xFF0000UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_PROD_IP_Pos 24UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_PROD_IP_Msk 0x3F000000UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_EN_PROD_EVENT_Pos 30UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_EN_PROD_EVENT_Msk 0x40000000UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_EN_PROD_INT_Pos 31UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SYNC_EN_PROD_INT_Msk 0x80000000UL
/* USB32DEV_ADAPTER_DMA_SCK.DSCR_CHAIN */
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_CHAIN_RD_NEXT_DSCR_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_CHAIN_RD_NEXT_DSCR_Msk 0xFFFFUL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_CHAIN_WR_NEXT_DSCR_Pos 16UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_CHAIN_WR_NEXT_DSCR_Msk 0xFFFF0000UL
/* USB32DEV_ADAPTER_DMA_SCK.DSCR_SIZE */
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BYTE_COUNT_MSB_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BYTE_COUNT_MSB_Msk 0x1UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_EOP_Pos 1UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_EOP_Msk 0x2UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_ERROR_Pos 2UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_ERROR_Msk 0x4UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_OCCUPIED_Pos 3UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_OCCUPIED_Msk 0x8UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_SIZE_Pos 4UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_SIZE_Msk 0xFFF0UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BYTE_COUNT_Pos 16UL
#define USB32DEV_ADAPTER_DMA_SCK_DSCR_SIZE_BYTE_COUNT_Msk 0xFFFF0000UL
/* USB32DEV_ADAPTER_DMA_SCK.EVENT */
#define USB32DEV_ADAPTER_DMA_SCK_EVENT_ACTIVE_DSCR_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_EVENT_ACTIVE_DSCR_Msk 0xFFFFUL
#define USB32DEV_ADAPTER_DMA_SCK_EVENT_EVENT_TYPE_Pos 16UL
#define USB32DEV_ADAPTER_DMA_SCK_EVENT_EVENT_TYPE_Msk 0x10000UL


/* USB32DEV_ADAPTER_DMA_SCK_GBL.SCK_INTR */
#define USB32DEV_ADAPTER_DMA_SCK_GBL_SCK_INTR_SCKINTR_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_SCK_INTR_SCKINTR_Msk 0xFFFFFFFFUL
/* USB32DEV_ADAPTER_DMA_SCK_GBL.ADAPTER_CTRL */
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAPTER_EN_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAPTER_EN_Msk 0x1UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DATA_WR_PRIO_Pos 4UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DATA_WR_PRIO_Msk 0x10UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DATA_RD_PRIO_Pos 5UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DATA_RD_PRIO_Msk 0x20UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DESC_WR_PRIO_N_Pos 6UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DESC_WR_PRIO_N_Msk 0x40UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DESC_RD_PRIO_N_Pos 7UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DESC_RD_PRIO_N_Msk 0x80UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_SUSP_PARTIAL_NO_EVT_N_Pos 10UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_SUSP_PARTIAL_NO_EVT_N_Msk 0x400UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_FQ_DEPTH_CTRL_Pos 12UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_FQ_DEPTH_CTRL_Msk 0x3F000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_DEBUG_CAPTURE_Pos 20UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_DEBUG_CAPTURE_Msk 0x100000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_EN_UNALIGNED_READ_N_Pos 21UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_EN_UNALIGNED_READ_N_Msk 0x200000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_TR_OUT_DELAY_Pos 24UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_TR_OUT_DELAY_Msk 0x3F000000UL
/* USB32DEV_ADAPTER_DMA_SCK_GBL.ADAPTER_DEBUG */
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_COUNT_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_COUNT_Msk 0xFUL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_STATE_Pos 4UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_STATE_Msk 0x70UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_ID_Pos 7UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_ID_Msk 0x1F80UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_COUNT_Pos 13UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_COUNT_Msk 0x3FE000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_STATE_Pos 22UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_STATE_Msk 0x400000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_ID_Pos 23UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_ID_Msk 0x1F800000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_ABORT_Pos 29UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_ABORT_Msk 0x20000000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_BS_STATE_Pos 30UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_BS_STATE_Msk 0xC0000000UL
/* USB32DEV_ADAPTER_DMA_SCK_GBL.ADAPTER_CONF */
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_SOCKET_ACTIVE_THRSHLD_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_SOCKET_ACTIVE_THRSHLD_Msk 0x3FUL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_STREAM_COUNT_Pos 6UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_STREAM_COUNT_Msk 0x7FC0UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_STREAMING_MODE_Pos 15UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_STREAMING_MODE_Msk 0x8000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_TS_CYCLES_Pos 16UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_TS_CYCLES_Msk 0xF0000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_ES_CYCLES_Pos 20UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_ES_CYCLES_Msk 0xF00000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_GBL_CYCLES_Pos 24UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_GBL_CYCLES_Msk 0xF000000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_MMIO_LOW_PRIORITY_Pos 28UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_MMIO_LOW_PRIORITY_Msk 0x10000000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_SWITCH_HIGH_PRIORITY_Pos 29UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_SWITCH_HIGH_PRIORITY_Msk 0x20000000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_TS_ABORT_EN_Pos 30UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_TS_ABORT_EN_Msk 0x40000000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_DESCR_PF_EN_N_Pos 31UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_DESCR_PF_EN_N_Msk 0x80000000UL
/* USB32DEV_ADAPTER_DMA_SCK_GBL.ADAPTER_STATUS */
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_TTL_SOCKETS_Pos 0UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_TTL_SOCKETS_Msk 0xFFUL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_IG_ONLY_Pos 8UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_IG_ONLY_Msk 0xFF00UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_FQ_SIZE_Pos 16UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_FQ_SIZE_Msk 0x1FF0000UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_WORD_SIZE_Pos 25UL
#define USB32DEV_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_WORD_SIZE_Msk 0x6000000UL


#endif /* _CYIP_USB32DEV_H_ */


/* [] END OF FILE */
